Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# workout_style_ElevatedButtonstyleFrom_padding_const_EdgeIn
source: ), style: ElevatedButton.styleFrom( padding: const EdgeInsets.symmetric(vertical: 16), backgroundColor: Colors.orange.shade700, foregroundColor: Colors.white, ), ); } /// Loading Indicator Widget _buildLoadingIndicator() { return Center( child: Column( children: [ CircularProgressIndicator(), SizedBox(height: 16), Text(AppLocalizations.of(context)!.aiGenerating), ], ), ); } /// Display Analysis Results Widget _buildAnalysisResult() { // Check for null if (_analysisResult == null) { return Card( color: Colors.grey.shade100, child: Padding( padding: const EdgeInsets.all(16.0), child: Text(
es: ), style: ElevatedButton.styleFrom( padding: const EdgeInsets.symmetric(vertical: 16), backgroundColor: Colors.orange.shade700, foregroundColor: Colors.white, ), ); } /// Indicador de carga Widget _buildLoadingIndicator() { return Center( child: Column( children: [ CircularProgressIndicator(), SizedBox(height: 16), Text(AppLocalizations.of(context)!.aiGenerating), ], ), ); } /// Mostrar resultados del análisis Widget _buildAnalysisResult() { // Comprobar valores nulos if (_analysisResult == null) { return Card( color: Colors.grey.shade100, child: Padding( padding: const EdgeInsets.all(16.0), child: Text(
ja: ), style: ElevatedButton.styleFrom( padding: const EdgeInsets.symmetric(vertical: 16), backgroundColor: Colors.orange.shade700, foregroundColor: Colors.white, ), ); } /// ローディングインジケーター Widget _buildLoadingIndicator() { return Center( child: Column( children: [ CircularProgressIndicator(), SizedBox(height: 16), Text(AppLocalizations.of(context)!.aiGenerating), ], ), ); } /// 分析結果表示 Widget _buildAnalysisResult() { // nullチェック if (_analysisResult == null) { return Card( color: Colors.grey.shade100, child: Padding( padding: const EdgeInsets.all(16.0), child: Text(

# exercise_ダンベルベンチプレス
source: Dumbbell bench press
es: Press de banca con mancuernas
ja: ダンベルベンチプレス

# profile_ジム検索位置情報表示Google_Maps連携
source: • Gym search and location display (Google Maps integration)
es: • Búsqueda y visualización de ubicación de gimnasios (integración con Google Maps)
ja: • ジム検索・位置情報表示（Google Maps連携）

# gym_ゴールドジム_渋谷東京
source: Gold's Gym Shibuya Tokyo
es: Gold's Gym Shibuya, Tokio
ja: ゴールドジム 渋谷東京

# general_リワード広告リトライカウンターリセット
source: 🔄 Reward ad retry counter reset
es: 🔄 Reinicio del contador de reintentos de anuncios de recompensa
ja: 🔄 リワード広告リトライカウンターリセット

# general_ホーム画面に追加を選択
source: Select "Add to Home Screen"
es: Seleccione "Agregar a la pantalla de inicio"
ja: 「ホーム画面に追加」を選択

# workout_20kg_標準
source: 20kg (standard)
es: 20 kg (estándar)
ja: 20kg (標準)

# subscription_Firestoreからプラン取得_プロプラン_UID_useruid_匿名_userisAnonym
source: ✅ Get plan from Firestore: Pro Plan (UID: ${user.uid}, Anonymous: ${user.isAnonymous})
es: ✅ Obtén el plan de Firestore: Plan Pro (UID: ${user.uid}, Anónimo: ${user.isAnonymous})
ja: ✅ Firestoreからプラン取得: プロプラン (UID: ${user.uid}, 匿名: ${user.isAnonymous})

# general_GYM_MATCH_ジム検索アプリ
source: GYM MATCH - Gym search app
es: GYM MATCH - App de búsqueda de gimnasios
ja: GYM MATCH - ジム検索アプリ

# general_Skip_docid_実力差が大きい
source: ⏭️ Skip: ${doc.id} - Big difference in ability
es: ⏭️ Saltar: ${doc.id} - Gran diferencia en habilidad
ja: ⏭️ Skip: ${doc.id} - 実力差が大きい

# general_クリーンアップ完了_cleanedCount件
source: ✅ Cleaned up: ${cleanedCount} items
es: ✅ Limpiados: ${cleanedCount} elementos
ja: ✅ クリーンアップ完了: ${cleanedCount}件

# general_具体的アクションプラン
source: ## Specific action plan
es: ## Plan de acción específico
ja: ## 具体的アクションプラン

# general_gymName_が空いています
source: 🟢 $gymName is open!
es: 🟢 ¡$gymName está abierto!
ja: 🟢 $gymName が空いています！

# general_GPS座標_currentPositionlatitude_currentPositionlongi
source: GPS coordinates: ${_currentPosition!.latitude}, ${_currentPosition!.longitude}
es: Coordenadas GPS: ${_currentPosition!.latitude}, ${_currentPosition!.longitude}
ja: GPS座標: ${_currentPosition!.latitude}, ${_currentPosition!.longitude}

# general_14日間無料
source: 14 days free
es: 14 días gratis
ja: 14日間無料

# general_プロトレーナーによる_マンツーマン指導
source: One-on-one instruction by a professional trainer
es: Instrucción individual por parte de un entrenador profesional
ja: プロトレーナーによる マンツーマン指導

# workout_if_weight_0_return_AppLocalizationsofcontextenterA
source: ; } if (weight <= 0) { return AppLocalizations.of(context)!.enterAtLeast1kg; } if (weight > 500) { return AppLocalizations.of(context)!.max500kg; } return null; }, ); } /// Weight Ratio display Widget _buildWeightRatioDisplay() { return Container( padding: const EdgeInsets.all(12), decoration: BoxDecoration( color: Colors.indigo.shade50, borderRadius: BorderRadius.circular(8), ), child: Row( children: [ Icon(Icons.analytics, color: Colors.indigo.shade700), SizedBox(width: 12), Expanded( child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Text(AppLocalizations.of(context)!.weightRatio, style: TextStyle( fontSize: 12, fontWeight: FontWeight.bold, ), ), Text(
es: ; } if (peso <= 0) { devuelve AppLocalizations.of(contexto)!.enterAtLeast1kg; } if (peso > 500) { devuelve AppLocalizations.of(contexto)!.max500kg; } devuelve null; }, ); } /// Visualización de la relación de peso Widget _buildWeightRatioDisplay() { return Container( padding: const EdgeInsets.all(12), decoration: BoxDecoration( color: Colors.indigo.shade50, borderRadius: BorderRadius.circular(8), ), child: Row( children: [ Icon(Icons.analytics, color: Colors.indigo.shade700), SizedBox(width: 12), Expanded( child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Text(AppLocalizations.of(context)!.weightRatio, style: TextStyle( fontSize: 12, fontWeight: FontWeight.bold, ), ), Text(
ja: ; } if (weight <= 0) { return AppLocalizations.of(context)!.enterAtLeast1kg; } if (weight > 500) { return AppLocalizations.of(context)!.max500kg; } return null; }, ); } /// Weight Ratio表示 Widget _buildWeightRatioDisplay() { return Container( padding: const EdgeInsets.all(12), decoration: BoxDecoration( color: Colors.indigo.shade50, borderRadius: BorderRadius.circular(8), ), child: Row( children: [ Icon(Icons.analytics, color: Colors.indigo.shade700), SizedBox(width: 12), Expanded( child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Text(AppLocalizations.of(context)!.weightRatio, style: TextStyle( fontSize: 12, fontWeight: FontWeight.bold, ), ), Text(

# general_推奨プログラム_bodyPart_のボリューム週recommendedVolume
source: } [Recommended Program] - Volume of $bodyPart: Weekly ${recommendedVolume[
es: } [Programa recomendado] - Volumen de $bodyPart: ${recommendedVolume[ semanal)
ja: } 【推奨プログラム】 ・$bodyPart のボリューム：週${recommendedVolume[

# error_週次レポート更新エラー_e
source: ❌ Weekly report update error: $e
es: ❌ Error de actualización del informe semanal: $e
ja: ❌ 週次レポート更新エラー: $e

# general_削除確認ダイアログ表示_exerciseName_ID_workoutId
source: 🔔 Display deletion confirmation dialog: $exerciseName (ID: $workoutId)
es: 🔔 Mostrar cuadro de diálogo de confirmación de eliminación: $exerciseName (ID: $workoutId)
ja: 🔔 削除確認ダイアログ表示: $exerciseName (ID: $workoutId)

# workout_exerciseNameを削除しますか_この操作は取り消せません
source: Do you want to delete "$exerciseName"? This action cannot be undone.
es: ¿Quieres eliminar "$exerciseName"? Esta acción no se puede deshacer.
ja: 「$exerciseName」を削除しますか？ この操作は取り消せません。

# general_ホーム画面にFitSyncアイコンが追加されます
source: The FitSync icon will be added to your home screen.
es: El icono de FitSync se agregará a tu pantalla de inicio.
ja: ホーム画面にFitSyncアイコンが追加されます

# profile_昼
source: noon
es: mediodía
ja: 昼

# workout_重量_男性_XXXXkg
source: Weight: Male: XX-XXkg
es: Peso: Masculino: XX-XXkg
ja: 重量: 男性: XX-XXkg

# general_初月無料_1
source: First month free 🎁
es: Primer mes gratis 🎁
ja: 初月無料🎁

# subscription_5_希望のプランを選択
source: 5. Select your desired plan
es: 5. Seleccione el plan que desee
ja: 5. 希望のプランを選択

# error_週間統計シェアエラー_e
source: ❌ Weekly Stats Share Error: $e
es: ❌ Error de estadísticas semanales: $e
ja: ❌ 週間統計シェアエラー: $e

# general_全身トレ初心者
source: Full body training beginner
es: Entrenamiento de cuerpo completo para principiantes
ja: 全身トレ初心者

# general_30日以内に5記録で習慣化_今日からスタートしませんか
source: Make it a habit by recording 5 things within 30 days! Why not start today?
es: ¡Conviértelo en un hábito y registra 5 cosas en 30 días! ¿Por qué no empiezas hoy?
ja: 30日以内に5記録で習慣化！ 今日からスタートしませんか？

# general_Firebase認証完了
source: ✅ Firebase authentication completed
es: ✅ Autenticación de Firebase completada
ja: ✅ Firebase認証完了

# gym_Premium機能
source: Premium Features
es: Funciones premium
ja: Premium機能

# general_Web環境_モック広告を表示
source: 🌐 Web environment: Show mock ads
es: Entorno web: Mostrar anuncios simulados
ja: 🌐 Web環境: モック広告を表示

# workout_前回
source: last time
es: último tiempo
ja: 前回

# error_アラート送信エラー_e
source: ❌ Alert sending error: $e
es: ❌ Error de envío de alerta: $e
ja: ❌ アラート送信エラー: $e

# general_バッジ解除_badgeId
source: ✅ Badge unlocked: $badgeId
es: ✅ Insignia desbloqueada: $badgeId
ja: ✅ バッジ解除: $badgeId

# general_オンボーディングツアー
source: • Onboarding Tour
es: • Visita de incorporación
ja: • オンボーディングツアー

# general_サポートにお問い合わせください
source: Contact support.
es: Contacte con el soporte técnico.
ja: サポートにお問い合わせください。

# general_基本特典
source: Basic benefits
es: Beneficios básicos
ja: 基本特典

# workout_テンプレートを保存しました
source: Template saved
es: Plantilla guardada
ja: テンプレートを保存しました

# workout_1RMを計算
source: Calculate your 1RM
es: Calcula tu 1RM
ja: 1RMを計算

# profile_ユーザーアプリでの表示プレビュー
source: Display preview in user app
es: Mostrar vista previa en la aplicación del usuario
ja: ユーザーアプリでの表示プレビュー

# general_200回達成AI_50回分プレゼント
source: 200 times achieved! 50 AI freebies
es: ¡200 veces logrado! 50 obsequios de IA
ja: 200回達成！AI 50回分プレゼント

# general_最初のトレーニングを_記録してみましょう
source: Record your first workout
es: Graba tu primer entrenamiento
ja: 最初のトレーニングを 記録してみましょう

# profile_リマインダー時刻
source: Reminder time
es: Hora del recordatorio
ja: リマインダー時刻

# workout_セット数_23セット
source: - Number of sets: 2-3 sets
es: - Número de series: 2-3 series
ja: - セット数: 2-3セット

# workout_前回データ読み込みエラー_e_1
source: Last data load error: $e
es: Último error de carga de datos: $e
ja: 前回データ読み込みエラー: $e

# workout_削除確認
source: Confirm deletion
es: Confirmar eliminación
ja: 削除確認

# general_2_RevenueCat_ConsoleのOfferingsに商品を追加してください
source: 2. Add the product to Offerings in the RevenueCat Console
es: 2. Agregue el producto a Ofertas en la consola de RevenueCat
ja: 2. RevenueCat ConsoleのOfferingsに商品を追加してください

# gym_平日_10001900_土_10001300
source: Weekdays 10:00-19:00, Saturdays 10:00-13:00
es: Días laborables 10:00-19:00, sábados 10:00-13:00
ja: 平日 10:00-19:00, 土 10:00-13:00

# workout_dateyear年datemonth月dateday日weekday
source: ${date.year}, ${date.month}, ${date.day} ($weekday)
es: ${fecha.año}, ${fecha.mes}, ${fecha.día} ($día de la semana)
ja: ${date.year}年${date.month}月${date.day}日($weekday)

# general_体脂肪率
source: Body fat percentage (%)
es: Porcentaje de grasa corporal (%)
ja: 体脂肪率 (%)

# workout_IMPORT_種目i_1_exercise
source: 📝 [IMPORT] Event ${i + 1}: ${exercise[
es: 📝 [IMPORTAR] Evento ${i + 1}: ${ejercicio[
ja: 📝 [IMPORT] 種目${i + 1}: ${exercise[

# general_時間効率とボリューム向上
source: Time efficiency and volume increase
es: Eficiencia de tiempo y aumento de volumen
ja: 時間効率とボリューム向上

# profile_画像を解析しています
source: Analyzing image...
es: Analizando imagen...
ja: 画像を解析しています...

# workout_PremiumProプランは無制限に使用可能
source: • Premium/Pro plans are unlimited
es: • Los planes Premium/Pro son ilimitados
ja: • Premium/Proプランは無制限に使用可能

# general_muscleGroupの回復完了
source: ${muscleGroup} recovery complete! 💪
es: ¡Recuperación de ${muscleGroup} completa! 💪
ja: ${muscleGroup}の回復完了！💪

# workout_最適な提案
source: The best proposal
es: La mejor propuesta
ja: 最適な提案

# subscription_30日間無料トライアル
source: 30-day free trial
es: Prueba gratuita de 30 días
ja: 30日間無料トライアル

# general_週suggestedChangeセット追加で最適ボリューム到達
source: Optimal volume achieved by adding ${suggestedChange} sets per week
es: Volumen óptimo logrado agregando ${suggestedChange} conjuntos por semana
ja: 週${suggestedChange}セット追加で最適ボリューム到達

# error_訪問履歴取得失敗_e
source: ❌ Failed to get visit history: $e
es: ❌ No se pudo obtener el historial de visitas: $e
ja: ❌ 訪問履歴取得失敗: $e

# gym_カーブス_中野店
source: Curves Nakano store
es: Tienda Curves Nakano
ja: カーブス 中野店

# gym_東京都千代田区外神田999
source: 9-9-9 Sotokanda, Chiyoda-ku, Tokyo
es: 9-9-9 Sotokanda, Chiyoda-ku, Tokio
ja: 東京都千代田区外神田9-9-9

# personalFactor_グラム
source: grams
es: gramos
ja: グラム

# general_Firestoreコスト最適化ガイド_1_キャッシュ活用_getCachedDocument_ドキュ
source: # Firestore Cost Optimization Guide ## 1. Utilize Caching - getCachedDocument(): Automatically cache documents when retrieving them - getCachedQuery(): Cache query results - Cache expiration: 1 hour ## 2. Batch Operations - batchWrite(): Execute multiple writes in a single transaction - Cost reduction: N writes → 1 batch operation ## 3. Index Optimization - Configure appropriate indexes for complex queries - Check index warnings in the Firebase Console ## 4. Limit Realtime Listeners - Use onSnapshot only when necessary - Don't forget to detach() when no longer needed ## 5. Optimize Data Structure - Avoid Deep Nesting - Utilize Subcollections - Retrieve Only Necessary Fields (Select) ## Estimated Cost Reductions - Read Operations: -40% - Write Operations: -30% - Total Cost: -30-50%
es: Guía de optimización de costos de Firestore ## 1. Utilizar el almacenamiento en caché - getCachedDocument(): Almacenar automáticamente los documentos en caché al recuperarlos - getCachedQuery(): Almacenar en caché los resultados de las consultas - Caducidad de la caché: 1 hora ## 2. Operaciones por lotes - batchWrite(): Ejecutar múltiples escrituras en una sola transacción - Reducción de costos: N escrituras → 1 operación por lotes ## 3. Optimización de índices - Configurar índices adecuados para consultas complejas - Consultar las advertencias de índice en la consola de Firebase ## 4. Limitar los escuchas en tiempo real - Usar onSnapshot solo cuando sea necesario - No olvidar usar detach() cuando ya no se necesite ## 5. Optimizar la estructura de datos - Evitar la anidación profunda - Utilizar subcolecciones - Recuperar solo los campos necesarios (seleccionar) ## Reducción de costos estimada - Operaciones de lectura: -40% - Operaciones de escritura: -30% - Total Costo: -30-50%
ja: # Firestoreコスト最適化ガイド ## 1. キャッシュ活用 - getCachedDocument(): ドキュメント取得時に自動キャッシュ - getCachedQuery(): クエリ結果をキャッシュ - キャッシュ有効期限: 1時間 ## 2. バッチ操作 - batchWrite(): 複数の書き込みを1回のトランザクションで実行 - コスト削減: N回の書き込み → 1回のバッチ操作 ## 3. インデックス最適化 - 複合クエリには適切なインデックスを設定 - Firebase Consoleでインデックス警告を確認 ## 4. リアルタイムリスナーの制限 - onSnapshotは必要最小限に - 不要になったらdetach()を忘れずに ## 5. データ構造の最適化 - 深いネストを避ける - サブコレクションを活用 - 必要なフィールドのみ取得（select） ## 推定コスト削減効果 - 読み取り操作: -40% - 書き込み操作: -30% - 総コスト: -30〜50%

# profile_GYM_MATCH_6言語対応
source: GYM MATCH - Available in 6 languages
es: GYM MATCH - Disponible en 6 idiomas
ja: GYM MATCH - 6言語対応

# profile_プロモーション
source: Promotion
es: Promoción
ja: プロモーション

# general_プレート不要
source: No plate required
es: No se requiere placa
ja: プレート不要

# general_会員管理
source: Membership Management
es: Gestión de membresías
ja: 会員管理

# bodyPart_例_胸トレーニング_A
source: Example: Chest Workout A
es: Ejemplo: Entrenamiento de pecho A
ja: 例: 胸トレーニング A

# profile_AI機能_無制限使用
source: Unlimited use of AI features
es: Uso ilimitado de funciones de IA
ja: AI機能 無制限使用

# general_店舗基本情報
source: Store basic information
es: Almacenar información básica
ja: 店舗基本情報

# general_セット全体の質と総挙上重量の向上
source: Improve overall set quality and total lift weight
es: Mejorar la calidad general del conjunto y el peso total de elevación
ja: セット全体の質と総挙上重量の向上

# general_直売所
source: Direct sales store
es: Tienda de venta directa
ja: 直売所

# workout_他recordexerciseslength_3種目
source: Other ${record.exercises.length - 3} events
es: Otros eventos ${record.exercises.length - 3}
ja: 他${record.exercises.length - 3}種目

# workout_変更
source: change
es: cambiar
ja: 変更

# general_システム状態
source: System Status
es: Estado del sistema
ja: システム状態

# general_種目名で検索
source: Search by event name...
es: Buscar por nombre del evento...
ja: 種目名で検索...

# general_KPIグラフと統計データ
source: KPI graphs and statistical data
es: Gráficos de KPI y datos estadísticos
ja: KPIグラフと統計データ

# general_マッピング完了_allWorkoutslengthquerySnapshotdocslength件
source: ✅ Mapping completed: ${allWorkouts.length}/${querySnapshot.docs.length}
es: ✅ Mapeo completado: ${allWorkouts.length}/${querySnapshot.docs.length}
ja: ✅ マッピング完了: ${allWorkouts.length}/${querySnapshot.docs.length}件

# profile_未指定
source: unspecified
es: no especificado
ja: 未指定

# workout_週間フィルタ後_filteredDocslength件
source: 📊 Weekly filter: ${filteredDocs.length} documents
es: 📊 Filtro semanal: ${filteredDocs.length} documentos
ja: 📊 週間フィルタ後: ${filteredDocs.length}件

# general_週次レポート更新_weekId_回数_1_負荷_totalVolumetoStringAsFixed
source: ✅ Weekly report update: $weekId (count: +1, load: +${totalVolume.toStringAsFixed(0)}kg)
es: ✅ Actualización del informe semanal: $weekId (recuento: +1, carga: +${totalVolume.toStringAsFixed(0)}kg)
ja: ✅ 週次レポート更新: $weekId (回数: +1, 負荷: +${totalVolume.toStringAsFixed(0)}kg)

# profile_ファイルパス_pickedFilepath
source: 📏 File path: ${pickedFile.path}
es: 📏 Ruta del archivo: ${pickedFile.path}
ja: 📏 ファイルパス: ${pickedFile.path}

# error_Instagram_Stories_シェアエラー_e
source: ❌ Instagram Stories Share Error: $e
es: ❌ Error al compartir historias de Instagram: $e
ja: ❌ Instagram Stories シェアエラー: $e

# workout_基本セット
source: Basic Set
es: Conjunto básico
ja: 基本セット

# workout_style_TextStyle_fontSize_11_color_Colorsgreyshade6_1
source: , style: TextStyle( fontSize: 11, color: Colors.grey.shade600, fontStyle: FontStyle.italic, ), ), ), ), ], ), ], ), ), ), ); } // == ... Colors.blue.shade50, borderRadius: BorderRadius.circular(8), border: Border.all(color: Colors.blue.shade200), ), child: Row( children: [ Icon(Icons.calendar_today, color: Colors.blue.shade700), SizedBox(width: 12), Expanded( child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Text( AppLocalizations.of(context)!.age, style: TextStyle( fontSize: 12, color: Colors.grey.shade600, ), ), Text(
es: , estilo: TextStyle( tamaño de fuente: 11, color: Colors.grey.shade600, estilo de fuente: FontStyle.italic, ), ), ), ), ], ), ], ), ), ), ); ); } // == ... Colores.azul.sombra50, Radio del borde: Radio del borde.circular(8), borde: Borde.all(color: Colores.azul.sombra200), ), hijo: Fila( hijos: [ Icono(Iconos.calendario_hoy, color: Colores.azul.sombra700), CuadroDeTamaño(ancho: 12), Expandido( hijo: Columna( AlineaciónEjeCruzado: AlineaciónEjeCruzado.start, hijos: [ Texto( AppLocalizations.of(context)!.age, estilo: EstiloDeTexto( TamañoDeFuente: 12, color: Colores.gris.sombra600, ), ), Texto(
ja: , style: TextStyle( fontSize: 11, color: Colors.grey.shade600, fontStyle: FontStyle.italic, ), ), ), ], ), ], ), ), ); } // ======================================== // 🆕 Phase 7.5: 年齢表示UI // ======================================== /// 年齢の自動取得データ表示 Widget _buildAgeDisplay() { if (_userAge != null) { return Container( padding: const EdgeInsets.all(12), decoration: BoxDecoration( color: Colors.blue.shade50, borderRadius: BorderRadius.circular(8), border: Border.all(color: Colors.blue.shade200), ), child: Row( children: [ Icon(Icons.calendar_today, color: Colors.blue.shade700), SizedBox(width: 12), Expanded( child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Text( AppLocalizations.of(context)!.age, style: TextStyle( fontSize: 12, color: Colors.grey.shade600, ), ), Text(

# workout_setactualReps_settargetReps回
source: ${set.actualReps ?? set.targetReps} times
es: ${set.actualReps ?? set.targetReps} veces
ja: ${set.actualReps ?? set.targetReps}回

# error_ブロックチェックエラー_e
source: ❌ Block check error: $e
es: ❌ Error de comprobación de bloque: $e
ja: ❌ ブロックチェックエラー: $e

# general_異常な利用パターンが検出されました
source: An unusual usage pattern has been detected.
es: Se ha detectado un patrón de uso inusual.
ja: 異常な利用パターンが検出されました。

# general_画像生成完了_imageByteslength_bytes
source: 🎨 Image generation complete: ${imageBytes.length} bytes
es: 🎨 Generación de imagen completada: ${imageBytes.length} bytes
ja: 🎨 画像生成完了: ${imageBytes.length} bytes

# general_benefitを申請する
source: ✅ Claim your $benefit
es: ✅ Reclama tu $beneficio
ja: ✅ $benefitを申請する

# subscription_追加AI回数取得エラー_e
source: ❌ Error getting additional AI count: $e
es: ❌ Error al obtener un recuento de IA adicional: $e
ja: ❌ 追加AI回数取得エラー: $e

# general_X旧TwitterまたはInstagramアプリを開く
source: Open the X (formerly Twitter) or Instagram app
es: Abre la aplicación X (anteriormente Twitter) o Instagram
ja: X（旧Twitter）またはInstagramアプリを開く

# general_山口
source: Yamaguchi
ja: 山口

# workout_final_result_await_TrainingAnalysisServiceanalyzeT
source: ); } } final result = await TrainingAnalysisService.analyzeTrainingEffect( bodyPart: _selectedBodyPart, currentSetsPerWeek: _currentSets, currentFrequency: _currentFrequency, level: _selectedLevel, gender: _selectedGender, age: _userAge!, // 🆕 Phase 7.5: Automatically obtained age recentHistory: recentHistory, ); print(
es: ); } } resultado final = await TrainingAnalysisService.analyzeTrainingEffect( bodyPart: _selectedBodyPart, currentSetsPerWeek: _currentSets, currentFrequency: _currentFrequency, level: _selectedLevel, sexo: _selectedGender, age: _userAge!, // 🆕 Fase 7.5: Edad obtenida automáticamente recientesHistorial: recientesHistorial, ); print(
ja: ); } } final result = await TrainingAnalysisService.analyzeTrainingEffect( bodyPart: _selectedBodyPart, currentSetsPerWeek: _currentSets, currentFrequency: _currentFrequency, level: _selectedLevel, gender: _selectedGender, age: _userAge!, // 🆕 Phase 7.5: 自動取得した年齢 recentHistory: recentHistory, ); print(

# general_目標値を変更
source: Change the target value
es: Cambiar el valor objetivo
ja: 目標値を変更

# profile_ImagePickerpickImage_呼び出し中
source: 📱 Calling ImagePicker.pickImage()...
es: 📱 Llamando a ImagePicker.pickImage()...
ja: 📱 ImagePicker.pickImage() 呼び出し中...

# general_主要種目の1RM推定値が34週間2未満の変化
source: Less than 2% change in estimated 1RM in key exercises over 3-4 weeks
es: Menos del 2 % de cambio en el 1RM estimado en ejercicios clave durante 3-4 semanas
ja: 主要種目の1RM推定値が3-4週間、2%未満の変化

# general_ドロップセットを導入Krzysztofik_2019_ES069
source: Introducing drop sets (Krzysztofik 2019, ES=0.69)
es: Introducción a las series descendentes (Krzysztofik 2019, ES=0,69)
ja: ドロップセットを導入（Krzysztofik 2019, ES=0.69）

# general_陸上競技場
source: athletics stadium
es: estadio de atletismo
ja: 陸上競技場

# workout_インクラインカール
source: Incline curl
es: Curl inclinado
ja: インクラインカール

# personalFactor_保存して_PFM_を更新
source: 💾 Save and update PFM
es: 💾 Guardar y actualizar PFM
ja: 💾 保存して PFM を更新

# general_この申請を承認する権限がありません
source: You are not authorized to approve this request
es: No estás autorizado para aprobar esta solicitud.
ja: この申請を承認する権限がありません

# workout_試行_retryCount_失敗_e
source: Attempts $retryCount failed: $e
es: Los intentos $retryCount fallaron: $e
ja: 試行 $retryCount 失敗: $e

# gym_formatDategymcampaignValidUntilまで
source: ~Until ${_formatDate(gym.campaignValidUntil!)}
es: ~Hasta ${_formatDate(gym.campaignValidUntil!)}
ja: ~${_formatDate(gym.campaignValidUntil!)}まで

# subscription_プレミアム特典
source: ✨ Premium Benefits
es: ✨ Beneficios Premium
ja: ✨ プレミアム特典

# general_クーポン発行_couponCode
source: ✅ Coupon issued: $couponCode
es: ✅ Cupón emitido: $couponCode
ja: ✅ クーポン発行: $couponCode

# workout_3_ラットプルダウン
source: ### 3. Lat Pulldown
es: ### 3. Jalón lateral
ja: ### 3. ラットプルダウン

# general_トレーナー記録機能は開発中です
source: Trainer record feature is under development
es: La función de registro del entrenador está en desarrollo
ja: トレーナー記録機能は開発中です

# general_脚トレ初心者
source: Leg training beginner
es: Entrenamiento de piernas para principiantes
ja: 脚トレ初心者

# general_ウォッシュ
source: Wash
es: Lavar
ja: ウォッシュ
