Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# appTagline
source: Gym search, congestion level, training record
de: Fitnessstudio-Suche · Auslastung · Training
es: Búsqueda de gimnasio, nivel de congestión, historial de entrenamiento
ja: ジム検索・混雑度・トレーニング記録
ko: 헬스장 검색 · 혼잡도 · 운동 기록
zh: 健身房搜索 · 拥挤度 · 训练记录
zh_tw: 健身房搜尋 · 擁擠度 · 訓練記錄

# navHome
source: Home
de: Startseite
es: Hogar
ja: ホーム
ko: 홈
zh: 首页
zh_tw: 首頁

# navGym
source: Gym
de: Studios
es: Gimnasia
ja: ジム
ko: 헬스장
zh: 健身房
zh_tw: 健身房

# navWorkout
source: record
de: Training
es: registro
ja: 記録
ko: 기록
zh: 记录
zh_tw: 記錄

# navProfile
source: profile
de: Profil
es: perfil
ja: プロフィール
ko: 프로필
zh: 个人
zh_tw: 個人

# save
source: keep
de: Speichern
es: mantener
ja: 保存
ko: 저장
zh: 保存
zh_tw: 保存

source: cancel
de: Abbrechen
es: Cancelar
ja: キャンセル
ko: 취소
zh: 取消
zh_tw: 取消

source: delete
de: Löschen
es: borrar
ja: 削除
ko: 삭제
zh: 删除
zh_tw: 刪除

source: edit
de: Bearbeiten
es: editar
ja: 編集
ko: 편집
zh: 编辑
zh_tw: 編輯

source: close
de: Schließen
es: cerca
ja: 閉じる
ko: 닫기
zh: 关闭
zh_tw: 關閉

source: yes
de: Ja
es: Sí
ja: はい
ko: 예
zh: 是
zh_tw: 是

source: no
de: Nein
ja: いいえ
ko: 아니오
zh: 否
zh_tw: 否

# back
source: return
de: Zurück
es: devolver
ja: 戻る
ko: 뒤로
zh: 返回
zh_tw: 返回

# next
source: to the next
de: Weiter
es: A la siguiente
ja: 次へ
ko: 다음
zh: 下一步
zh_tw: 下一步

# done
source: completion
de: Fertig
es: terminación
ja: 完了
ko: 완료
zh: 完成
zh_tw: 完成

source: Loading
de: Laden
es: Cargando
ja: 読み込み中
ko: 로딩 중
zh: 加载中
zh_tw: 載入中

source: retry
de: Wiederholen
es: rever
ja: 再試行
ko: 재시도
zh: 重试
zh_tw: 重試

# confirm
source: confirmation
de: Bestätigen
es: confirmación
ja: 確認
ko: 확인
zh: 确认
zh_tw: 確認

source: Log in
de: Anmelden
es: Acceso
ja: ログイン
ko: 로그인
zh: 登录
zh_tw: 登入

source: Logout
de: Abmelden
es: Cerrar sesión
ja: ログアウト
ko: 로그아웃
zh: 登出
zh_tw: 登出

# signUp
source: New Registration
de: Registrieren
es: Nuevo registro
ja: 新規登録
ko: 회원가입
zh: 注册
zh_tw: 注册

# email
source: email address
de: E-Mail
es: dirección de correo electrónico
ja: メールアドレス
ko: 이메일
zh: 邮箱
zh_tw: 邮箱

source: password
de: Passwort
es: contraseña
ja: パスワード
ko: 비밀번호
zh: 密码
zh_tw: 密码

# forgotPassword
source: Forgot your password?
de: Passwort vergessen?
es: ¿Olvidaste tu contraseña?
ja: パスワードを忘れた方
ko: 비밀번호 찾기
zh: 忘记密码？
zh_tw: 忘记密码？

# searchGym
source: Find a gym
de: Studio suchen
es: Encuentra un gimnasio
ja: ジムを検索
ko: 헬스장 검색
zh: 搜索健身房
zh_tw: 搜索健身房

# nearbyGyms
source: Nearby gym
de: Fitnessstudios in der Nähe
es: Gimnasio cercano
ja: 近くのジム
ko: 근처 체육관
zh: 附近健身房
zh_tw: 附近健身房

source: Gym details
de: Studio-Details
es: Detalles del gimnasio
ja: ジム詳細
ko: 헬스장 상세
zh: 健身房详情
zh_tw: 健身房详情

# crowdLevel
source: Congestion level
de: Auslastung
es: Nivel de congestión
ja: 混雑度
ko: 혼잡도
zh: 拥挤度
zh_tw: 拥挤度

source: Opening hours
de: Öffnungszeiten
es: Horario de apertura
ja: 営業時間
ko: 영업 시간
zh: 营业时间
zh_tw: 营业时间

# facilities
source: equipment
de: Ausstattung
es: equipo
ja: 設備
ko: 시설
zh: 设施
zh_tw: 设施

# reviews
source: review
de: Bewertungen
es: revisar
ja: レビュー
ko: 리뷰
zh: 评论
zh_tw: 評論

# crowdLevelEmpty
source: Available
de: Leer
es: Disponible
ja: 空いている
ko: 한산함
zh: 空闲
zh_tw: 空闲

# crowdLevelNormal
source: usually
de: Normal
es: generalmente
ja: 普通
ko: 보통
zh: 正常
zh_tw: 正常

# crowdLevelCrowded
source: congestion
de: Voll
es: congestión
ja: 混雑
ko: 혼잡
zh: 拥挤
zh_tw: 拥挤

# crowdLevelVeryCrowded
source: Very crowded
de: Sehr voll
es: Muy concurrido
ja: 非常に混雑
ko: 매우 혼잡
zh: 非常拥挤
zh_tw: 非常拥挤

# workout
source: training
es: capacitación
ja: トレーニング
ko: 운동
zh: 训练
zh_tw: 训练

# addWorkout
source: Add a record
de: Training hinzufügen
es: Agregar un registro
ja: 記録を追加
ko: 기록 추가
zh: 添加记录
zh_tw: 添加记录

# workoutHistory
source: Training History
de: Trainingshistorie
es: Historial de entrenamiento
ja: トレーニング履歴
ko: 운동 기록
zh: 训练历史
zh_tw: 訓練歷史

# exercise
source: Event
de: Übung
es: Evento
ja: 種目
ko: 종목
zh: 动作
zh_tw: 动作

# sets
source: set
de: Sätze
es: colocar
ja: セット
ko: 세트
zh: 组
zh_tw: 组数

# reps
source: times
de: Wdh.
es: veces
ja: 回
ko: 회
zh: 次
zh_tw: 次数

source: weight
de: Gewicht
es: peso
ja: 重量
ko: 체중
zh: 重量
zh_tw: 体重

# restTime
source: Break time
de: Pause
es: Tiempo de descanso
ja: 休憩時間
ko: 휴식 시간
zh: 休息时间
zh_tw: 休息时间

# duration
source: time
de: Dauer
es: tiempo
ja: 時間
ko: 시간
zh: 时长
zh_tw: 时长

source: distance
de: Distanz
es: distancia
ja: 距離
ko: 거리
zh: 距离
zh_tw: 距离

# bodyPart
source: part
de: Körperteil
es: parte
ja: 部位
ko: 부위
zh: 部位
zh_tw: 部位

# bodyPartChest
source: chest
de: Brust
es: pecho
ja: 胸
ko: 가슴
zh: 胸
zh_tw: 胸

# bodyPartBack
source: back
de: Rücken
es: atrás
ja: 背中
ko: 등
zh: 背
zh_tw: 背

# bodyPartLegs
source: leg
de: Beine
es: pierna
ja: 脚
ko: 다리
zh: 腿
zh_tw: 腿

# bodyPartShoulders
source: shoulder
de: Schultern
es: hombro
ja: 肩
ko: 어깨
zh: 肩
zh_tw: 肩

# bodyPartArms
source: arm
de: Arme
es: brazo
ja: 腕
ko: 팔
zh: 臂
zh_tw: 臂

# bodyPartAbs
source: stomach
de: Bauch
es: estómago
ja: 腹
ko: 복근
zh: 腹
zh_tw: 腹

# bodyPartCardio
source: Aerobic
de: Ausdauer
es: Aerobio
ja: 有酸素
ko: 유산소
zh: 有氧
zh_tw: 有氧

source: Strength training
de: Krafttraining
es: Entrenamiento de fuerza
ja: 筋トレ
ko: 웨이트
zh: 力量训练
zh_tw: 力量训练

# cardio
source: aerobic exercise
de: Ausdauertraining
es: ejercicio aeróbico
ja: 有酸素運動
ko: 유산소
zh: 有氧运动
zh_tw: 有氧运动

# workoutTypeFilter
source: Type Filter
de: Nach Typ filtern
es: Filtro de tipo
ja: タイプ絞り込み
ko: 유형별 필터
zh: 类型筛选
zh_tw: 类型筛选

# personalRecords
source: Personal best
de: Persönliche Rekorde
es: Mejor marca personal
ja: 自己ベスト
ko: 개인 기록
zh: 个人记录
zh_tw: 个人记录

# prTitle
source: PR Record
de: PR-Aufzeichnungen
es: Registro de relaciones públicas
ja: PR記録
ko: PR 기록
zh: PR记录
zh_tw: PR记录

# prAchieved
source: achievement
de: Erreicht
es: logro
ja: 達成
ko: 달성
zh: 达成
zh_tw: 达成

# prDaysAgo
source: {days} days ago
de: vor {days} Tagen
es: Hace {days} días
ja: {days}日前
ko: {days}일 전
zh: {days}天前
zh_tw: {days}天前

# prMonthsAgo
source: {months} months ago
de: vor {months} Monaten
es: hace {months} meses
ja: {months}ヶ月前
ko: {months}개월 전
zh: {months}个月前
zh_tw: {months}个月前

source: AI Coach
de: KI-Coach
es: Entrenador de IA
ja: AIコーチ
ko: AI 코치
zh: AI教练
zh_tw: AI教练

# aiMenu
source: AI menu suggestions
de: KI-Menüvorschlag
es: Sugerencias de menú de IA
ja: AIメニュー提案
ko: AI 메뉴 제안
zh: AI菜单推荐
zh_tw: AI菜单推荐

# aiGrowthPrediction
source: AI Growth Forecast
de: AI Wachstumsprognose
es: Pronóstico del crecimiento de la IA
ja: AI成長予測
ko: AI 성장 예측
zh: AI成长预测
zh_tw: AI成長預測

# aiEffectAnalysis
source: Effect analysis
de: Effektanalyse
es: Análisis de efectos
ja: 効果分析
ko: 효과 분석
zh: 效果分析
zh_tw: 效果分析

# aiUsageRemaining
source: AI remaining {count} times
de: {count} KI-Nutzungen übrig
es: IA restante {count} veces
ja: AI残り{count}回
ko: AI {count}회 남음
zh: 剩余AI {count}次
zh_tw: 剩余AI {count}次

source: AI Unlimited
de: Unbegrenzte KI
es: IA ilimitada
ja: AI無制限
ko: 무제한 AI
zh: AI无限次
zh_tw: AI无限次

# scientificBasis
source: Scientific evidence
de: Wissenschaftliche Grundlage
es: Evidencia científica
ja: 科学的根拠
ko: 과학적 근거
zh: 科学依据
zh_tw: 科学依据

# basedOnPapers
source: Based on over 40 papers
de: Basiert auf über 40 Forschungsarbeiten
es: Basado en más de 40 artículos
ja: 40本以上の論文に基づく
ko: 40개 이상의 논문 기반
zh: 基于40+篇研究论文
zh_tw: 基于40+篇研究论文

source: Subscription
de: Abonnement
es: Suscripción
ja: サブスクリプション
ko: 구독
zh: 订阅
zh_tw: 訂閱

source: Free Plan
de: Kostenloser Plan
es: Plan gratuito
ja: 無料プラン
ko: 무료 플랜
zh: 免费计划
zh_tw: 免費計劃

source: Premium Plan
es: Plan Premium
ja: Premiumプラン
ko: 프리미엄 플랜
zh: Premium计划
zh_tw: Premium計劃

source: Pro Plan
es: Plan Pro
ja: Proプラン
ko: 프로 플랜
zh: Pro计划
zh_tw: Pro計劃

source: Current Plan
de: Aktueller Plan
es: Plan actual
ja: 現在のプラン
ko: 현재 플랜
zh: 当前计划
zh_tw: 当前计划

# upgradePlan
source: Upgrade your plan
de: Plan upgraden
es: Mejora tu plan
ja: プランをアップグレード
ko: 플랜 업그레이드
zh: 升级计划
zh_tw: 升級計劃

# monthlyPrice
source: Monthly
de: Monatlich
es: Mensual
ja: 月額
ko: 월간
zh: 月付
zh_tw: 月付

# annualPrice
source: Annual fee
de: Jährlich
es: Cuota anual
ja: 年額
ko: 연간
zh: 年付
zh_tw: 年付

# pricePerMonth
source: {price}/month
de: {price}/Monat
es: {price}/mes
ja: {price}/月
ko: {price}/월
zh: {price}/月
zh_tw: {price}/月

# pricePerYear
source: {price}/year
de: {price}/Jahr
es: {price}/año
ja: {price}/年
ko: {price}/년
zh: {price}/年
zh_tw: {price}/年

source: Free Trial
de: Kostenlose Testversion
es: Prueba gratuita
ja: 無料トライアル
ko: 무료 체험
zh: 免费试用
zh_tw: 免費試用

# freeTrialDays
source: {days} day free trial
de: {days} Tage kostenlos
es: {days} día de prueba gratuita
ja: {days}日間無料トライアル
ko: {days}일 무료
zh: {days}天免费
zh_tw: {days}天免费

source: No ads
de: Keine Werbung
es: Sin anuncios
ja: 広告なし
ko: 광고 없음
zh: 无广告
zh_tw: 無廣告

# adSupported
source: Advertisements included
de: Mit Werbung
es: Anuncios incluidos
ja: 広告表示あり
ko: 광고 포함
zh: 含广告
zh_tw: 含广告

source: profile
de: Profil
es: perfil
ja: プロフィール
ko: 프로필
zh: 个人资料
zh_tw: 个人资料

source: Edit profile
de: Profil bearbeiten
es: Editar perfil
ja: プロフィール編集
ko: 프로필 편집
zh: 编辑资料
zh_tw: 编辑资料

# settings
source: setting
de: Einstellungen
es: configuración
ja: 設定
ko: 설정
zh: 设置
zh_tw: 设置

source: name
es: nombre
ja: 名前
ko: 이름
zh: 姓名
zh_tw: 姓名

source: age
de: Alter
es: edad
ja: 年齢
ko: 나이
zh: 年龄
zh_tw: 年龄

source: height
de: Größe
es: altura
ja: 身長
ko: 키
zh: 身高
zh_tw: 身高

# goal
source: the goal
de: Ziel
es: el objetivo
ja: 目標
ko: 목표
zh: 目标
zh_tw: 目标

source: statistics
de: Statistiken
es: estadística
ja: 統計
ko: 통계
zh: 统计
zh_tw: 统计

source: Weekly Report
de: Wochenbericht
es: Informe semanal
ja: 週次レポート
ko: 주간 보고서
zh: 周报告
zh_tw: 周报告

# totalVolume
source: Total Load
de: Gesamtvolumen
es: Carga total
ja: 総負荷量
ko: 총 볼륨
zh: 总负荷量
zh_tw: 总重量

source: Total Reps
de: Gesamtwiederholungen
es: Total de repeticiones
ja: 総レップ数
ko: 총 반복
zh: 总次数
zh_tw: 总次数

# totalSets
source: Total number of sets
de: Gesamtsätze
es: Número total de conjuntos
ja: 総セット数
ko: 총 세트
zh: 总组数
zh_tw: 总组数

# workoutCount
source: Number of training sessions
de: Trainingsanzahl
es: Número de sesiones de entrenamiento
ja: トレーニング回数
ko: 운동 횟수
zh: 训练次数
zh_tw: 训练次数

source: error
de: Fehler
ja: エラー
ko: 오류
zh: 错误
zh_tw: 错误

# errorGeneric
source: An error has occurred
de: Ein Fehler ist aufgetreten
es: Se ha producido un error.
ja: エラーが発生しました
ko: 오류가 발생했습니다
zh: 发生错误
zh_tw: 发生错误

# errorNetwork
source: Network Error
de: Netzwerkfehler
es: Error de red
ja: ネットワークエラー
ko: 네트워크 오류
zh: 网络错误
zh_tw: 网络错误

# errorAuth
source: Authentication Error
de: Authentifizierungsfehler
es: Error de autenticación
ja: 認証エラー
ko: 인증 오류
zh: 认证错误
zh_tw: 认证错误

# errorDataNotFound
source: Data not found
de: Daten nicht gefunden
es: Datos no encontrados
ja: データが見つかりません
ko: 데이터를 찾을 수 없습니다
zh: 数据未找到
zh_tw: 数据未找到

# errorPermissionDenied
source: Unauthorized
de: Zugriff verweigert
es: No autorizado
ja: 権限がありません
ko: 권한이 없습니다
zh: 权限被拒绝
zh_tw: 权限被拒绝

source: success
de: Erfolg
es: éxito
ja: 成功
ko: 성공
zh: 成功
zh_tw: 成功

source: Saved
de: Gespeichert
es: Guardado
ja: 保存しました
ko: 저장됨
zh: 已保存
zh_tw: 已保存

source: Deleted
de: Gelöscht
es: Eliminado
ja: 削除しました
ko: 삭제됨
zh: 已删除
zh_tw: 已删除

source: Updated
de: Aktualisiert
es: Actualizado
ja: 更新しました
ko: 업데이트됨
zh: 已更新
zh_tw: 已更新

# trainingPartner
source: Training Partners
de: Trainingspartner
es: Socios de formación
ja: トレーニングパートナー
ko: 운동 파트너
zh: 训练伙伴
zh_tw: 训练伙伴

# findPartner
source: Find a partner
de: Partner finden
es: Encuentra un socio
ja: パートナーを探す
ko: 파트너 찾기
zh: 寻找伙伴
zh_tw: 寻找伙伴

# myPartners
source: My Partner
de: Meine Partner
es: Mi pareja
ja: マイパートナー
ko: 내 파트너
zh: 我的伙伴
zh_tw: 我的伙伴

# partnerRequests
source: request
de: Anfragen
es: pedido
ja: リクエスト
ko: 요청
zh: 请求
zh_tw: 请求

# messaging
source: message
de: Nachrichten
es: mensaje
ja: メッセージ
ko: 메시지
zh: 消息
zh_tw: 消息

# todaysWorkout
source: Today's Training
de: Heuteのトレーニング
es: Entrenamiento de hoy
ja: 今日のトレーニング
ko: 오늘のトレーニング
zh: 今天のトレーニング
zh_tw: 今天のトレーニング

# workoutRecords
source: Training Record
de: Trainingsprotokoll
es: Registro de entrenamiento
ja: トレーニング記録
ko: 운동 기록
zh: 训练记录
zh_tw: 訓練記錄

# noWorkoutRecordsForDate
source: There are no training records for {month} and {day}.
de: {month}Monat{day}TagのTrainingsprotokollはありません
es: No hay registros de entrenamiento para {month} y {day}.
ja: {month}月{day}日のトレーニング記録はありません
ko: {month}월{day}일の운동 기록はありません
zh: {month}月{day}日の训练记录はありません
zh_tw: {month}月{day}日の訓練記錄はありません

source: Details section
de: Detailsセクション
es: Sección de detalles
ja: 詳細セクション
ko: 상세セクション
zh: 详情セクション
zh_tw: 詳情セクション

# showDetailsSection
source: View detailed section (Fatigue Management/Goals)
de: DetailsセクションをAnzeigen（疲労管理・Ziel）
es: Ver sección detallada (Gestión de la fatiga/Objetivos)
ja: 詳細セクションを表示（疲労管理・目標）
ko: 상세セクションを표시（疲労管理・목표）
zh: 详情セクションを显示（疲労管理・目标）
zh_tw: 詳情セクションを顯示（疲労管理・目標）

# hideDetailsSection
source: Close the details section
de: Detailsセクションを閉じる
es: Cerrar la sección de detalles
ja: 詳細セクションを閉じる
ko: 상세セクションを閉じる
zh: 详情セクションを閉じる
zh_tw: 詳情セクションを閉じる

source: Settings Menu
de: Einstellungenメニュー
es: Menú de configuración
ja: 設定メニュー
ko: 설정メニュー
zh: 设置メニュー
zh_tw: [ZH_TW] 設定メニュー

# personalFactorsSettings
source: Personal Factor Settings
de: 個人要因Einstellungen
es: Configuración de factores personales
ja: 個人要因設定
ko: 個人要因설정
zh: 個人要因设置
zh_tw: [ZH_TW] 個人要因設定

# trainingMemo
source: Training Notes
de: Trainingsnotiz
es: Notas de entrenamiento
ja: トレーニングメモ
ko: 훈련 메모
zh: 训练备忘
zh_tw: 訓練備忘

# pastTrainingRecords
source: Check past training records
de: 過去のTrainingsprotokollをBestätigen
es: Revise sus registros de entrenamiento anteriores
ja: 過去のトレーニング記録を確認
ko: 過去の운동 기록を확인
zh: 過去の训练记录を确认
zh_tw: 過去の訓練記錄を確認

# editPersonalFactors
source: Edit age, experience, sleep, nutrition, etc.
de: Jahr齢・経験・睡眠・栄養などをBearbeiten
es: Editar edad, experiencia, sueño, nutrición, etc.
ja: 年齢・経験・睡眠・栄養などを編集
ko: 년齢・経験・睡眠・栄養などを편집
zh: 年齢・経験・睡眠・栄養などを编辑
zh_tw: 年齢・経験・睡眠・栄養などを編輯

# noShareableRecords
source: No training records to share
de: シェアできるTrainingsprotokollがありません
es: No hay registros de entrenamiento para compartir
ja: シェアできるトレーニング記録がありません
ko: シェアできる운동 기록がありません
zh: シェアできる训练记录がありません
zh_tw: シェアできる訓練記錄がありません

# strengthTrainingFilter
source: Strength training
de: Gewichtstraining
es: Entrenamiento de fuerza
ja: 筋トレ
ko: 웨이트 트레이닝
zh: 重量训练
zh_tw: 重量訓練

# cardioFilter
source: Aerobic
de: [DE] 有酸素
es: Aerobio
ja: 有酸素
ko: [KO] 有酸素
zh: [ZH] 有酸素
zh_tw: [ZH_TW] 有酸素

# setTypeInfo
source: How to read set types
de: Satzタイプの見方
es: Cómo leer tipos de conjuntos
ja: セットタイプの見方
ko: 세트タイプの見方
zh: 组タイプの見方
zh_tw: 組タイプの見方

# byBodyPart
source: By part
de: [DE] 部位別
es: Por parte
ja: 部位別
ko: [KO] 部位別
zh: [ZH] 部位別
zh_tw: [ZH_TW] 部位別

# memo
source: Note
de: [DE] メモ
es: Nota
ja: メモ
ko: [KO] メモ
zh: [ZH] メモ
zh_tw: [ZH_TW] メモ

source: Achievements and Goals
de: 実績とZiel
es: Logros y metas
ja: 実績と目標
ko: 実績と목표
zh: 実績と目标
zh_tw: [ZH_TW] 実績と目標

# achievements
source: Performance notification
de: 実績Benachrichtigungen
es: Notificación de rendimiento
ja: 実績通知
ko: 업적 알림
zh: [ZH] 実績通知
zh_tw: [ZH_TW] 実績通知

# goals
source: the goal
de: Ziel
es: el objetivo
ja: 目標
ko: 목표
zh: 目标
zh_tw: 目標

source: Fatigue Management
de: [DE] 疲労管理
es: Manejo de la fatiga
ja: 疲労管理
ko: [KO] 疲労管理
zh: [ZH] 疲労管理
zh_tw: [ZH_TW] 疲労管理

# importFromPhoto
source: Import from photos/CSV
de: Aus Foto/CSV importieren
es: Importar desde fotos/CSV
ja: 写真・CSVから取り込み
ko: 사진/CSV로부터 가져오기
zh: 从照片/CSV导入
zh_tw: 从照片/CSV导入

# importFromPhotoSubtitle
source: Automatically converts recorded images and CSV files from other apps into data
de: Bilder & CSV-Dateien automatisch konvertieren
es: Convierte automáticamente imágenes grabadas y archivos CSV de otras aplicaciones en datos
ja: 他アプリの記録画像・CSVファイルを自動データ化
ko: 다른 앱 기록 이미지/CSV 파일 자동 데이터화
zh: 自动转换其他应用的记录图像和CSV文件
zh_tw: 自动转换其他应用的记录图像和CSV文件

source: Personal Training
es: Entrenamiento personal
ja: パーソナルトレーニング
ko: 퍼스널 트레이닝
zh: 私人训练
zh_tw: 私人训练

# personalTrainingSubtitle
source: Reservation status, training records, reservation applications
de: Buchungen, Aufzeichnungen & Reservierungen
es: Estado de reserva, registros de capacitación, solicitudes de reserva
ja: 予約状況・トレーニング記録・予約申込
ko: 예약 현황·트레이닝 기록·예약 신청
zh: 预约状况·训练记录·预约申请
zh_tw: 预约状况·训练记录·预约申请

# aiAddonPurchase
source: Additional purchase of AI
de: AI-Credits kaufen
es: Compra adicional de IA
ja: AI追加購入
ko: AI 추가 구매
zh: 购买AI积分
zh_tw: 购买AI积分

# aiAddonSubtitle
source: Purchase additional AI coaching sessions
de: Zusätzliche AI-Coaching-Credits kaufen
es: Comprar sesiones adicionales de entrenamiento de IA
ja: AIコーチング回数を追加購入
ko: AI 코칭 횟수 추가 구매
zh: 购买额外的AI指导积分
zh_tw: 购买额外的AI指导积分

# favorites
source: Favorite Gym
de: Lieblings-Fitnessstudios
es: Gimnasio favorito
ja: お気に入りジム
ko: 즐겨찾기 헬스장
zh: 收藏健身房
zh_tw: 收藏健身房

# favoritesCount
source: {count} items
de: {count} Einträge
es: {count} artículos
ja: {count}件
ko: {count}개
zh: {count}个
zh_tw: {count}个

# bodyMeasurement
source: Weight and body composition record
de: Körpermessungen
es: Registro de peso y composición corporal
ja: 体重・体組成記録
ko: 체중·체성분 기록
zh: 体重·体成分记录
zh_tw: 体重·体成分记录

source: Visit history
de: Besuchsverlauf
es: Historial de visitas
ja: 訪問履歴
ko: 방문 기록
zh: 健身房访问记录
zh_tw: 健身房访问记录

# messages
source: message
de: Nachrichten
es: mensaje
ja: メッセージ
ko: 메시지
zh: 消息
zh_tw: 消息

# unreadMessages
source: {count} unread items
de: {count} ungelesen
es: {count} elementos no leídos
ja: {count}件の未読
ko: {count}개의 읽지 않음
zh: {count}条未读
zh_tw: {count}条未读

source: Training Partners
de: Trainingspartner
es: Socios de formación
ja: トレーニングパートナー
ko: 트레이닝 파트너
zh: 训练伙伴
zh_tw: 训练伙伴

# partnersCount
source: {count} people
de: {count} Partner
es: {count} personas
ja: {count}人
ko: {count}명
zh: {count}人
zh_tw: {count}人

# inviteCode
source: Enter invitation code
de: Einladungscode eingeben
es: Introduzca el código de invitación
ja: 招待コード入力
ko: 초대 코드 입력
zh: 输入邀请码
zh_tw: 输入邀请码

source: Campaign Registration
de: Kampagnen-Registrierung
es: Registro de campaña
ja: キャンペーン登録
ko: 캠페인 등록
zh: 活动注册
zh_tw: 活动注册

# legalInfo
source: legal information
de: Rechtliche Informationen
es: información legal
ja: 法的情報
ko: 법률 정보
zh: 法律信息
zh_tw: 法律信息

# sellerInfo
source: Merchant and Refund Policy
de: Verkäuferinfo & Rückerstattung
es: Política de comercio y reembolso
ja: 販売事業者・返金ポリシー
ko: 판매 사업자·환불 정책
zh: 销售商·退款政策
zh_tw: 销售商·退款政策

# workoutLog
source: Training Record
de: Trainingsprotokoll
es: Registro de entrenamiento
ja: トレーニング記録
ko: 트레이닝 기록
zh: 训练记录
zh_tw: 训练记录

# addSet
source: Add a set
de: Satz hinzufügen
es: Agregar un conjunto
ja: セット追加
ko: 세트 추가
zh: 添加组
zh_tw: 添加组

source: Set {number}
de: Satz {number}
es: Establecer {number}
ja: セット{number}
ko: 세트 {number}
zh: 第{number}组
zh_tw: 第{number}组

# warmupSet
source: Warm-up
de: Aufwärmen
es: Calentamiento
ja: ウォームアップ
ko: 워밍업
zh: 热身
zh_tw: 热身

# workingSet
source: working
de: Arbeitssatz
es: laboral
ja: ワーキング
ko: 워킹
zh: 工作组
zh_tw: 工作组

# dropSet
source: drop
es: gota
ja: ドロップ
ko: 드롭
zh: 递减
zh_tw: 递减

# failureSet
source: limit
de: Versagen
es: límite
ja: 限界
ko: 한계
zh: 力竭
zh_tw: 力竭

# restPauseSet
source: Rest Pose
de: Rest-Pause
es: Postura de descanso
ja: レストポーズ
ko: 레스트 포즈
zh: 休息暂停
zh_tw: 休息暂停

source: Superset
de: Supersatz
es: Superconjunto
ja: スーパーセット
ko: 슈퍼세트
zh: 超级组
zh_tw: 超级组

source: tempo
ja: テンポ
ko: 템포
zh: 节奏
zh_tw: 节奏

# notes
source: Note
de: Notizen
es: Nota
ja: メモ
ko: 메모
zh: 备注
zh_tw: 备注

# addExercise
source: Add an event
de: Übung hinzufügen
es: Agregar un evento
ja: 種目を追加
ko: 종목 추가
zh: 添加项目
zh_tw: 添加项目

# selectExercise
source: Select an event
de: Übung auswählen
es: Seleccione un evento
ja: 種目を選択
ko: 운동 선택
zh: 选择项目
zh_tw: 选择项目

# customExercise
source: Custom Events
de: Benutzerdefinierte Übung
es: Eventos personalizados
ja: カスタム種目
ko: 사용자 정의 운동
zh: 自定义项目
zh_tw: 自定义项目

# searchExercise
source: Search for an event
de: Übung suchen
es: Buscar un evento
ja: 種目を検索
ko: 운동 검색
zh: 搜索项目
zh_tw: 搜索项目

# recentExercises
source: Recently used items
de: Letzte Übungen
es: Artículos usados recientemente
ja: 最近使用した種目
ko: 최근 사용한 종목
zh: 最近使用的项目
zh_tw: 最近使用的项目

# popularExercises
source: Popular Events
de: Beliebte Übungen
es: Eventos populares
ja: 人気の種目
ko: 인기 종목
zh: 热门项目
zh_tw: 热门项目

# allExercises
source: All events
de: Alle Übungen
es: Todos los eventos
ja: すべての種目
ko: 모든 종목
zh: 所有项目
zh_tw: 所有项目

# workoutDate
source: date
de: Datum
es: fecha
ja: 日付
ko: 날짜
zh: 日期
zh_tw: 日期

# workoutTime
source: time
de: Zeit
es: tiempo
ja: 時刻
ko: 시간
zh: 时间
zh_tw: 时间

# workoutDuration
source: Training time
de: Trainingsdauer
es: Tiempo de entrenamiento
ja: トレーニング時間
ko: 시간
zh: 训练时长
zh_tw: 时长

# totalWeight
source: gross weight
de: Gesamtgewicht
es: peso bruto
ja: 総重量
ko: 총 중량
zh: 总重量
zh_tw: 总重量

# maxWeight
source: maximum weight
de: Maximalgewicht
es: peso máximo
ja: 最大重量
ko: 최대 무게
zh: 最大重量
zh_tw: 最大重量

# avgWeight
source: average weight
de: Durchschnittsgewicht
es: peso promedio
ja: 平均重量
ko: 평균 중량
zh: 平均重量
zh_tw: 平均重量

# estimatedMax
source: Estimated 1RM
de: Geschätztes 1RM
es: Estimado 1RM
ja: 推定1RM
ko: 추정 1RM
zh: 估计1RM
zh_tw: 估计1RM

source: Filter by date
de: Nach Datum filtern
es: Filtrar por fecha
ja: 日付で絞込
ko: 날짜로 필터
zh: 按日期筛选
zh_tw: 按日期筛选

# filterByExercise
source: Narrow down by event
de: Nach Übung filtern
es: Refinar por evento
ja: 種目で絞込
ko: 종목으로 필터
zh: 按项目筛选
zh_tw: 按项目筛选

# filterByMuscle
source: Narrow down by part
de: Nach Muskel filtern
es: Refinar por parte
ja: 部位で絞込
ko: 부위로 필터
zh: 按部位筛选
zh_tw: 按部位筛选

# sortBy
source: Sort
de: Sortieren nach
es: Clasificar
ja: 並び替え
ko: 정렬 기준
zh: 排序方式
zh_tw: 排序方式

# sortByDate
source: By date
de: Nach Datum
es: Por fecha
ja: 日付順
ko: 날짜순
zh: 按日期
zh_tw: 按日期

# sortByVolume
source: By weight
de: Nach Volumen
es: Por peso
ja: 重量順
ko: 중량순
zh: 按重量
zh_tw: 按重量

# sortByDuration
source: Chronological
de: Nach Dauer
es: Cronológico
ja: 時間順
ko: 시간순
zh: 按时长
zh_tw: 按时长

source: this week
de: Diese Woche
es: esta semana
ja: 今週
ko: 이번 주
zh: 本周
zh_tw: 本周

source: this month
de: Dieser Monat
es: este mes
ja: 今月
ko: 이번 달
zh: 本月
zh_tw: 本月

source: Last 7 days
de: Letzte 7 Tage
es: Últimos 7 días
ja: 過去7日
ko: 최근 7일
zh: 最近7天
zh_tw: 最近7天

source: Last 30 days
de: Letzte 30 Tage
es: Últimos 30 días
ja: 過去30日
ko: 최근 30일
zh: 最近30天
zh_tw: 最近30天

source: Last 90 days
de: Letzte 90 Tage
es: Últimos 90 días
ja: 過去90日
ko: 최근 90일
zh: 最近90天
zh_tw: 最近90天

# allTime
source: All period
de: Gesamte Zeit
es: Todo el periodo
ja: 全期間
ko: 전체 기간
zh: 全部时间
zh_tw: 全部时间

# customRange
source: Custom Period
de: Benutzerdefinierter Zeitraum
es: Periodo personalizado
ja: カスタム期間
ko: 사용자 지정 기간
zh: 自定义时间段
zh_tw: 自定义时间段

# chart
source: graph
de: Diagramm
es: gráfico
ja: グラフ
ko: 차트
zh: 图表
zh_tw: 图表

source: list
de: Liste
es: lista
ja: リスト
ko: 목록
zh: 列表
zh_tw: 列表

source: calendar
de: Kalender
es: calendario
ja: カレンダー
ko: 캘린더
zh: 日历
zh_tw: 日历

source: Summary
de: Zusammenfassung
es: Resumen
ja: サマリー
ko: 요약
zh: 概要
zh_tw: 概要

# details
source: detail
de: Details
es: detalle
ja: 詳細
ko: 상세
zh: 详细
zh_tw: 详细

source: progress
de: Fortschritt
es: progreso
ja: 進捗
ko: 진행
zh: 进度
zh_tw: 进度

source: analysis
de: Analyse
es: análisis
ja: 分析
ko: 분석
zh: 分析
zh_tw: 分析

source: body weight
de: Körpergewicht
es: peso corporal
ja: 体重
ko: 체중
zh: 体重
zh_tw: 体重

# bodyFat
source: body fat percentage
de: Körperfett %
es: porcentaje de grasa corporal
ja: 体脂肪率
ko: 체지방률
zh: 体脂率
zh_tw: 体脂率

source: Muscle mass
de: Muskelmasse
es: Masa muscular
ja: 筋肉量
ko: 근육량
zh: 肌肉量
zh_tw: 肌肉量

source: Measurement date
de: Datum
es: Fecha de medición
ja: 測定日
ko: 측정일
zh: 测量日期
zh_tw: 测量日期

# addMeasurement
source: Add measurement record
de: Messung hinzufügen
es: Agregar registro de medición
ja: 測定記録を追加
ko: 측정 기록 추가
zh: 添加测量记录
zh_tw: 添加测量记录

# template
source: Templates
de: Vorlage
es: Plantillas
ja: テンプレート
ko: 템플릿
zh: 模板
zh_tw: 模板

source: Templates
de: Vorlagen
es: Plantillas
ja: テンプレート
ko: 템플릿
zh: 模板
zh_tw: 模板

# createTemplate
source: Template Creation
de: Vorlage erstellen
es: Creación de plantillas
ja: テンプレート作成
ko: 템플릿 만들기
zh: 创建模板
zh_tw: 创建模板

source: Save as template
de: Als Vorlage speichern
es: Guardar como plantilla
ja: テンプレートとして保存
ko: 템플릿으로 저장
zh: 保存为模板
zh_tw: 保存为模板

# useTemplate
source: Use a template
de: Vorlage verwenden
es: Utilice una plantilla
ja: テンプレートを使用
ko: 템플릿 사용
zh: 使用模板
zh_tw: 使用模板

source: Template Name
de: Vorlagenname
es: Nombre de la plantilla
ja: テンプレート名
ko: 템플릿 이름
zh: 模板名称
zh_tw: 模板名称
