Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# workout_return_else_有料プランで月次上限に達している_if_mounted_await_show
source: ); } return; } } else { / Paid plan monthly limit reached if (mounted) { await _showUpgradeDialog(
es: ); } return; } } else { / Se alcanzó el límite mensual del plan de pago if (mounted) { await _showUpgradeDialog(
ja: ); } return; } } else { // 有料プランで月次上限に達している if (mounted) { await _showUpgradeDialog(

# gym_gymcampaignValidUntilyeargymcampaignValidUntilmont
source: Until ${gym.campaignValidUntil!.year}/${gym.campaignValidUntil!.month}/${gym.campaignValidUntil!.day}
es: Hasta ${gym.campaignValidUntil!.year}/${gym.campaignValidUntil!.month}/${gym.campaignValidUntil!.day}
ja: ${gym.campaignValidUntil!.year}/${gym.campaignValidUntil!.month}/${gym.campaignValidUntil!.day}まで

# workout_種目選択肢部位ごと_exercisesByBodyPart_l10nmusclePecs_l10ne
source: , ]; // Exercise options (by body part) _exercisesByBodyPart = { l10n.musclePecs: [l10n.exerciseBenchPress,
es: , ]; // Opciones de ejercicio (por parte del cuerpo) _exercisesByBodyPart = { l10n.musclePecs: [l10n.exerciseBenchPress,
ja: , ]; // 種目選択肢（部位ごと） _exercisesByBodyPart = { l10n.musclePecs: [l10n.exerciseBenchPress,

# workout_テンプレート作成_匿名認証成功
source: ✅ Template creation: Anonymous authentication successful
es: ✅ Creación de plantilla: Autenticación anónima exitosa
ja: ✅ テンプレート作成: 匿名認証成功

# workout_AI応答_text
source: ✅ AI response: $text
es: ✅ Respuesta de IA: $texto
ja: ✅ AI応答: $text

# personalFactor_静的要因
source: 📊 Static Factors
es: 📊 Factores estáticos
ja: 📊 静的要因

# gym_お気に入り済み
source: Favorited
es: Favoritos
ja: お気に入り済み

# general_keywordフィットネストレーニングジムスポーツクラブ
source: &keyword=fitness|training|gym|sports club
es: &keyword=fitness|entrenamiento|gimnasio|club deportivo
ja: &keyword=フィットネス|トレーニング|ジム|スポーツクラブ

# general_岡山
source: Okayama
ja: 岡山

# workout_レスポンス全文_responsebody
source: 📄 Full response: ${response.body}
es: 📄 Respuesta completa: ${response.body}
ja: 📄 レスポンス全文: ${response.body}

# error_お気に入り読み込みエラー_e
source: ❌ Error loading favorites: $e
es: ❌ Error al cargar favoritos: $e
ja: ❌ お気に入り読み込みエラー: $e

# subscription_トライアル条件
source: Trial Terms
es: Términos de prueba
ja: トライアル条件

# workout_canEarnCreditFromAd結果_canEarnFromAd
source: canEarnCreditFromAdResult: $canEarnFromAd
es: Resultado de canEarnCreditFromAd: $canEarnFromAd
ja: canEarnCreditFromAd結果: $canEarnFromAd

# general_区役所
source: Ward office
es: Oficina del barrio
ja: 区役所

# general_滋賀
source: Shiga
ja: 滋賀

# subscription_サブスクリプション再開
source: ✅ Restart your subscription
es: ✅ Reinicia tu suscripción
ja: ✅ サブスクリプション再開

# general_現在のプログラムは科学的に最適な範囲内ですこのまま継続することで効果的な成長が期待できます
source: The current program is within the scientifically optimal range, and continuing it will likely result in effective growth.
es: El programa actual está dentro del rango científicamente óptimo y continuarlo probablemente resultará en un crecimiento efectivo.
ja: 現在のプログラムは科学的に最適な範囲内です。このまま継続することで効果的な成長が期待できます。

# general_gymslength件のジムが見つかりました
source: ${gyms.length} gyms found
es: ${gyms.length} gimnasios encontrados
ja: ${gyms.length}件のジムが見つかりました

# profile_支払時期
source: Payment period
es: Período de pago
ja: 支払時期

# workout_メールアドレスが設定されていません匿名ログインの可能性
source: ⚠️ No email address set (possibly anonymous login)
es: ⚠️ No hay dirección de correo electrónico establecida (posiblemente inicio de sesión anónimo)
ja: ⚠️ メールアドレスが設定されていません（匿名ログインの可能性）

# workout_style_const_TextStylefontSize_14_客観的レベル判定の警告表示_Wid
source: , style: const TextStyle(fontSize: 14), ), ], ), ), ], ), ); } /// Objective level assessment warning display Widget _buildLevelWarning() { return Container( padding: const EdgeInsets.all(12), decoration: BoxDecoration( color: Colors.amber.shade50, borderRadius: BorderRadius.circular(8), border: Border.all(color: Colors.amber.shade300), ), child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Row( children: [ Icon(Icons.info_outline, color: Colors.amber.shade700), const SizedBox(width: 8), const Text(
es: , style: const TextStyle(fontSize: 14), ), ], ), ), ], ), ); } /// Visualización de advertencia de evaluación del nivel de objetivo Widget _buildLevelWarning() { return Container( padding: const EdgeInsets.all(12), decoration: BoxDecoration( color: Colors.amber.shade50, borderRadius: BorderRadius.circular(8), border: Border.all(color: Colors.amber.shade300), ), child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Row( children: [ Icon(Icons.info_outline, color: Colors.amber.shade700), const SizedBox(width: 8), const Text(
ja: , style: const TextStyle(fontSize: 14), ), ], ), ), ], ), ); } /// 客観的レベル判定の警告表示 Widget _buildLevelWarning() { return Container( padding: const EdgeInsets.all(12), decoration: BoxDecoration( color: Colors.amber.shade50, borderRadius: BorderRadius.circular(8), border: Border.all(color: Colors.amber.shade300), ), child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Row( children: [ Icon(Icons.info_outline, color: Colors.amber.shade700), const SizedBox(width: 8), const Text(

# general_月間収益が3ヶ月連続で300万円以上達成時
source: When monthly revenue reaches 3 million yen or more for three consecutive months
es: Cuando los ingresos mensuales alcancen los 3 millones de yenes o más durante tres meses consecutivos
ja: 月間収益が3ヶ月連続で300万円以上達成時

# general_実施部位
source: Implementation site
es: Sitio de implementación
ja: 実施部位

# general_目標進捗
source: 🎯 Goal Progress
es: 🎯 Progreso de la meta
ja: 🎯 目標進捗

# workout_画面遷移に失敗しました_e
source: Screen transition failed: $e
es: Error en la transición de pantalla: $e
ja: 画面遷移に失敗しました: $e

# general_空セット削除_docid_setslength_validSetslength
source: 🧹 Remove empty set: ${doc.id} (${sets.length} → ${validSets.length})
es: 🧹 Eliminar conjunto vacío: ${doc.id} (${sets.length} → ${validSets.length})
ja: 🧹 空セット削除: ${doc.id} (${sets.length} → ${validSets.length})

# gym_東京都武蔵野市吉祥寺141414
source: 14-14-14 Kichijoji, Musashino City, Tokyo
es: 14-14-14 Kichijoji, ciudad de Musashino, Tokio
ja: 東京都武蔵野市吉祥寺14-14-14

# workout_サウンド再生エラー_e
source: ❌ Sound playback error: $e
es: ❌ Error de reproducción de sonido: $e
ja: ❌ サウンド再生エラー: $e

# general_Firestore_タイムアウト_500ms
source: 📴 [Firestore] Timeout (500ms)
es: 📴 [Firestore] Tiempo de espera (500 ms)
ja: 📴 [Firestore] タイムアウト (500ms)

# workout_exerciseNameを削除しますか
source: Do you want to delete "$exerciseName"?
es: ¿Quieres eliminar "$exerciseName"?
ja: 「$exerciseName」を削除しますか？

# general_メニューから削除選択_exerciseName_ID_workoutId
source: 👆 Select Delete from the menu: $exerciseName (ID: $workoutId)
es: 👆 Seleccione Eliminar en el menú: $exerciseName (ID: $workoutId)
ja: 👆 メニューから削除選択: $exerciseName (ID: $workoutId)

# general_プラン変更後も追加購入分は引き継がれます
source: • Any additional purchases will be carried over even after changing plans.
es: • Cualquier compra adicional se transferirá incluso después de cambiar de plan.
ja: • プラン変更後も追加購入分は引き継がれます

# gym_gymname_gymratingtoStringAsFixed150_gymreviewCount
source: 📍 ${gym.name} ⭐ ${gym.rating.toStringAsFixed(1)}/5.0 (${gym.reviewCount} reviews) 📍 ${gym.address} #muscletraining
es: 📍 ${gym.name} ⭐ ${gym.rating.toStringAsFixed(1)}/5.0 (${gym.reviewCount} reseñas) 📍 ${gym.address} #entrenamientomuscular
ja: 📍 ${gym.name} ⭐ ${gym.rating.toStringAsFixed(1)}/5.0 (${gym.reviewCount}件のレビュー) 📍 ${gym.address} #筋トレ

# general_検索中
source: Searching...
es: Búsqueda...
ja: 検索中...

# gym_無料体験
source: Free Trial
es: Prueba gratuita
ja: 無料体験

# general_訪問履歴取得_historieslength件
source: ✅ Get visit history: ${histories.length} items
es: ✅ Obtener historial de visitas: ${histories.length} elementos
ja: ✅ 訪問履歴取得: ${histories.length}件

# general_トレーニングのお知らせ
source: Training Announcements 💪
es: Anuncios de capacitación 💪
ja: トレーニングのお知らせ 💪

# personalFactor_歳
source: age
es: edad
ja: 歳

# general_canUseAI_現在のプラン_plan
source: 🔍 [canUseAI] Current plan: $plan
es: 🔍 [canUseAI] Plan actual: $plan
ja: 🔍 [canUseAI] 現在のプラン: $plan

# workout_メニュー提案
source: Menu suggestions
es: Sugerencias de menú
ja: メニュー提案

# subscription_永久無料
source: Free forever
es: Libre para siempre
ja: 永久無料

# general_パートナー管理画面
source: Partner Management Screen
es: Pantalla de gestión de socios
ja: パートナー管理画面

# error_時空間データ更新エラー_e
source: ❌ Spatiotemporal data update error: $e
es: ❌ Error de actualización de datos espaciotemporales: $e
ja: ❌ 時空間データ更新エラー: $e

# subscription_AI使用回数_currentUsage_1
source: ✅ AI usage count: ${currentUsage + 1}
es: ✅ Recuento de uso de IA: ${currentUsage + 1}
ja: ✅ AI使用回数: ${currentUsage + 1}

# general_スワイプで切替
source: Swipe to switch
es: Desliza para cambiar
ja: スワイプで切替

# general_Google_Places_APIからの結果が空_フォールバックします
source: ⚠️ Empty result from Google Places API - fallback
es: ⚠️ Resultado vacío de la API de Google Places: alternativa
ja: ⚠️ Google Places APIからの結果が空 - フォールバックします

# workout_ヘッダー検出_hasHeader
source: 📋 Header detection: ${hasHeader ?
es: 📋 Detección de encabezado: ${hasHeader ?
ja: 📋 ヘッダー検出: ${hasHeader ?

# profile_解約後Freeプランに自動的に移行されます
source: • After cancellation, you will be automatically switched to the Free plan
es: • Después de la cancelación, cambiarás automáticamente al plan gratuito.
ja: • 解約後、Freeプランに自動的に移行されます

# workout_IMPORT_データ取り込みエラー_e
source: ❌❌❌ [IMPORT] Data import error: $e
es: ❌❌❌ [IMPORTACIÓN] Error de importación de datos: $e
ja: ❌❌❌ [IMPORT] データ取り込みエラー: $e

# general_PR保存成功_exerciseName_calculated1RMtoStringAsFixed1k
source: ✅ Successful PR save: $exerciseName - ${calculated1RM.toStringAsFixed(1)}kg (1RM)
es: ✅ PR guardado con éxito: $exerciseName - ${calculated1RM.toStringAsFixed(1)}kg (1RM)
ja: ✅ PR保存成功: $exerciseName - ${calculated1RM.toStringAsFixed(1)}kg (1RM)

# workout_monthlyTotalSetsセット
source: $_monthlyTotalSets set
es: $_monthlyTotalSets conjunto
ja: $_monthlyTotalSetsセット

# workout_IMPORT_トレーニング時間_startTimehourstartTimeminute_endTi
source: ✅ [IMPORT] Training time: ${startTime.hour}:${startTime.minute} → ${endTime.hour}:${endTime.minute}
es: ✅ [IMPORTAR] Tiempo de entrenamiento: ${startTime.hour}:${startTime.minute} → ${endTime.hour}:${endTime.minute}
ja: ✅ [IMPORT] トレーニング時間: ${startTime.hour}:${startTime.minute} → ${endTime.hour}:${endTime.minute}

# general_Web環境_ブラウザ位置情報APIを使用
source: 🌐 Web environment: Uses browser location API
es: 🌐 Entorno web: utiliza la API de ubicación del navegador
ja: 🌐 Web環境: ブラウザ位置情報APIを使用

# general_一斉メッセージ機能は近日公開予定です
source: Mass messaging feature coming soon
es: Próximamente, función de mensajería masiva
ja: 一斉メッセージ機能は近日公開予定です

# general_セッション管理画面は次のフェーズで実装予定
source: The session management screen will be implemented in the next phase.
es: La pantalla de gestión de sesiones se implementará en la siguiente fase.
ja: セッション管理画面は次のフェーズで実装予定

# workout_保存に失敗しました_e
source: Save failed: $e
es: Error al guardar: $e
ja: 保存に失敗しました: $e

# general_除外_excludeCount_workoutDateyearworkoutDatemonthwor
source: ⚠️ Exclude [$excludeCount]: ${workoutDate.year}/${workoutDate.month}/${workoutDate.day}
es: ⚠️ Excluir [$excludeCount]: ${workoutDate.year}/${workoutDate.month}/${workoutDate.day}
ja: ⚠️ 除外 [$excludeCount]: ${workoutDate.year}/${workoutDate.month}/${workoutDate.day}

# general_招待コードを入力
source: Enter your invitation code
es: Introduce tu código de invitación
ja: 招待コードを入力

# workout_自動閉じ実行5秒経過
source: ✅ Automatic closing (after 5 seconds)
es: ✅ Cierre automático (después de 5 segundos)
ja: ✅ 自動閉じ実行（5秒経過）

# general_成長トレンドgrowthTrend
source: ]} ・Growth Trend: ${growthTrend[
es: ]} ・Tendencia de crecimiento: ${growthTrend[
ja: ]} ・成長トレンド：${growthTrend[

# workout_AI生成_AI使用可能_canUseAIResultallowed
source: 🔍 [AI generated] AI available: ${canUseAIResult.allowed}
es: 🔍 [IA generada] IA disponible: ${canUseAIResult.allowed}
ja: 🔍 [AI生成] AI使用可能: ${canUseAIResult.allowed}

# workout_descending_true_limit20_最大20件のワークアウトログを取得_get_fina
source: , descending: true) .limit(20) // Get up to 20 workout logs .get(); final List<Map<String, dynamic>> exerciseRecords = []; / Extract data for the specified exercise from each workout log for (final doc in snapshot.docs) { final data = doc.data(); final exercises = data[
es: , descendente: verdadero) .limit(20) // Obtener hasta 20 registros de entrenamiento .get(); final List<Map<String, dynamic>> exerciseRecords = []; / Extraer los datos del ejercicio especificado de cada registro de entrenamiento for (final doc in snapshot.docs) { final data = doc.data(); final exercises = data[
ja: , descending: true) .limit(20) // 最大20件のワークアウトログを取得 .get(); final List<Map<String, dynamic>> exerciseRecords = []; // 各ワークアウトログから指定種目のデータを抽出 for (final doc in snapshot.docs) { final data = doc.data(); final exercises = data[

# general_currentStreak日連続記録中
source: Recording ${_currentStreak} days in a row!
es: ¡Grabando ${_currentStreak} días seguidos!
ja: ${_currentStreak}日連続記録中！

# general_中信頼性
source: Medium reliability
es: Fiabilidad media
ja: 中信頼性

# general_PR狙撃手
source: PR Sniper
es: Francotirador de relaciones públicas
ja: PR狙撃手

# profile_本アプリに関して紛争が生じた場合には開発者の所在地を管轄する裁判所を専属的合意管轄とします
source: • In the event of a dispute regarding this app, the court with jurisdiction over the developer's location shall have exclusive jurisdiction.
es: • En caso de disputa con respecto a esta aplicación, el tribunal con jurisdicción sobre la ubicación del desarrollador tendrá jurisdicción exclusiva.
ja: • 本アプリに関して紛争が生じた場合には、開発者の所在地を管轄する裁判所を専属的合意管轄とします。

# subscription_無料トライアル期間_Premium_30日間_Pro_14日間
source: • Free trial period: Premium 30 days / Pro 14 days
es: • Periodo de prueba gratuito: Premium 30 días / Pro 14 días
ja: • 無料トライアル期間: Premium 30日間 / Pro 14日間

# workout_XXセット
source: XX Set
es: Conjunto XX
ja: XXセット

# workout_トレーニング後にAIがあなたの疲労度を科学的に分析し最適な回復時間とトレーニング提案をお届けします
source: After your workout, AI will scientifically analyze your fatigue level and provide you with optimal recovery time and training suggestions.
es: Después de tu entrenamiento, la IA analizará científicamente tu nivel de fatiga y te brindará un tiempo de recuperación óptimo y sugerencias de entrenamiento.
ja: トレーニング後にAIがあなたの疲労度を科学的に分析し、最適な回復時間とトレーニング提案をお届けします。

# personalFactor_経験年数を入力してください
source: Please enter your years of experience
es: Por favor ingrese sus años de experiencia
ja: 経験年数を入力してください

# workout_上半身特化トレーニング
source: Upper body specific training
es: Entrenamiento especializado de la parte superior del cuerpo
ja: 上半身特化トレーニング

# workout_を重点的に鍛えたい方_トレーニングフォームを学びたい方_提案形式_各種目について以下の情報を含めてく
source: )} - Those who want to learn training form [Proposal Format] Please include the following information for each exercise: - Exercise name - Number of sets (low: 2-3 sets) - Reps (light: 10-15 reps) - Rest time (longer: 90-120 seconds) - Beginner form tips - Common mistakes and cautions [Conditions] - ${targetParts.join(
es: )} - Para quienes desean aprender la técnica de entrenamiento [Formato de propuesta] Incluya la siguiente información para cada ejercicio: - Nombre del ejercicio - Número de series (baja: 2-3 series) - Repeticiones (ligera: 10-15 repeticiones) - Tiempo de descanso (más larga: 90-120 segundos) - Consejos para principiantes - Errores comunes y precauciones [Condiciones] - ${targetParts.join(
ja: )}を重点的に鍛えたい方 - トレーニングフォームを学びたい方 【提案形式】 各種目について以下の情報を含めてください： - 種目名 - セット数（少なめ: 2-3セット） - 回数（軽い重量で: 10-15回） - 休憩時間（長め: 90-120秒） - 初心者向けフォームのポイント - よくある間違いと注意事項 【条件】 - ${targetParts.join(

# general_なりすまし
source: Impersonation
es: Interpretación
ja: なりすまし

# general_週4回以上
source: 4 or more times a week
es: 4 o más veces a la semana
ja: 週4回以上

# general_紹介された側_AI_refereeAiBonus回
source: Referred party: AI x ${_refereeAiBonus} times
es: Parte referida: IA x ${_refereeAiBonus} veces
ja: 紹介された側: AI×${_refereeAiBonus}回

# workout_IMPORT_Firestoreに保存中
source: 🔄 [IMPORT] Saving to Firestore...
es: 🔄 [IMPORTAR] Guardando en Firestore...
ja: 🔄 [IMPORT] Firestoreに保存中...

# workout_体重取得エラー_e
source: ❌ Weight acquisition error: $e
es: ❌ Error al obtener el peso: $e
ja: ❌ 体重取得エラー: $e

# gym_平日_7002300_土日_9002100
source: Weekdays 7:00-23:00, Saturdays and Sundays 9:00-21:00
es: Días laborables 7:00-23:00, sábados y domingos 9:00-21:00
ja: 平日 7:00-23:00, 土日 9:00-21:00

# error_全PR取得エラー_e
source: ❌ Error getting all PRs: $e
es: ❌ Error al obtener todas las PR: $e
ja: ❌ 全PR取得エラー: $e

# general_回_同一部位bodyPartを週にrecommendedFreq
source: ]} times" = same body part ($bodyPart) ${recommendedFreq[
es: ]} veces" = misma parte del cuerpo ($bodyPart) ${recommendedFreq[
ja: ]}回」= 同一部位（$bodyPart）を週に${recommendedFreq[

# general_プラン変更はRevenueCat経由の正規課金のみ有効です
source: Plan changes are only valid for regular billing via RevenueCat.
es: Los cambios de plan solo son válidos para la facturación regular a través de RevenueCat.
ja: プラン変更はRevenueCat経由の正規課金のみ有効です。

# workout_reporttotalMinutes分
source: ${report.totalMinutes} minutes
es: ${report.totalMinutes} minutos
ja: ${report.totalMinutes}分

# general_まだメッセージがありません
source: No messages yet
es: No hay mensajes todavía
ja: まだメッセージがありません

# workout_return_override_Widget_buildBuildContext_context_s
source: ); return []; } } @override Widget build(BuildContext context) { super.build(context); return SingleChildScrollView( padding: const EdgeInsets.all(16.0), child: Form( key: _formKey, child: Column( crossAxisAlignment: CrossAxisAlignment.stretch, children: [ // Header _buildHeader(), const SizedBox(height: 24), // Input Form _buildInputForm(), const SizedBox(height: 24), // Analysis Button _buildAnalyzeButton(), const SizedBox(height: 32), // Analysis Results if (_isLoading) _buildLoadingIndicator() else if (_analysisResult != null) _buildAnalysisResult(), ], ), ), ); } /// header Widget _buildHeader() { return Card( color: Colors.orange.shade50, child: Padding( padding: const EdgeInsets.all(16.0), child: Row( children: [ Icon(Icons.analytics, size: 40, color: Colors.orange.shade700), const SizedBox(width: 16), Expanded( child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Text(
es: ); devolver []; } } @override Widget build(BuildContext context) { super.build(context); return SingleChildScrollView( padding: const EdgeInsets.all(16.0), child: Form( key: _formKey, child: Column( crossAxisAlignment: CrossAxisAlignment.stretch, children: [ // Encabezado _buildHeader(), const SizedBox(height: 24), // Formulario de entrada _buildInputForm(), const SizedBox(height: 24), // Botón de análisis _buildAnalyzeButton(), const SizedBox(height: 32), // Resultados del análisis if (_isLoading) _buildLoadingIndicator() else if (_analysisResult != null) _buildAnalysisResult(), ], ), ), ); } /// encabezado Widget _buildHeader() { return Card( color: Colors.orange.shade50, child: Padding( padding: const EdgeInsets.all(16.0), child: Row( children: [ Icon(Icons.analytics, tamaño: 40, color: Colors.orange.shade700), const SizedBox(ancho: 16), Expanded( child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Text(
ja: ); return []; } } @override Widget build(BuildContext context) { super.build(context); return SingleChildScrollView( padding: const EdgeInsets.all(16.0), child: Form( key: _formKey, child: Column( crossAxisAlignment: CrossAxisAlignment.stretch, children: [ // ヘッダー _buildHeader(), const SizedBox(height: 24), // 入力フォーム _buildInputForm(), const SizedBox(height: 24), // 分析実行ボタン _buildAnalyzeButton(), const SizedBox(height: 32), // 分析結果 if (_isLoading) _buildLoadingIndicator() else if (_analysisResult != null) _buildAnalysisResult(), ], ), ), ); } /// ヘッダー Widget _buildHeader() { return Card( color: Colors.orange.shade50, child: Padding( padding: const EdgeInsets.all(16.0), child: Row( children: [ Icon(Icons.analytics, size: 40, color: Colors.orange.shade700), const SizedBox(width: 16), Expanded( child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Text(
