Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# workout_カスタム種目を削除
source: Delete a custom event
es: Eliminar un evento personalizado
ja: カスタム種目を削除

# general_Premium無料体験
source: Premium Free Trial
es: Prueba gratuita premium
ja: Premium無料体験

# general_友達_AI使用回数_3回
source: ✅ Friends: AI usage count increased by 3
es: ✅ Amigos: el recuento de uso de IA aumentó en 3
ja: ✅ 友達: AI使用回数 +3回

# workout_匿名認証エラー_e
source: ❌ Anonymous authentication error: $e
es: ❌ Error de autenticación anónima: $e
ja: ❌ 匿名認証エラー: $e

# general_男女差なし
source: No gender difference
es: No hay diferencia de género
ja: 男女差なし

# workout_recordduration分
source: ${record.duration} minutes
es: ${record.duration} minutos
ja: ${record.duration}分

# workout_匿名認証成功
source: ✅ Anonymous authentication successful
es: ✅ Autenticación anónima exitosa
ja: ✅ 匿名認証成功

# workout_今月の無料AI利用回数を使い切りました
source: I've used up all my free AI usage for this month.
es: He agotado todo mi uso gratuito de IA para este mes.
ja: 今月の無料AI利用回数を使い切りました

# subscription_お気に入り無制限
source: ❤️ Unlimited Favorites
es: ❤️ Favoritos ilimitados
ja: ❤️ お気に入り無制限

# workout_画像解析エラー_e
source: ❌ Image parsing error: $e
es: ❌ Error de análisis de imagen: $e
ja: ❌ 画像解析エラー: $e

# profile_6言語対応_グローバル展開中
source: Available in 6 languages - Global expansion in progress
es: Disponible en 6 idiomas - Expansión global en curso
ja: 6言語対応 - グローバル展開中

# general_月間総重量
source: Monthly total weight
es: Peso total mensual
ja: 月間総重量

# workout_ベンチディップス
source: Bench Dips
es: Fondos en banco
ja: ベンチディップス

# gym_設備マシン情報
source: Equipment and machine information
es: Información sobre equipos y máquinas
ja: 設備・マシン情報

# workout_exerciseSetslengthセットをコピーしました
source: ${exerciseSets.length} sets copied
es: ${exerciseSets.length} conjuntos copiados
ja: ${exerciseSets.length}セットをコピーしました

# general_セッション管理
source: Session Management
es: Gestión de sesiones
ja: セッション管理

# workout_日付不明
source: date unknown
es: fecha desconocida
ja: 日付不明

# workout_レビュー依頼チェックエラー_e
source: ❌ Review request check error: $e
es: ❌ Error de verificación de solicitud de revisión: $e
ja: ❌ レビュー依頼チェックエラー: $e

# gym_カフェ
source: Cafe
es: Cafetería
ja: カフェ

# error_画像の生成に失敗しました
source: Image generation failed
es: La generación de la imagen falló
ja: 画像の生成に失敗しました

# profile_施行日_2025年11月20日
source: Effective date: November 20, 2025
es: Fecha de entrada en vigor: 20 de noviembre de 2025
ja: 施行日: 2025年11月20日

# profile_トレーニング目標
source: Training Goals
es: Objetivos del entrenamiento
ja: トレーニング目標

# workout_記録を保存
source: Save the Record
es: Guardar el registro
ja: 記録を保存

# error_リワード広告初期化エラー_e
source: ❌ Rewarded ad initialization error: $e
es: ❌ Error de inicialización del anuncio recompensado: $e
ja: ❌ リワード広告初期化エラー: $e

# error_プロフィール取得エラー_e
source: Profile retrieval error: $e
es: Error de recuperación de perfil: $e
ja: プロフィール取得エラー: $e

# workout_ケーブルオーバーヘッドエクステンション
source: Cable Overhead Extension
es: Extensión aérea de cable
ja: ケーブルオーバーヘッドエクステンション

# workout_セット数_setslength
source: Number of sets: ${_sets.length}
es: Número de conjuntos: ${_sets.length}
ja: セット数: ${_sets.length}

# workout_3_太字処理text_太字_final_boldPattern_RegExpr
source: ); } / 3. Bold processing (**text** → bold) final boldPattern = RegExp(r
es: ); } / 3. Procesamiento de negrita (**texto** → negrita) final boldPattern = RegExp(r
ja: ); } // 3. 太字処理（**text** → 太字） final boldPattern = RegExp(r

# general_適切
source: appropriate
es: adecuado
ja: 適切

# workout_残りクレジット表示_if_mounted_final_statusMessage_await_cre
source: ); / Display remaining credits if (mounted) { final statusMessage = await creditService.getAIUsageStatus(); ScaffoldMessenger.of(context).showSnackBar( SnackBar( content: Text(
es: ); / Mostrar créditos restantes si (montado) { mensajeDeEstadoFinal = awaitServicioDeCrédito.getAIUsageStatus(); mensajeDeCadena.of(contexto).showSnackBar( SnackBar( contenido: Texto(
ja: ); // 残りクレジット表示 if (mounted) { final statusMessage = await creditService.getAIUsageStatus(); ScaffoldMessenger.of(context).showSnackBar( SnackBar( content: Text(

# workout_style_ElevatedButtonstyleFrom_backgroundColor_Colo
source: ), style: ElevatedButton.styleFrom( backgroundColor: Colors.blue.shade700, foregroundColor: Colors.white, ), ), ], ), ); } // Show rewarded ad and earn credits Future<bool> _showRewardAdAndEarn() async { / Use global instance (initialized in main.dart) final rewardAdService = globalRewardAdService; / Show ad loading waiting dialog if (mounted) { showDialog( context: context, barrierDismissible: false, builder: (context) => const Center( child: Card( child: Padding( padding: EdgeInsets.all(24.0), child: Column( mainAxisSize: MainAxisSize.min, children: [ CircularProgressIndicator(), SizedBox(height: 16), Text(
es: ), style: ElevatedButton.styleFrom( backgroundColor: Colors.blue.shade700, foregroundColor: Colors.white, ), ), ], ), ); } // Mostrar anuncio con recompensa y obtener créditos Future<bool> _showRewardAdAndEarn() async { / Usar instancia global (inicializada en main.dart) final rewardAdService = globalRewardAdService; / Mostrar diálogo de espera de carga del anuncio if (mounted) { showDialog( context: context, barrierDismissible: false, builder: (context) => const Center( child: Card( child: Padding( padding: EdgeInsets.all(24.0), child: Column( mainAxisSize: MainAxisSize.min, children: [ CircularProgressIndicator(), SizedBox(height: 16), Text(
ja: ), style: ElevatedButton.styleFrom( backgroundColor: Colors.blue.shade700, foregroundColor: Colors.white, ), ), ], ), ); } /// リワード広告を表示してクレジット獲得 Future<bool> _showRewardAdAndEarn() async { // グローバルインスタンスを使用（main.dartで初期化済み） final rewardAdService = globalRewardAdService; // 広告読み込み待機ダイアログ表示 if (mounted) { showDialog( context: context, barrierDismissible: false, builder: (context) => const Center( child: Card( child: Padding( padding: EdgeInsets.all(24.0), child: Column( mainAxisSize: MainAxisSize.min, children: [ CircularProgressIndicator(), SizedBox(height: 16), Text(

# subscription_一時的に利用しない
source: Temporarily not in use
es: Temporalmente fuera de uso
ja: 一時的に利用しない

# general_本日の全トレーニング終了
source: Today's training is complete
es: El entrenamiento de hoy está completo
ja: 本日の全トレーニング終了

# general_新記録達成
source: New record achieved!
es: ¡Nuevo récord alcanzado!
ja: 新記録達成！

# exercise_チェストプレスマシン
source: Chest Press Machine
es: Máquina de prensa de pecho
ja: チェストプレスマシン

# profile_制定日_2025年11月20日
source: Enactment date: November 20, 2025
es: Fecha de promulgación: 20 de noviembre de 2025
ja: 制定日: 2025年11月20日

# workout_チンアップ
source: Chin-ups
es: dominadas
ja: チンアップ

# general_トレーナー記録
source: Trainer Records
es: Registros de entrenadores
ja: トレーナー記録

# workout_シュラッグ
source: Shrug
es: Encogimiento de hombros
ja: シュラッグ

# exercise_マシンショルダープレス
source: Machine Shoulder Press
es: Press de hombros en máquina
ja: マシンショルダープレス

# workout_yyyy年MM月dd日_E
source: yyyy year MM month dd day (E)
es: aaaa año MM mes dd día (E)
ja: yyyy年MM月dd日 (E)

# general_レスポンス情報_errorresponseInfo
source: Response information: ${error.responseInfo}
es: Información de respuesta: ${error.responseInfo}
ja: レスポンス情報: ${error.responseInfo}

# general_回復時間確保Grgic_2018
source: Allow time for recovery (Grgic 2018)
es: Dar tiempo para la recuperación (Grgic 2018)
ja: 回復時間確保（Grgic 2018）

# workout_目標重量_kg
source: Target weight (kg)
es: Peso objetivo (kg)
ja: 目標重量 (kg)

# exercise_フレンチプレス
source: French press
es: Prensa francesa
ja: フレンチプレス

# profile_パートナーリクエスト
source: Partner Request
es: Solicitud de socio
ja: パートナーリクエスト

# general_総セッション数
source: Total sessions
es: Sesiones totales
ja: 総セッション数

# workout_大腿
source: thigh
es: hermético
ja: 大腿

# workout_メモの読み込みエラー_e
source: ⚠️ Error loading note: $e
es: ⚠️ Error al cargar la nota: $e
ja: ⚠️ メモの読み込みエラー: $e

# general_ドキュメントが見つかりません_workoutId
source: ❌ Document not found: $workoutId
es: ❌ Documento no encontrado: $workoutId
ja: ❌ ドキュメントが見つかりません: $workoutId

# general_位置情報を取得できませんでした
source: Location information could not be obtained
es: No se pudo obtener la información de ubicación
ja: 位置情報を取得できませんでした

# workout_種目削除エラー_e
source: ❌ Event deletion error: $e
es: ❌ Error de eliminación de evento: $e
ja: ❌ 種目削除エラー: $e

# workout_ダイヤモンドプッシュアップ
source: Diamond Push Ups
es: Flexiones de diamante
ja: ダイヤモンドプッシュアップ

# workout_広告の読み込みに失敗しましたしばらくしてからお試しください
source: Ad failed to load. Please try again later.
es: No se pudo cargar el anuncio. Inténtalo de nuevo más tarde.
ja: 広告の読み込みに失敗しました。しばらくしてからお試しください。

# general_全機能が使い放題
source: All features are available for unlimited use!
es: ¡Todas las funciones están disponibles para uso ilimitado!
ja: 全機能が使い放題！

# workout_レッグアダクション
source: Leg Action
es: Acción de piernas
ja: レッグアダクション

# error_シェアに失敗しました
source: Share failed
es: Error al compartir
ja: シェアに失敗しました

# workout_トレーニングを保存しました
source: Workout saved
es: Entrenamiento guardado
ja: トレーニングを保存しました

# workout_マシンディップス
source: Machine Dips
es: Fondos en máquina
ja: マシンディップス

# subscription_混雑度表示
source: Congestion level display
es: Visualización del nivel de congestión
ja: 混雑度表示

# workout_あなたはプロのパーソナルトレーナーです筋トレ初心者向けのtargetPartsjoin
source: You are a professional personal trainer. "${targetParts.join(
es: Eres un entrenador personal profesional. "${targetParts.join(
ja: あなたはプロのパーソナルトレーナーです。筋トレ初心者向けの「${targetParts.join(

# general_再読み込み
source: Reload
es: Recargar
ja: 再読み込み

# workout_プランを見る
source: View Plans
es: Ver planes
ja: プランを見る

# general_中程度の運動
source: Moderate exercise
es: Ejercicio moderado
ja: 中程度の運動

# workout_筋肉グループ_selectedMuscleGroup
source: Muscle group: $_selectedMuscleGroup
es: Grupo muscular: $_selectedMuscleGroup
ja: 筋肉グループ: $_selectedMuscleGroup

# general_高強度のトレーニングでした_十分な休息と栄養補給が必要です無理せず回復を優先しましょう
source: This was high-intensity training. You'll need plenty of rest and nutrition. Don't push yourself too hard, and prioritize recovery.
es: Este fue un entrenamiento de alta intensidad. Necesitarás mucho descanso y buena nutrición. No te esfuerces demasiado y prioriza la recuperación.
ja: 高強度のトレーニングでした。 十分な休息と栄養補給が必要です。無理せず回復を優先しましょう。

# general_セット追加ごとに037の成長
source: +0.37% growth per additional set
es: +0,37% de crecimiento por conjunto adicional
ja: セット追加ごとに+0.37%の成長

# workout_データ読み込みエラー_e
source: ❌ Data load error: $e
es: ❌ Error de carga de datos: $e
ja: ❌ データ読み込みエラー: $e

# gym_期限なし
source: No deadline
es: Sin fecha límite
ja: 期限なし

# workout_トライセプスキックバック
source: Tricep Kickback
es: Patada hacia atrás de tríceps
ja: トライセプスキックバック

# workout_バックエクステンション
source: Back Extension
es: Extensión de espalda
ja: バックエクステンション

# workout_履歴読み込みエラー_e
source: ❌ Error loading history: $e
es: ❌ Error al cargar el historial: $e
ja: ❌ 履歴読み込みエラー: $e

# workout_インクラインダンベルカール
source: Incline dumbbell curl
es: Curl inclinado con mancuernas
ja: インクラインダンベルカール

# workout_dateyear年datemonth月dateday日
source: ${date.year}, ${date.month}, ${date.day}
es: ${fecha.año}, ${fecha.mes}, ${fecha.día}
ja: ${date.year}年${date.month}月${date.day}日

# workout_今月のAI利用回数を使い切りました
source: I have used up all my AI usage for this month.
es: He agotado todo mi uso de IA para este mes.
ja: 今月のAI利用回数を使い切りました

# general_疲労管理システムを無効にしました
source: ❌ Fatigue management system disabled
es: ❌ Sistema de gestión de la fatiga desactivado
ja: ❌ 疲労管理システムを無効にしました

# subscription_料金が高い
source: High fees
es: Tarifas altas
ja: 料金が高い

# general_ジム名_data
source: Gym name: ${data[
es: Nombre del gimnasio: ${data[
ja: ジム名: ${data[

# workout_統計ダッシュボード
source: Statistics Dashboard
es: Panel de estadísticas
ja: 統計ダッシュボード

# workout_通常
source: usually
es: generalmente
ja: 通常

# workout_広告を読み込む_await_rewardAdServiceloadRewardedAd_読み込み完了
source: ), ], ), ), ), ), ), ), ); } / Load ad await rewardAdService.loadRewardedAd(); / Wait up to 5 seconds for loading to complete for (int i = 0; i < 10; i++) { await Future.delayed(const Duration(milliseconds: 500)); if (rewardAdService.isAdReady()) { break; } } / Close loading dialog if (mounted) { Navigator.of(context).pop(); } / Show ad if (rewardAdService.isAdReady()) { final success = await rewardAdService.showRewardedAd(); if (success) { / Ad viewing success message if (mounted) { ScaffoldMessenger.of(context).showSnackBar( SnackBar( content: Text(
es: ), ], ), ), ), ), ), ); } / Cargar anuncio await rewardAdService.loadRewardedAd(); / Esperar hasta 5 segundos para que se complete la carga for (int i = 0; i < 10; i++) { await Future.delayed(const Duration(milliseconds: 500)); if (rewardAdService.isAdReady()) { break; } } / Cerrar el cuadro de diálogo de carga if (mounted) { Navigator.of(context).pop(); } / Mostrar anuncio if (rewardAdService.isAdReady()) { final success = await rewardAdService.showRewardedAd(); if (éxito) { / Mensaje de éxito en la visualización del anuncio if (montado) { ScaffoldMessenger.of(contexto).showSnackBar( SnackBar( content: Text(
ja: ), ], ), ), ), ), ); } // 広告を読み込む await rewardAdService.loadRewardedAd(); // 読み込み完了まで最大5秒待機 for (int i = 0; i < 10; i++) { await Future.delayed(const Duration(milliseconds: 500)); if (rewardAdService.isAdReady()) { break; } } // ローディングダイアログを閉じる if (mounted) { Navigator.of(context).pop(); } // 広告表示 if (rewardAdService.isAdReady()) { final success = await rewardAdService.showRewardedAd(); if (success) { // 広告視聴成功メッセージ if (mounted) { ScaffoldMessenger.of(context).showSnackBar( SnackBar( content: Text(

# workout_計算ツール
source: Calculation tool
es: Herramienta de cálculo
ja: 計算ツール

# workout_selectedMuscleGroupの種目
source: $_selectedMuscleGroup events
es: Eventos de $_selectedMuscleGroup
ja: $_selectedMuscleGroupの種目

# profile_解約方法
source: How to cancel
es: Cómo cancelar
ja: 解約方法

# workout_テンプレートデータを適用_widgettemplateData
source: 📋 Apply template data: ${widget.templateData}
es: 📋 Aplicar datos de plantilla: ${widget.templateData}
ja: 📋 テンプレートデータを適用: ${widget.templateData}

# general_回
source: ]}times
es: ]}veces
ja: ]}回

# workout_トレーニングメモ
source: 📝 Training Notes
es: 📝 Notas de entrenamiento
ja: 📝 トレーニングメモ

# general_良好なトレーニングでした_軽いストレッチと十分な水分補給をしましょう
source: That was a great workout! Make sure to do some light stretching and drink plenty of water.
es: ¡Fue un entrenamiento genial! Asegúrate de hacer estiramientos ligeros y beber mucha agua.
ja: 良好なトレーニングでした！ 軽いストレッチと十分な水分補給をしましょう。

# personalFactor_保存エラー_e
source: ❌ Save Error: $e
es: ❌ Error al guardar: $e
ja: ❌ 保存エラー: $e

# workout_トレーニングを記録するとここに表示されます
source: Once you've recorded your workout, it will appear here
es: Una vez que hayas grabado tu entrenamiento, aparecerá aquí
ja: トレーニングを記録すると、ここに表示されます

# general_premiumDays日間
source: $premiumDays days
es: $premiumDays días
ja: $premiumDays日間

# profile_特定商取引法に基づく表記
source: Description based on the Specified Commercial Transactions Act
es: Descripción basada en la Ley de Transacciones Comerciales Específicas
ja: 特定商取引法に基づく表記

# workout_画像を生成中
source: Generating image...
es: Generando imagen...
ja: 画像を生成中...

# workout_ケーブルリアレイズ
source: Cable Rear Raise
es: Elevación trasera con cable
ja: ケーブルリアレイズ

# workout_メモ保存エラー_e
source: ❌ Note save error: $e
es: ❌ Nota: error al guardar: $e
ja: ❌ メモ保存エラー: $e

# exercise_デクラインプレス
source: Decline Press
es: Prensa en declive
ja: デクラインプレス

# general_広告ID_bannerAdUnitId
source: Ad ID: $bannerAdUnitId
es: ID de anuncio: $bannerAdUnitId
ja: 広告ID: $bannerAdUnitId

# workout_セット数_45セット
source: - Number of sets: 4-5 sets
es: - Número de series: 4-5 series
ja: - セット数: 4-5セット

# general_実装予定の機能です
source: 🚧 Planned features
es: 🚧 Funciones planificadas
ja: 🚧 実装予定の機能です

# error_エラー内容_errormessage
source: Error content: ${error.message}
es: Contenido del error: ${error.message}
ja: エラー内容: ${error.message}

# general_友達になってからメッセージを送信できます
source: Once you become friends you can send messages
es: Una vez que se hagan amigos podrán enviarse mensajes.
ja: 友達になってからメッセージを送信できます

# workout_ラットプルダウンワイド
source: Lat pulldown (wide)
es: Jalón lateral (ancho)
ja: ラットプルダウン（ワイド）

# general_あなた_AI使用回数_5回
source: ✅ You: Use AI +5 times
es: ✅ Tú: Usa IA +5 veces
ja: ✅ あなた: AI使用回数 +5回

# general_全記録件数_querySnapshotdocslength
source: 📊 Total number of records: ${querySnapshot.docs.length}
es: 📊 Número total de registros: ${querySnapshot.docs.length}
ja: 📊 全記録件数: ${querySnapshot.docs.length}

# general_AdMob初期化成功
source: ✅ AdMob initialization successful
es: ✅ Inicialización de AdMob exitosa
ja: ✅ AdMob初期化成功

# general_紹介特典
source: Referral Bonuses
es: Bonos por recomendación
ja: 紹介特典

# workout_補助なし
source: No subsidy
es: Sin subsidio
ja: 補助なし

# workout_ゾットマンカール
source: Zottman Curl
es: Curl Zottman
ja: ゾットマンカール

# subscription_ジムを辞めた
source: I quit the gym
es: Dejé el gimnasio
ja: ジムを辞めた

# exercise_バーベルスクワット
source: Barbell Squats
es: Sentadillas con barra
ja: バーベルスクワット

# error_FirestoreへのAIクレジット保存失敗ローカルは保存済み_e
source: ⚠️ Failed to save AI credits to Firestore (already saved locally): $e
es: ⚠️ No se pudieron guardar los créditos de IA en Firestore (ya se guardaron localmente): $e
ja: ⚠️ FirestoreへのAIクレジット保存失敗（ローカルは保存済み）: $e

# profile_対応時間_平日_10001800
source: (Business hours: Weekdays 10:00-18:00)
es: (Horario comercial: Días laborables 10:00-18:00)
ja: （対応時間: 平日 10:00-18:00）

# workout_マシンアームカール
source: Machine Arm Curl
es: Curl de brazos en máquina
ja: マシンアームカール

# workout_Markdown形式テキストをフォーマット済みウィジェットに変換_Widget_buildForma
source: ), ), ], ), ); } /// Convert Markdown-formatted text into a formatted widget Widget _buildFormattedText(String text) { final lines = text.split(
es: ), ), ], ), ); } /// Convertir texto con formato Markdown en un widget con formato Widget _buildFormattedText(String text) { final lines = text.split(
ja: ), ), ], ), ); } /// Markdown形式テキストをフォーマット済みウィジェットに変換 Widget _buildFormattedText(String text) { final lines = text.split(

# error_シェアエラー_e
source: ❌ Share Error: $e
es: ❌ Error al compartir: $e
ja: ❌ シェアエラー: $e

# gym_混雑度を報告する
source: Report congestion levels
es: Informar sobre los niveles de congestión
ja: 混雑度を報告する

# workout_オフ
source: off
es: apagado
ja: オフ

# general_AI筋トレ分析
source: #AI muscle training analysis
es: Análisis del entrenamiento muscular mediante IA
ja: #AI筋トレ分析

# workout_体重記録を取得中_user_id_useruid
source: 🔍 Retrieving weight record... user_id: ${user.uid}
es: 🔍Recuperando registro de peso... user_id: ${user.uid}
ja: 🔍 体重記録を取得中... user_id: ${user.uid}

# exercise_チェストプレス
source: Chest Press
es: Press de pecho
ja: チェストプレス

# gym_スミスマシン
source: Smith machine
es: Máquina Smith
ja: スミスマシン

# workout_セット数_34セット
source: - Number of sets: 3-4 sets
es: - Número de series: 3-4 series
ja: - セット数: 3-4セット

# workout_メニュー保存成功
source: ✅ Menu saved successfully
es: ✅ Menú guardado exitosamente
ja: ✅ メニュー保存成功

# general_ドロップセット
source: Drop Set
es: Conjunto de caída
ja: ドロップセット

# general_店舗画像管理
source: Store image management
es: Gestión de imágenes de la tienda
ja: 店舗画像管理

# workout_backgroundColor_Colorsgreen_duration_Durationsecon
source: ), backgroundColor: Colors.green, duration: Duration(seconds: 2), ), ); } return true; } } return false; } // Display the upgrade prompt dialog. Future<void> _showUpgradeDialog(String message) async { return showDialog( context: context, builder: (context) => AlertDialog( title: Row( children: [ Icon(Icons.workspace_premium, color: Colors.amber, size: 28), SizedBox(width: 12), Text(
es: ), backgroundColor: Colors.green, duration: Duration(seconds: 2), ), ); } return true; } } return false; } // Mostrar el cuadro de diálogo de actualización. Future<void> _showUpgradeDialog(String message) async { return showDialog( context: context, builder: (context) => AlertDialog( title: Row( children: [ Icon(Icons.workspace_premium, color: Colors.amber, size: 28), SizedBox(width: 12), Text(
ja: ), backgroundColor: Colors.green, duration: Duration(seconds: 2), ), ); } return true; } } return false; } /// アップグレード促進ダイアログ表示 Future<void> _showUpgradeDialog(String message) async { return showDialog( context: context, builder: (context) => AlertDialog( title: Row( children: [ Icon(Icons.workspace_premium, color: Colors.amber, size: 28), SizedBox(width: 12), Text(

# general_週次
source: weekly
es: semanalmente
ja: 週次

# general_ドキュメントデータが存在しません
source: ❌ Document data does not exist
es: ❌ Los datos del documento no existen
ja: ❌ ドキュメントデータが存在しません

# subscription_980月
source: ¥980/month
es: ¥980/mes
ja: ¥980/月

# subscription_ご利用について
source: About use
es: Acerca del uso
ja: ご利用について

# workout_トライセプスダウン
source: Triceps Down
es: Tríceps hacia abajo
ja: トライセプスダウン

# profile_開発者_井上元
source: Developer: Gen Inoue
es: Desarrollador: Gen Inoue
ja: 開発者: 井上元

# workout_ds分ss
source: (\d+)\s*minute(?:\s*（|\s*\()?
es: (\d+)\s*minuto(?:\s*（|\s*\()?
ja: (\d+)\s*分(?:\s*（|\s*\()?

# general_本日のトレーニング記録が見つかりません
source: Today's training record not found
es: No se encontró el registro de entrenamiento de hoy
ja: 本日のトレーニング記録が見つかりません

# profile_スタックトレース_stackTrace
source: 📋 Stack trace: $stackTrace
es: 📋 Rastreo de pila: $stackTrace
ja: 📋 スタックトレース: $stackTrace

# workout_Premiumプランにアップグレードすると
source: 💎Upgrade to our Premium plan to:
es: 💎Actualiza a nuestro plan Premium para:
ja: 💎 Premiumプランにアップグレードすると:

# workout_過去の提案
source: Past proposals
es: Propuestas pasadas
ja: 過去の提案

# subscription_プライバシーポリシーを開けませんでした
source: Could not open privacy policy
es: No se pudo abrir la política de privacidad
ja: プライバシーポリシーを開けませんでした

# workout_exercisereps回
source: ${exercise.reps} times
es: ${exercise.reps} veces
ja: ${exercise.reps}回

# gym_サーキットマシン
source: Circuit Machine
es: Máquina de circuito
ja: サーキットマシン

# workout_CSV解析エラー_e
source: ❌ CSV Parse Error: $e
es: ❌ Error de análisis de CSV: $e
ja: ❌ CSV解析エラー: $e

# workout_レッグアブダクション
source: Leg Abduction
es: Abducción de piernas
ja: レッグアブダクション

# exercise_フロントスクワット
source: Front Squat
es: Sentadilla frontal
ja: フロントスクワット

# workout_オフライン保存しました_オンライン復帰時に自動同期されます
source: 📴 Saved offline Auto-sync when you come back online
es: Guardado sin conexión Sincronización automática al volver a conectarse
ja: 📴 オフライン保存しました オンライン復帰時に自動同期されます

# bodyPart_上腕三頭筋
source: triceps
es: tríceps
ja: 上腕三頭筋

# workout_プレート計算機
source: Plate Calculator
es: Calculadora de placas
ja: プレート計算機

# profile_トレーニングデータの分析可視化
source: • Analyze and visualize training data
es: • Analizar y visualizar datos de entrenamiento.
ja: • トレーニングデータの分析・可視化

# workout_ラットプルダウンナロー
source: Lat pulldown (narrow)
es: Jalón lateral (estrecho)
ja: ラットプルダウン（ナロー）

# workout_トレッドミル
source: Treadmill
es: Rueda de andar
ja: トレッドミル

# workout_ダンベルカールオルタネイト
source: Dumbbell curl (alternate)
es: Curl con mancuernas (alternativo)
ja: ダンベルカール（オルタネイト）

# workout_アブドミナルクランチマシン
source: Abdominal Crunch Machine
es: Máquina de abdominales
ja: アブドミナルクランチマシン

# workout_ベントオーバーローイング
source: Bent-Over Rowing
es: Remo inclinado
ja: ベントオーバーローイング

# workout_距離_km
source: Distance (km)
es: Distancia (km)
ja: 距離 (km)

# profile_井上元
source: Gen Inoue
es: General Inoue
ja: 井上元

# general_体重_weighttoStringAsFixed1kg
source: Weight: ${weight.toStringAsFixed(1)}kg
es: Peso: ${weight.toStringAsFixed(1)}kg
ja: 体重: ${weight.toStringAsFixed(1)}kg

# workout_バーピージャンプ
source: Burpee Jumps
es: Saltos de burpee
ja: バーピージャンプ

# workout_補助あり
source: Subsidy available
es: Subvención disponible
ja: 補助あり

# workout_休憩_90秒
source: - Rest: 90 seconds
es: - Descanso: 90 segundos
ja: - 休憩: 90秒

# general_購入する
source: Buy now
es: Comprar ahora
ja: 購入する

# workout_チンニング懸垂
source: Chin-ups
es: dominadas
ja: チンニング（懸垂）

# workout_有酸素種目保存_currentExerciseName_durationfinalDuration分
source: 💾 Save aerobic exercise: $currentExerciseName - duration=$finalDuration, distance=$finalDistance, sets=$finalSets
es: 💾 Guardar un ejercicio cardiovascular: $currentExerciseName - duración=$finalDuration, distancia=$finalDistance, series=$finalSets
ja: 💾 有酸素種目保存: $currentExerciseName - duration=$finalDuration分, distance=$finalDistance, sets=$finalSets

# general_はじめる
source: Let's get started!
es: ¡Comencemos!
ja: はじめる！

# workout_ダンベルトライセプスエクステンション
source: Dumbbell Triceps Extension
es: Extensión de tríceps con mancuernas
ja: ダンベルトライセプスエクステンション
