Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# trialEndsAutoRenew
source: After the trial ends, you will automatically be transferred to a paid plan.
de: トライアルEnde後、自動的に有料プランに移行します
es: Una vez finalizada la prueba, se le transferirá automáticamente a un plan pago.
ja: トライアル終了後、自動的に有料プランに移行します
ko: トライアル종료後、自動的に有料プランに移行します
zh: トライアル结束後、自動的に有料プランに移行します
zh_tw: トライアル結束後、自動的に有料プランに移行します

# trialPeriod
source: Free trial period: Premium 30 days / Pro 14 days
de: 無料トライアル期間: Premium 30Tag間 / Pro 14Tag間
es: Periodo de prueba gratuito: Premium 30 días / Pro 14 días
ja: 無料トライアル期間: Premium 30日間 / Pro 14日間
ko: 無料トライアル期間: Premium 30일間 / Pro 14일間
zh: [ZH] 無料トライアル期間: Premium 30日間 / Pro 14日間
zh_tw: [ZH_TW] 無料トライアル期間: Premium 30日間 / Pro 14日間

# cancelAnytime
source: Cancellation possible at any time (can be used until the end of the period)
de: [DE] いつでもキャンセル可能（期間満了まで利用可）
es: Cancelación posible en cualquier momento (se puede utilizar hasta el final del periodo)
ja: いつでもキャンセル可能（期間満了まで利用可）
ko: [KO] いつでもキャンセル可能（期間満了まで利用可）
zh: [ZH] いつでもキャンセル可能（期間満了まで利用可）
zh_tw: [ZH_TW] いつでもキャンセル可能（期間満了まで利用可）

# planChangesAfterCurrent
source: The new plan will be applied after the current plan period ends.
de: 現在のプラン期間がEnde後に新プランが適用されます
es: El nuevo plan se aplicará una vez finalizado el período del plan actual.
ja: 現在のプラン期間が終了後に新プランが適用されます
ko: 現在のプラン期間が종료後に新プランが適用されます
zh: 現在のプラン期間が结束後に新プランが適用されます
zh_tw: 現在のプラン期間が結束後に新プランが適用されます

# unlimitedAI
source: Unlimited AI features
de: Unbegrenzte AI
es: Funciones de IA ilimitadas
ja: AI機能無制限
ko: 무제한 AI
zh: 无限AI功能
zh_tw: 無限AI功能

source: Unlimited Favorites
de: [DE] お気に入り無制限
es: Favoritos ilimitados
ja: お気に入り無制限
ko: 무제한 즐겨찾기
zh: [ZH] お気に入り無制限
zh_tw: [ZH_TW] お気に入り無制限

# postGymReviews
source: Gym review submission
de: [DE] ジムレビュー投稿
es: Envío de reseñas de gimnasios
ja: ジムレビュー投稿
ko: [KO] ジムレビュー投稿
zh: [ZH] ジムレビュー投稿
zh_tw: [ZH_TW] ジムレビュー投稿

source: GPS location search
de: GPS位置Suchen
es: Búsqueda de ubicación GPS
ja: GPS位置検索
ko: GPS位置검색
zh: GPS位置搜索
zh_tw: GPS位置搜尋

# aiLimitedTo
source: AI functions are limited to {from} → {to}
de: [DE] AI機能が{from}→{to}に制限
es: Las funciones de IA están limitadas a {from} → {to}
ja: AI機能が{from}→{to}に制限
ko: [KO] AI機能が{from}→{to}に制限
zh: [ZH] AI機能が{from}→{to}に制限
zh_tw: [ZH_TW] AI機能が{from}→{to}に制限

# switchToPlan
source: Change to {planName}
de: {planName}にÄndern
es: Cambiar a {planName}
ja: {planName}に変更
ko: {planName}に변경
zh: {planName}に更改
zh_tw: {planName}に變更

# switchToPlanConfirm
source: If you change to {planName}, the following features will be restricted:
de: {planName}にÄndernすると、以下の機能が制限されます：
es: Si cambia a {planName}, se restringirán las siguientes funciones:
ja: {planName}に変更すると、以下の機能が制限されます：
ko: {planName}に변경すると、以下の機能が制限されます：
zh: {planName}に更改すると、以下の機能が制限されます：
zh_tw: {planName}に變更すると、以下の機能が制限されます：

# purchaseCompleted
source: Your {planName} purchase has been completed!
de: {planName}の購入がFertigしました！
es: ¡Tu compra de {planName} se ha completado!
ja: {planName}の購入が完了しました！
ko: {planName}の購入が완료しました！
zh: {planName}の購入が完成しました！
zh_tw: {planName}の購入が完成しました！

# planSwitched
source: Changed to {planName}!
de: {planName}にÄndernしました！
es: ¡Cambiado a {planName}!
ja: {planName}に変更しました！
ko: {planName}に변경しました！
zh: {planName}に更改しました！
zh_tw: {planName}に變更しました！

# changeInAppStore
source: Please change to {planName} in your App Store settings
de: App StoreEinstellungenから{planName}へÄndernBitte
es: Cambie a {planName} en la configuración de su App Store
ja: App Store設定から{planName}へ変更してください
ko: App Store설정から{planName}へ변경해 주세요
zh: App Store设置から{planName}へ更改请
zh_tw: App Store設定から{planName}へ變更請

# appStoreInstructions
source: 1. Open the Settings app on your iPhone. 2. Tap "Apple ID" at the top. 3. Tap "Subscriptions." 4. Select "GYM MATCH." 5. Select your desired plan.
de: 1. iPhoneの「Einstellungen」アプリを開く 2. 一番上の[Apple ID]をタップ 3. 「サブスクリプション」をタップ 4. 「GYM MATCH」をAuswählen 5. 希望のプランをAuswählen
es: 1. Abre la app Ajustes en tu iPhone. 2. Pulsa [ID de Apple] en la parte superior. 3. Pulsa "Suscripciones". 4. Selecciona "GYM MATCH". 5. Selecciona el plan que desees.
ja: 1. iPhoneの「設定」アプリを開く 2. 一番上の[Apple ID]をタップ 3. 「サブスクリプション」をタップ 4. 「GYM MATCH」を選択 5. 希望のプランを選択
ko: 1. iPhoneの「설정」アプリを開く 2. 一番上の[Apple ID]をタップ 3. 「サブスクリプション」をタップ 4. 「GYM MATCH」を선택 5. 希望のプランを선택
zh: 1. iPhoneの「设置」アプリを開く 2. 一番上の[Apple ID]をタップ 3. 「サブスクリプション」をタップ 4. 「GYM MATCH」を选择 5. 希望のプランを选择
zh_tw: 1. iPhoneの「設定」アプリを開く 2. 一番上の[Apple ID]をタップ 3. 「サブスクリプション」をタップ 4. 「GYM MATCH」を選擇 5. 希望のプランを選擇

source: AI Add-on Pack
de: AIHinzufügenパック
es: Paquete complementario de IA
ja: AI追加パック
ko: AI추가パック
zh: AI添加パック
zh_tw: AI新增パック

# purchaseAiAddon
source: Purchase additional AI usage
de: AI使用WiederholungenをHinzufügen購入
es: Comprar uso adicional de IA
ja: AI使用回数を追加購入
ko: AI使用횟수を추가購入
zh: AI使用次数を添加購入
zh_tw: AI使用次數を新增購入

# loadPlanError
source: Plan Load Error
de: プラン読み込みFehler
es: Error de carga del plan
ja: プラン読み込みエラー
ko: プラン読み込み오류
zh: プラン読み込み错误
zh_tw: プラン読み込み錯誤

# freeFeatures
source: All features in the free plan
de: [DE] 無料プランの全機能
es: Todas las funciones del plan gratuito
ja: 無料プランの全機能
ko: [KO] 無料プランの全機能
zh: [ZH] 無料プランの全機能
zh_tw: [ZH_TW] 無料プランの全機能

# allFeaturesForever
source: All features permanently available
de: Alleの機能を永久利用
es: Todas las funciones están disponibles permanentemente
ja: すべての機能を永久利用
ko: 모두の機能を永久利用
zh: 全部の機能を永久利用
zh_tw: 全部の機能を永久利用

source: search
de: Suchen
es: buscar
ja: 検索
ko: 검색
zh: 搜索
zh_tw: 搜尋

# searchPlaceholder
source: Search by gym name or area...
de: Nach Fitnessstudio oder Ort suchen...
es: Buscar por nombre de gimnasio o zona...
ja: ジム名・地域で検索...
ko: 체육관 이름 또는 지역으로 검색...
zh: 搜索健身房名称或地区...
zh_tw: 搜尋健身房名稱或地區...

# searchFailed
source: Gym search failed
de: Suche fehlgeschlagen
es: La búsqueda del gimnasio falló
ja: ジムの検索に失敗しました
ko: 체육관 검색 실패
zh: 搜索失败
zh_tw: 搜尋失敗

source: Search Error
de: SuchenFehler
es: Error de búsqueda
ja: 検索エラー
ko: 검색 오류
zh: 搜索错误
zh_tw: 搜尋錯誤

# gpsSearch
source: GPS location search
de: GPS-Standortsuche
es: Búsqueda de ubicación GPS
ja: GPS位置検索
ko: GPS 위치 검색
zh: GPS定位搜索
zh_tw: GPS定位搜尋

source: Get GPS location
de: GPS位置をAbrufen
es: Obtener ubicación GPS
ja: GPS位置を取得
ko: GPS 위치 가져오기
zh: GPS位置を获取
zh_tw: [ZH_TW] GPS位置を取得

# startGpsOrTextSearch
source: Start a GPS location search or text search
de: GPS位置SuchenまたはテキストSuchenをStartBitte
es: Iniciar una búsqueda de ubicación GPS o una búsqueda de texto
ja: GPS位置検索またはテキスト検索を開始してください
ko: GPS位置검색またはテキスト검색を시작해 주세요
zh: GPS位置搜索またはテキスト搜索を开始请
zh_tw: GPS位置搜尋またはテキスト搜尋を開始請

# apiKeyError
source: API Key Error: Access Denied
de: APIキーFehler: アクセスが拒否されました
es: Error de clave API: acceso denegado
ja: APIキーエラー: アクセスが拒否されました
ko: APIキー오류: アクセスが拒否されました
zh: APIキー错误: アクセスが拒否されました
zh_tw: APIキー錯誤: アクセスが拒否されました

source: Location permission required
de: 位置Informationの許可が必要です
es: Se requiere permiso de ubicación
ja: 位置情報の許可が必要です
ko: 位置정보の許可が必要です
zh: 位置信息の許可が必要です
zh_tw: 位置資訊の許可が必要です

source: Text search
de: テキストSuchen
es: Búsqueda de texto
ja: テキスト検索
ko: テキスト검색
zh: テキスト搜索
zh_tw: テキスト搜尋

source: Onboarding
de: [DE] オンボーディング
es: Incorporación
ja: オンボーディング
ko: 온보딩
zh: 新手引导
zh_tw: [ZH_TW] オンボーディング

# welcomeToGymMatch
source: Get the best training experience at GYM MATCH
de: [DE] GYM MATCHで最高のトレーニング体験を
es: Obtén la mejor experiencia de entrenamiento en GYM MATCH
ja: GYM MATCHで最高のトレーニング体験を
ko: GYM MATCH로 최고의 트레이닝 경험을
zh: GYM MATCH - 最佳训练体验
zh_tw: [ZH_TW] GYM MATCHで最高のトレーニング体験を

source: Get started
de: [DE] はじめる
es: Empezar
ja: はじめる
ko: 시작하기
zh: 开始使用
zh_tw: [ZH_TW] はじめる

source: Ready!
de: 準備Fertig！
es: ¡Listo!
ja: 準備完了！
ko: 준비 완료!
zh: 準備完成！
zh_tw: 準備完成！

# trainingExperience
source: What is your training experience?
de: [DE] あなたのトレーニング経験は？
es: ¿Cuál es tu experiencia en formación?
ja: あなたのトレーニング経験は？
ko: 트레이닝 경험은?
zh: 您的训练经验？
zh_tw: [ZH_TW] あなたのトレーニング経験は？

source: beginner
de: [DE] 初心者
es: principiante
ja: 初心者
ko: 초보자
zh: 初学者
zh_tw: [ZH_TW] 初心者

# beginnerDesc
source: Just started training
de: [DE] トレーニングを始めたばかり
es: Acabo de empezar a entrenar
ja: トレーニングを始めたばかり
ko: 트레이닝을 막 시작함
zh: 刚开始训练
zh_tw: [ZH_TW] トレーニングを始めたばかり

source: Intermediate
de: Fortgeschritten者
es: Intermedio
ja: 中級者
ko: 중급자
zh: 中级
zh_tw: [ZH_TW] 中級者

# intermediateDesc
source: Approximately 6 months to 2 years of experience
de: 半Jahr〜2Jahr程度の経験あり
es: Aproximadamente 6 meses a 2 años de experiencia.
ja: 半年〜2年程度の経験あり
ko: 6개월~2년 정도의 경험
zh: 6个月至2年经验
zh_tw: [ZH_TW] 半年〜2年程度の経験あり

source: Advanced
de: Experte者
es: Avanzado
ja: 上級者
ko: 상급자
zh: 高级
zh_tw: 高級者

# advancedDesc
source: 2+ years of continuous experience
de: 2Jahr以上の継続的な経験あり
es: 2+ años de experiencia continua
ja: 2年以上の継続的な経験あり
ko: 2년 이상의 지속적인 경험
zh: 2年以上持续训练
zh_tw: [ZH_TW] 2年以上の継続的な経験あり

# trainingGoal
source: What is the main purpose of training?
de: [DE] 主なトレーニング目的は？
es: ¿Cuál es el objetivo principal del entrenamiento?
ja: 主なトレーニング目的は？
ko: 주요 트레이닝 목표는?
zh: [ZH] 主なトレーニング目的は？
zh_tw: [ZH_TW] 主なトレーニング目的は？

# muscleGrowth
source: muscle hypertrophy
de: Muskelaufbau
es: hipertrofia muscular
ja: 筋肥大
ko: 근육 성장
zh: 肌肉增长
zh_tw: 肌肉增長

# muscleGrowthDesc
source: I want to build muscle
de: Muskelmasse aufbauen
es: Quiero desarrollar músculo
ja: 筋肉を大きくしたい
ko: 근육을 키우고 싶음
zh: 增大肌肉体积
zh_tw: 增大肌肉體積

# dietGoal
source: diet
de: Fettabbau
es: dieta
ja: ダイエット
ko: 다이어트
zh: 减脂
zh_tw: 減脂

# dietGoalDesc
source: I want to reduce body fat
de: Körperfett reduzieren
es: Quiero reducir la grasa corporal
ja: 体脂肪を減らしたい
ko: 체지방을 줄이고 싶음
zh: 减少体脂肪
zh_tw: 減少體脂肪

# healthMaintenance
source: maintain health
de: Gesundheitserhaltung
es: mantener la salud
ja: 健康維持
ko: 건강 유지
zh: 健康维持
zh_tw: 健康維持

# healthMaintenanceDesc
source: I want to maintain a healthy body
de: Gesunden Körper erhalten
es: Quiero mantener un cuerpo sano
ja: 健康的な身体を維持したい
ko: 건강한 몸 유지
zh: 保持健康体态
zh_tw: 保持健康體態

# trainingFrequency
source: How often do you train?
de: [DE] トレーニング頻度は？
es: ¿Con qué frecuencia entrenas?
ja: トレーニング頻度は？
ko: 트레이닝 빈도는?
zh: [ZH] トレーニング頻度は？
zh_tw: [ZH_TW] トレーニング頻度は？

# startHabitBuilding
source: First, make it a habit
de: [DE] まずは習慣化から
es: Primero, hazlo un hábito
ja: まずは習慣化から
ko: 습관 만들기부터
zh: [ZH] まずは習慣化から
zh_tw: [ZH_TW] まずは習慣化から

# regularTraining
source: Serious training
de: [DE] 本格的にトレーニング
es: Entrenamiento serio
ja: 本格的にトレーニング
ko: 본격적인 트레이닝
zh: [ZH] 本格的にトレーニング
zh_tw: [ZH_TW] 本格的にトレーニング

source: Daily training
de: 毎Tagトレーニング
es: Entrenamiento diario
ja: 毎日トレーニング
ko: 매일 트레이닝
zh: 每天トレーニング
zh_tw: 每天トレーニング

# aiAnalysis
source: AI fatigue analysis
de: AI疲労度Minute析
es: Análisis de la fatiga de la IA
ja: AI疲労度分析
ko: AI疲労度분析
zh: [ZH] AI疲労度分析
zh_tw: [ZH_TW] AI疲労度分析

# aiAnalysisDesc
source: Understanding recovery status with scientific data
de: [DE] 科学的なデータで回復状態を把握
es: Comprender el estado de recuperación con datos científicos
ja: 科学的なデータで回復状態を把握
ko: [KO] 科学的なデータで回復状態を把握
zh: [ZH] 科学的なデータで回復状態を把握
zh_tw: [ZH_TW] 科学的なデータで回復状態を把握

# optimalProgram
source: We will propose the best program to suit your goals
de: [DE] 目的に合わせた最適なプログラムを提案します
es: Te propondremos el mejor programa que se adapte a tus objetivos.
ja: 目的に合わせた最適なプログラムを提案します
ko: [KO] 目的に合わせた最適なプログラムを提案します
zh: [ZH] 目的に合わせた最適なプログラムを提案します
zh_tw: [ZH_TW] 目的に合わせた最適なプログラムを提案します

# createOptimalMenu
source: Create the perfect menu for you
de: [DE] あなたに最適なメニューを作成します
es: Crea el menú perfecto para ti
ja: あなたに最適なメニューを作成します
ko: [KO] あなたに最適なメニューを作成します
zh: [ZH] あなたに最適なメニューを作成します
zh_tw: [ZH_TW] あなたに最適なメニューを作成します

# achievementSupport
source: Badges and achievements to encourage continued participation
de: Abzeichenやアチーブメントで継続をサポート
es: Insignias y logros para fomentar la participación continua
ja: バッジやアチーブメントで継続をサポート
ko: 배지やアチーブメントで継続をサポート
zh: 徽章やアチーブメントで継続をサポート
zh_tw: 徽章やアチーブメントで継続をサポート

# earnedAiCredits
source: ✨Get 3 free AI uses!
de: [DE] ✨ AI無料利用×3回を獲得！
es: ✨¡Obtén 3 usos de IA gratis!
ja: ✨ AI無料利用×3回を獲得！
ko: [KO] ✨ AI無料利用×3回を獲得！
zh: [ZH] ✨ AI無料利用×3回を獲得！
zh_tw: [ZH_TW] ✨ AI無料利用×3回を獲得！

source: AI Scientific Coaching
de: AI Wissenschaftliches Training
es: Coaching científico de IA
ja: AI科学的コーチング
ko: AI 과학적 코칭
zh: AI科学训练指导
zh_tw: AI科學訓練指導

# aiThinking
source: AI is thinking...
de: AI denkt nach...
es: La IA está pensando...
ja: AIが考え中...
ko: AI가 생각 중...
zh: AI思考中...
zh_tw: AI思考中...

# aiGenerating
source: AI is analyzing the best program...
de: AI analysiert optimales Programm...
es: La IA está analizando el mejor programa...
ja: AIが最適なプログラムを分析中...
ko: AI가 최적의 프로그램을 분석 중...
zh: AI正在分析最佳方案...
zh_tw: AI正在分析最佳方案...

# aiAnalyzingScientific
source: AI is conducting a scientifically based analysis...
de: AIが科学的根拠に基づいてMinute析中...
es: La IA está realizando un análisis con base científica...
ja: AIが科学的根拠に基づいて分析中...
ko: AIが科学的根拠に基づいて분析中...
zh: [ZH] AIが科学的根拠に基づいて分析中...
zh_tw: [ZH_TW] AIが科学的根拠に基づいて分析中...

# aiPredictionComplete
source: AI prediction completed!
de: AI-Vorhersage abgeschlossen!
es: ¡Predicción de IA completada!
ja: AI予測完了!
ko: AI 예측 완료!
zh: AI预测完成！
zh_tw: AI預測完成！

# aiAnalysisComplete
source: AI analysis completed!
de: AI-Analyse abgeschlossen!
es: ¡Análisis de IA completado!
ja: AI分析完了!
ko: AI 분석 완료!
zh: AI分析完成！
zh_tw: AI分析完成！

source: AI generation complete!
de: AI-Generierung abgeschlossen!
es: ¡La generación de IA está completa!
ja: AI生成完了!
ko: AI 생성 완료!
zh: AI生成完成！
zh_tw: AI生成完成！

# aiFatigueAnalysisWelcome
source: Welcome to AI Fatigue Analysis!
de: AI疲労度Minute析へようこそ！
es: ¡Bienvenido al análisis de fatiga de IA!
ja: AI疲労度分析へようこそ！
ko: AI 피로도 분석에 오신 것을 환영합니다!
zh: AI疲労度分析へ欢迎！
zh_tw: AI疲労度分析へ歡迎！

source: AI detailed analysis
de: AIDetailsMinute析
es: Análisis detallado de IA
ja: AI詳細分析
ko: AI상세분析
zh: AI详情分析
zh_tw: AI詳情分析

source: AI fatigue analysis
de: AI Ermüdungsanalyse
es: Análisis de la fatiga de la IA
ja: AI疲労度分析
ko: AI 피로도 분석
zh: AI疲劳度分析
zh_tw: AI疲勞度分析

# aiPoweredTraining
source: AI-powered training suggestions
de: [DE] AI powered トレーニング提案
es: Sugerencias de entrenamiento impulsadas por IA
ja: AI powered トレーニング提案
ko: [KO] AI powered トレーニング提案
zh: [ZH] AI powered トレーニング提案
zh_tw: [ZH_TW] AI powered トレーニング提案

# scientificPrediction
source: Scientific predictions based on over 40 papers
de: Wissenschaftliche Vorhersage basierend auf 40+ Studien
es: Predicciones científicas basadas en más de 40 artículos
ja: 40本以上の論文に基づく科学的予測
ko: 40개 이상의 논문 기반 과학적 예측
zh: 基于40+篇论文的科学预测
zh_tw: 基於40+篇論文的科學預測

# fourMonthPrediction
source: 4-month forecast
de: 4ヶMonat後の予測
es: Pronóstico de 4 meses
ja: 4ヶ月後の予測
ko: 4ヶ월後の予測
zh: [ZH] 4ヶ月後の予測
zh_tw: [ZH_TW] 4ヶ月後の予測

source: Generate Menu
de: Trainingsplan generieren
es: Generar menú
ja: メニューを生成
ko: 메뉴 생성
zh: 生成训练计划
zh_tw: 生成訓練計劃

# executeGrowthPrediction
source: Perform growth forecasts
de: Wachstumsprognose ausführen
es: Realizar previsiones de crecimiento
ja: 成長予測を実行
ko: 성장 예측 실행
zh: 执行成长预测
zh_tw: 執行成長預測

source: Weight Ratio
de: Weight Ratio（Körpergewicht比）
es: Relación de peso
ja: Weight Ratio（体重比）
ko: Weight Ratio（체중比）
zh: [ZH] Weight Ratio（体重比）
zh_tw: Weight Ratio（體重比）

# enterOneRM
source: Enter your 1RM
de: 1RMを入力Bitte
es: Ingresa tu 1RM
ja: 1RMを入力してください
ko: 1RM을 입력하세요
zh: 1RMを入力请
zh_tw: 1RMを入力請

# enterAtLeast1kg
source: Please enter 1kg or more
de: 1kg以上を入力Bitte
es: Por favor ingrese 1 kg o más
ja: 1kg以上を入力してください
ko: 1kg以上を入力해 주세요
zh: 1kg以上を入力请
zh_tw: 1kg以上を入力請

# max500kg
source: Please enter 500kg or less
de: 500kg以下を入力Bitte
es: Por favor ingrese 500 kg o menos
ja: 500kg以下を入力してください
ko: 500kg以下を入力해 주세요
zh: 500kg以下を入力请
zh_tw: 500kg以下を入力請

# rpeModerate
source: RPE {rpe} (relaxed)
de: [DE] RPE {rpe}（余裕あり）
es: RPE {rpe} (relajado)
ja: RPE {rpe}（余裕あり）
ko: [KO] RPE {rpe}（余裕あり）
zh: [ZH] RPE {rpe}（余裕あり）
zh_tw: [ZH_TW] RPE {rpe}（余裕あり）

# rpeOptimal
source: RPE {rpe} (appropriateness)
de: [DE] RPE {rpe}（適正）
es: RPE {rpe} (adecuación)
ja: RPE {rpe}（適正）
ko: [KO] RPE {rpe}（適正）
zh: [ZH] RPE {rpe}（適正）
zh_tw: [ZH_TW] RPE {rpe}（適正）

# rpeMaximal
source: RPE {rpe} (limit)
de: [DE] RPE {rpe}（限界）
es: RPE {rpe} (límite)
ja: RPE {rpe}（限界）
ko: [KO] RPE {rpe}（限界）
zh: [ZH] RPE {rpe}（限界）
zh_tw: [ZH_TW] RPE {rpe}（限界）

# setCount
source: {count} sets
de: {count}Satz
es: {count} conjuntos
ja: {count}セット
ko: {count}세트
zh: {count}组
zh_tw: {count}組

source: minutes
de: Min.
es: minutos
ja: 分
ko: 분
zh: 分钟
zh_tw: 分

# minuteCount
source: {count} minutes
de: {count}Minute
es: {count} minutos
ja: {count}分
ko: {count}분
zh: [ZH] {count}分
zh_tw: [ZH_TW] {count}分

# repCount
source: {count} times
de: [DE] {count}回
es: {count} veces
ja: {count}回
ko: {count}회
zh: [ZH] {count}回
zh_tw: [ZH_TW] {count}回

# aiPromptUserInfo
source: [User information]
de: 【ユーザーInformation】
es: [Información del usuario]
ja: 【ユーザー情報】
ko: 【ユーザー정보】
zh: 【ユーザー信息】
zh_tw: 【ユーザー資訊】

# aiPromptTargetBodyPart
source: ・Target part: {bodyPart}
de: [DE] ・対象部位：{bodyPart}
es: ・Parte objetivo: {bodyPart}
ja: ・対象部位：{bodyPart}
ko: [KO] ・対象部位：{bodyPart}
zh: [ZH] ・対象部位：{bodyPart}
zh_tw: [ZH_TW] ・対象部位：{bodyPart}

# aiPromptCurrentOneRM
source: ・Current 1RM: {weight}kg
de: [DE] ・現在の1RM：{weight}kg
es: ・1RM actual: {weight} kg
ja: ・現在の1RM：{weight}kg
ko: [KO] ・現在の1RM：{weight}kg
zh: [ZH] ・現在の1RM：{weight}kg
zh_tw: [ZH_TW] ・現在の1RM：{weight}kg

# aiPromptTrainingLevel
source: ・Training level: {level}
de: ・トレーニングStufe：{level}
es: ・Nivel de entrenamiento: {level}
ja: ・トレーニングレベル：{level}
ko: ・トレーニング레벨：{level}
zh: ・トレーニング等级：{level}
zh_tw: ・トレーニング等級：{level}

# aiPromptFrequency
source: Current frequency: Train {bodyPart} {frequency} times per week
de: ・現在の頻度：{bodyPart} をWoche{frequency}回トレーニング
es: Frecuencia actual: Entrena {bodyPart} {frequency} veces por semana
ja: ・現在の頻度：{bodyPart} を週{frequency}回トレーニング
ko: ・現在の頻度：{bodyPart} を주{frequency}回トレーニング
zh: ・現在の頻度：{bodyPart} を周{frequency}回トレーニング
zh_tw: [ZH_TW] ・現在の頻度：{bodyPart} を週{frequency}回トレーニング

# aiPromptGender
source: ・Gender: {gender}
de: ・Geschlecht：{gender}
es: ・Género: {gender}
ja: ・性別：{gender}
ko: ・성별：{gender}
zh: ・性别：{gender}
zh_tw: [ZH_TW] ・性別：{gender}

# aiPromptAge
source: ・Age: {age} years old
de: ・Jahr齢：{age}歳
es: ・Edad: {age} años
ja: ・年齢：{age}歳
ko: ・년齢：{age}歳
zh: [ZH] ・年齢：{age}歳
zh_tw: [ZH_TW] ・年齢：{age}歳

# aiPromptPredictionResult
source: [Prediction results]
de: [DE] 【予測結果】
es: [Resultados de la predicción]
ja: 【予測結果】
ko: [KO] 【予測結果】
zh: [ZH] 【予測結果】
zh_tw: [ZH_TW] 【予測結果】

# aiPromptPredictionPeriod
source: ・Forecast period: {months} months
de: ・予測期間：{months}ヶMonat
es: ・Periodo de pronóstico: {months} meses
ja: ・予測期間：{months}ヶ月
ko: ・予測期間：{months}ヶ월
zh: [ZH] ・予測期間：{months}ヶ月
zh_tw: [ZH_TW] ・予測期間：{months}ヶ月

# aiPromptPredictedOneRM
source: ・Predicted 1RM: {weight}kg
de: [DE] ・予測1RM：{weight}kg
es: ・1RM previsto: {weight} kg
ja: ・予測1RM：{weight}kg
ko: [KO] ・予測1RM：{weight}kg
zh: [ZH] ・予測1RM：{weight}kg
zh_tw: [ZH_TW] ・予測1RM：{weight}kg

# aiPromptGrowthRate
source: ・Growth rate: Monthly +{rate}%
de: ・成長率：Monat+{rate}%
es: ・Tasa de crecimiento: Mensual +{rate}%
ja: ・成長率：月+{rate}%
ko: ・成長率：월+{rate}%
zh: [ZH] ・成長率：月+{rate}%
zh_tw: [ZH_TW] ・成長率：月+{rate}%

# aiPromptWeeklyGrowthRate
source: ・Weekly growth rate: +{rate}% per week
de: ・Woche次成長率：Woche+{rate}%
es: ・Tasa de crecimiento semanal: +{rate}% por semana
ja: ・週次成長率：週+{rate}%
ko: ・주次成長率：주+{rate}%
zh: ・周次成長率：周+{rate}%
zh_tw: [ZH_TW] ・週次成長率：週+{rate}%

# aiPromptRecommendedProgram
source: [Recommended Program]
de: [DE] 【推奨プログラム】
es: [Programa recomendado]
ja: 【推奨プログラム】
ko: [KO] 【推奨プログラム】
zh: [ZH] 【推奨プログラム】
zh_tw: [ZH_TW] 【推奨プログラム】

# aiPromptRecommendedFrequency
source: · {bodyPart} training: {frequency} times per week
de: ・{bodyPart} のトレーニング：Woche{frequency}回
es: · Entrenamiento {bodyPart}: {frequency} veces por semana
ja: ・{bodyPart} のトレーニング：週{frequency}回
ko: ・{bodyPart} のトレーニング：주{frequency}回
zh: ・{bodyPart} のトレーニング：周{frequency}回
zh_tw: [ZH_TW] ・{bodyPart} のトレーニング：週{frequency}回

# aiPromptRecommendedVolume
source: ・Volume of {bodyPart}: {volume} set per week
de: ・{bodyPart} のボリューム：Woche{volume}Satz
es: ・Volumen de {bodyPart}: {volume} conjunto por semana
ja: ・{bodyPart} のボリューム：週{volume}セット
ko: ・{bodyPart} のボリューム：주{volume}세트
zh: ・{bodyPart} のボリューム：周{volume}组
zh_tw: ・{bodyPart} のボリューム：週{volume}組

# aiPromptEffectSize
source: ・Effect size: ES={effectSize}
de: [DE] ・効果量：ES={effectSize}
es: ・Tamaño del efecto: ES={effectSize}
ja: ・効果量：ES={effectSize}
ko: [KO] ・効果量：ES={effectSize}
zh: [ZH] ・効果量：ES={effectSize}
zh_tw: [ZH_TW] ・効果量：ES={effectSize}

# aiResponseScientificBasis
source: The scientific basis for growth projections
de: [DE] ## 成長予測の科学的根拠
es: La base científica de las proyecciones de crecimiento
ja: ## 成長予測の科学的根拠
ko: [KO] ## 成長予測の科学的根拠
zh: [ZH] ## 成長予測の科学的根拠
zh_tw: [ZH_TW] ## 成長予測の科学的根拠

# aiResponseActionPlan
source: ## Recommended Action Plan
de: [DE] ## 推奨アクションプラン
es: ## Plan de acción recomendado
ja: ## 推奨アクションプラン
ko: [KO] ## 推奨アクションプラン
zh: [ZH] ## 推奨アクションプラン
zh_tw: [ZH_TW] ## 推奨アクションプラン

# aiResponseSuccessKeys
source: ## Keys to success
de: ## Erfolgのカギ
es: ## Claves del éxito
ja: ## 成功のカギ
ko: ## 성공のカギ
zh: [ZH] ## 成功のカギ
zh_tw: [ZH_TW] ## 成功のカギ

source: update
de: Aktualisieren
es: actualizar
ja: 更新
ko: 업데이트
zh: 更新
zh_tw: 更新

# complete
source: completion
de: Fertig
es: terminación
ja: 完了
ko: 완료
zh: 完成
zh_tw: 完成

source: Selected
de: Auswählen済み
es: Seleccionado
ja: 選択済み
ko: 선택済み
zh: 选择済み
zh_tw: 選擇済み

# bodyPartBiceps
source: Two heads
de: Bizeps
es: Dos cabezas
ja: 二頭
ko: 이두근
zh: 二头肌
zh_tw: 二頭肌

# bodyPartTriceps
source: Three heads
de: Trizeps
es: Tres cabezas
ja: 三頭
ko: 삼두근
zh: 三头肌
zh_tw: 三頭肌

# levelBeginner
source: beginner
de: Anfänger
es: principiante
ja: 初心者
ko: 초급
zh: 初学者
zh_tw: 初學者

# levelIntermediate
source: Intermediate
de: Fortgeschrittene
es: Intermedio
ja: 中級者
ko: 중급
zh: 中级
zh_tw: 中級

# levelAdvanced
source: Advanced
de: Fortgeschritten
es: Avanzado
ja: 上級者
ko: 고급
zh: 高级
zh_tw: 高級

# genderMale
source: male
de: Männlich
es: masculino
ja: 男性
ko: 남성
zh: 男性
zh_tw: 男性

# genderFemale
source: woman
de: Weiblich
es: mujer
ja: 女性
ko: 여성
zh: 女性
zh_tw: 女性

# exerciseCardio
source: Aerobic
de: Kardio
es: Aerobio
ja: 有酸素
ko: 유산소
zh: 有氧
zh_tw: 有氧

# repsCount
source: Number of times
de: Wiederholungen
es: Número de veces
ja: 回数
ko: 횟수
zh: 次数
zh_tw: 次數

# setsCount
source: Number of sets
de: Satz数
es: Número de conjuntos
ja: セット数
ko: 세트数
zh: 组数
zh_tw: 組数

source: detail
de: Details
es: detalle
ja: 詳細
ko: 상세
zh: 详情
zh_tw: 詳情

source: later
de: Später
es: más tarde
ja: 後で
ko: 나중에
zh: 稍后
zh_tw: 稍後

source: all
de: Alle
es: todo
ja: すべて
ko: 모두
zh: 全部
zh_tw: 全部

# bodyPartOther
source: others
de: Andere
es: otros
ja: その他
ko: 기타
zh: 其他
zh_tw: 其他

# exerciseBenchPress
source: bench press
de: Bankdrücken
es: press de banca
ja: ベンチプレス
ko: 벤치 프레스
zh: 卧推
zh_tw: 臥推

# exerciseSquat
source: Squats
de: Kniebeugen
es: sentadillas
ja: スクワット
ko: 스쿼트
zh: 深蹲
zh_tw: 深蹲

# exerciseDeadlift
source: Deadlift
de: Kreuzheben
es: Peso muerto
ja: デッドリフト
ko: 데드리프트
zh: 硬拉
zh_tw: 硬拉

# exercisePullUp
source: pull-ups
de: Klimmzüge
es: dominadas
ja: 懸垂
ko: 풀업
zh: 引体向上
zh_tw: 引體向上

# exerciseLatPulldown
source: Lat pulldown
de: Latzug
es: polea hacia abajo
ja: ラットプルダウン
ko: 랫 풀다운
zh: 高位下拉
zh_tw: 高位下拉

# exerciseLegPress
source: Leg press
de: Beinpresse
es: Prensa de piernas
ja: レッグプレス
ko: 레그 프레스
zh: 腿举
zh_tw: 腿舉

# exerciseShoulderPress
source: Shoulder Press
de: Schulterdrücken
es: Press de hombros
ja: ショルダープレス
ko: 숄더 프레스
zh: 肩推
zh_tw: 肩推

# exerciseDips
source: Dips
es: Luces cortas
ja: ディップス
ko: 딥스
zh: 双杠臂屈伸
zh_tw: 雙槓臂屈伸

# exerciseLegExtension
source: Leg Extension
de: Beinstrecker
es: Extensión de piernas
ja: レッグエクステンション
ko: 레그 익스텐션
zh: 腿屈伸
zh_tw: 腿屈伸

# exerciseLegCurl
source: Leg curl
de: Beinbeuger
es: Flexión de piernas
ja: レッグカール
ko: 레그 컬
zh: 腿弯举
zh_tw: 腿彎舉

# exerciseSideRaise
source: Side raise
de: Seitheben
es: Elevación lateral
ja: サイドレイズ
ko: 사이드 레이즈
zh: 侧平举
zh_tw: 側平舉

# exerciseBarbellCurl
source: Barbell curl
de: Langhantelcurl
es: Curl con barra
ja: バーベルカール
ko: 바벨 컬
zh: 杠铃弯举
zh_tw: 槓鈴彎舉

# exerciseHammerCurl
source: Hammer curl
es: curl de martillo
ja: ハンマーカール
ko: 해머 컬
zh: 锤式弯举
zh_tw: 錘式彎舉

# exerciseFrontRaise
source: Front Raise
de: Frontheben
es: Elevación frontal
ja: フロントレイズ
ko: 프론트 레이즈
zh: 前平举
zh_tw: 前平舉

# exerciseDumbbellCurl
source: Dumbbell curl
de: Kurzhantelcurl
es: Curl con mancuernas
ja: ダンベルカール
ko: 덤벨 컬
zh: 哑铃弯举
zh_tw: 啞鈴彎舉
