Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# general_招待コードをコピーしました
source: Invite code copied!
es: ¡Código de invitación copiado!
ja: 招待コードをコピーしました！

# workout_AIコーチング開始
source: AI coaching begins
es: Comienza el entrenamiento con IA
ja: AIコーチング開始

# general_ホテル
source: Hotel
ja: ホテル

# workout_設定は自動保存されます
source: • Settings are automatically saved.
es: • La configuración se guarda automáticamente.
ja: • 設定は自動保存されます

# general_訪問履歴を削除
source: Delete visit history
es: Eliminar historial de visitas
ja: 訪問履歴を削除

# general_検索結果に表示されなくなります
source: • It will no longer appear in search results.
es: • Ya no aparecerá en los resultados de búsqueda.
ja: • 検索結果に表示されなくなります

# profile_目標達成時にお知らせ
source: Notification when goal is achieved
es: Notificación cuando se alcanza el objetivo
ja: 目標達成時にお知らせ

# general_新しいバージョンのアプリが利用可能です最新バージョンにアップデートしてください
source: A new version of the app is available. Please update to the latest version.
es: Hay una nueva versión de la aplicación disponible. Actualízala a la última versión.
ja: 新しいバージョンのアプリが利用可能です。最新バージョンにアップデートしてください。

# error_PR追跡エラー_e
source: ❌ PR Tracking Error: $e
es: ❌ Error de seguimiento de relaciones públicas: $e
ja: ❌ PR追跡エラー: $e

# subscription_ジム検索記録完了
source: ✅ Gym search record completed
es: ✅ Registro de búsqueda de gimnasio completado
ja: ✅ ジム検索記録完了

# profile_AI使用回数_3回
source: AI usage count +3 times
es: Recuento de uso de IA +3 veces
ja: AI使用回数 +3回

# gym_コナミスポーツクラブ_池袋
source: Konami Sports Club Ikebukuro
es: Club deportivo Konami Ikebukuro
ja: コナミスポーツクラブ 池袋

# profile_他のユーザーに関する個人情報等を収集または蓄積する行為
source: • Collecting or storing personal information about other users
es: • Recopilar o almacenar información personal sobre otros usuarios.
ja: • 他のユーザーに関する個人情報等を収集または蓄積する行為

# general_あなたのFirebase_UID
source: 🆔 Your Firebase UID
es: 🆔 Tu UID de Firebase
ja: 🆔 あなたのFirebase UID

# error_クリーンアップエラー_e
source: ❌ Cleanup Error: $e
es: ❌ Error de limpieza: $e
ja: ❌ クリーンアップエラー: $e

# profile_コンテスト出場
source: Contest entry
es: Participación en el concurso
ja: コンテスト出場

# general_GYM_MATCHで一緒にトレーニングしよう招待コード_referralCode
source: Come train with us at GYM MATCH! Invite Code: $_referralCode
es: ¡Ven a entrenar con nosotros en GYM MATCH! Código de invitación: $_referralCode
ja: GYM MATCHで一緒にトレーニングしよう！招待コード: $_referralCode

# general_本日の通知済み_gymId
source: ⚠️ Notified today: $gymId
es: ⚠️ Notificado hoy: $gymId
ja: ⚠️ 本日の通知済み: $gymId

# general_日付範囲を選択
source: Select a date range
es: Seleccione un rango de fechas
ja: 日付範囲を選択

# general_ATTステータス_status
source: 📱 ATT Status: $status
es: 📱 Estado de ATT: $status
ja: 📱 ATTステータス: $status

# general_100日連続トレーニング達成
source: Achieved 100 days of continuous training
es: Logró 100 días de capacitación continua
ja: 100日連続トレーニング達成

# workout_CSV解析成功_result
source: ✅ Successful CSV analysis: ${(result[
es: ✅ Análisis CSV exitoso: ${(result[
ja: ✅ CSV解析成功: ${(result[

# general_週間トレーニング統計
source: Weekly Training Statistics
es: Estadísticas de entrenamiento semanales
ja: 週間トレーニング統計

# workout_AI機能を5回追加
source: • Added AI functions 5 times
es: • Se agregaron funciones de IA 5 veces
ja: • AI機能を5回追加

# workout_パース開始_全menulength文字_menusplit
source: 🔍 Parsing begins: all ${menu.length} characters, ${menu.split(
es: 🔍 Comienza el análisis: todos los ${menu.length} caracteres, ${menu.split(
ja: 🔍 パース開始: 全${menu.length}文字, ${menu.split(

# workout_有酸素時間
source: Aerobic time
es: Tiempo aeróbico
ja: 有酸素時間

# general_3月31日までの入会で入会金無料_プロテイン1kg_プレゼント
source: Join by March 31st and receive a free membership fee and 1kg of protein!
es: ¡Únete antes del 31 de marzo y recibe una cuota de membresía gratis y 1 kg de proteína!
ja: 3月31日までの入会で入会金無料 + プロテイン1kg プレゼント!

# workout_種目リスト読み込み完了_exerciseslength種目
source: ✅ Exercise list loaded: ${_exercises.length} exercises
es: ✅ Lista de ejercicios cargada: ${_exercises.length} ejercicios
ja: ✅ 種目リスト読み込み完了: ${_exercises.length}種目

# general_980月で毎月30回
source: ¥980/month for 30 sessions per month
es: ¥980/mes por 30 sesiones al mes
ja: ¥980/月で毎月30回

# general_熊本
source: Kumamoto
ja: 熊本

# general_習慣化への道
source: The path to habit formation
es: El camino hacia la formación de hábitos
ja: 習慣化への道

# general_登録完了
source: 🎉 Registration complete!
es: ¡Registro completo!
ja: 🎉 登録完了！

# general_paperCount本
source: ($paperCount books)
es: ($paperCount libros)
ja: ($paperCount本)

# general_トレーナーが記録を共有すると_ここに表示されます
source: When a trainer shares a record, it will appear here.
es: Cuando un entrenador comparte un registro, éste aparecerá aquí.
ja: トレーナーが記録を共有すると ここに表示されます

# profile_第4条サブスクリプション
source: Article 4 (Subscription)
es: Artículo 4 (Suscripción)
ja: 第4条（サブスクリプション）

# gym_このジムにチェックイン
source: Check in to this gym
es: Regístrate en este gimnasio
ja: このジムにチェックイン

# general_追加購入分は今月末まで有効です
source: • Additional purchases are valid until the end of this month.
es: • Las compras adicionales son válidas hasta fin de mes.
ja: • 追加購入分は今月末まで有効です

# workout_CSV行数_csvRowslength
source: 📊 Number of CSV rows: ${csvRows.length}
es: 📊 Número de filas CSV: ${csvRows.length}
ja: 📊 CSV行数: ${csvRows.length}

# error_Analytics初期化エラー_analyticsError
source: ❌ Analytics initialization error: $analyticsError
es: ❌ Error de inicialización de Analytics: $analyticsError
ja: ❌ Analytics初期化エラー: $analyticsError

# gym_キッズルーム
source: Kids' Room
es: Habitación de los niños
ja: キッズルーム

# error_Gemini_API_エラー_responsestatusCode_responsebody
source: ❌ Gemini API Error: ${response.statusCode} - ${response.body}
es: ❌ Error de API de Gemini: ${response.statusCode} - ${response.body}
ja: ❌ Gemini API エラー: ${response.statusCode} - ${response.body}

# general_キャンペーンバナー
source: Campaign banner
es: Banner de campaña
ja: キャンペーンバナー

# general_トレーニング分析_成功キャッシュ保存完了
source: ✅ Training analysis: Success (caching completed)
es: ✅ Análisis de entrenamiento: Éxito (almacenamiento en caché completado)
ja: ✅ トレーニング分析: 成功（キャッシュ保存完了）

# personalFactor_静的要因_数ヶ月に1回
source: • Static factors: Once every few months
es: • Factores estáticos: Una vez cada pocos meses
ja: • 静的要因: 数ヶ月に1回

# general_危険ゾーンです_怪我のリスクが高い状態です今日は完全休養を推奨します
source: You're in the danger zone! You're at high risk of injury. I recommend complete rest today.
es: ¡Estás en la zona de peligro! Tienes un alto riesgo de lesión. Te recomiendo reposo absoluto hoy.
ja: 危険ゾーンです！ 怪我のリスクが高い状態です。今日は完全休養を推奨します。

# subscription_AI機能_月10回_1
source: • AI function 10 times a month
es: • Función de IA 10 veces al mes
ja: • AI機能 月10回

# personalFactor_昨晩の睡眠時間
source: Last night's sleep time
es: Hora de dormir de anoche
ja: 昨晩の睡眠時間

# general_levelText_今がチャンス
source: $levelText - Now's your chance!
es: $levelText - ¡Ahora es tu oportunidad!
ja: $levelText - 今がチャンス！

# error_AI予測エラー_e
source: ❌ AI prediction error: $e
es: ❌ Error de predicción de IA: $e
ja: ❌ AI予測エラー: $e

# profile_メッセージ受信時に通知
source: Get notified when a message arrives
es: Recibir una notificación cuando llegue un mensaje
ja: メッセージ受信時に通知

# error_ログアウトエラー_e
source: ❌ Logout Error: $e
es: ❌ Error de cierre de sesión: $e
ja: ❌ ログアウトエラー: $e

# general_リワード広告リトライ上限到達_maxRetryAttempt回
source: ⚠️ Reward ad retry limit reached ($_maxRetryAttempt times)
es: ⚠️ Se alcanzó el límite de reintentos de anuncios de recompensa ($_maxRetryAttempt veces)
ja: ⚠️ リワード広告リトライ上限到達（$_maxRetryAttempt回）

# workout_高度なテクニック
source: Advanced Techniques
es: Técnicas avanzadas
ja: 高度なテクニック

# profile_サブスクリプション購入時に即時決済
source: • Instant payment when purchasing a subscription
es: • Pago instantáneo al adquirir una suscripción.
ja: • サブスクリプション購入時に即時決済

# subscription_解約理由記録エラー_e
source: ❌ Cancellation reason recording error: $e
es: ❌ Error en el registro del motivo de cancelación: $e
ja: ❌ 解約理由記録エラー: $e

# general_ACWR分析_acwrAdvice
source: [ACWR analysis] $acwrAdvice
es: [Análisis de ACWR] $acwrAdvice
ja: 【ACWR分析】 $acwrAdvice

# workout_StreamBuilder_ユーザーがnull
source: ⚠️ StreamBuilder: user is null
es: ⚠️ StreamBuilder: el usuario es nulo
ja: ⚠️ StreamBuilder: ユーザーがnull

# error_Firestore_接続失敗_e
source: 📴 [Firestore] Connection failed: $e
es: 📴 [Firestore] Error de conexión: $e
ja: 📴 [Firestore] 接続失敗: $e

# workout_全解除
source: Full release
es: Lanzamiento completo
ja: 全解除

# workout_exerciseduration分
source: ${exercise.duration} minutes
es: ${exercise.duration} minutos
ja: ${exercise.duration}分

# workout_挙上した重量と回数から1RMを計算します
source: Calculate your 1RM based on the weight and number of repetitions you lifted.
es: Calcula tu 1RM en función del peso y el número de repeticiones que levantaste.
ja: 挙上した重量と回数から、1RMを計算します

# error_PR履歴取得エラー_e
source: ❌ PR history retrieval error: $e
es: ❌ Error de recuperación del historial de relaciones públicas: $e
ja: ❌ PR履歴取得エラー: $e

# workout_ワークアウト履歴が1件もありません
source: ⚠️ No workout history
es: ⚠️ Sin historial de entrenamiento
ja: ⚠️ ワークアウト履歴が1件もありません

# workout_重量_XXkg
source: Weight: XXkg
es: Peso: XXkg
ja: 重量: XXkg

# general_分析画面は次のフェーズで実装予定
source: The analysis screen will be implemented in the next phase.
es: La pantalla de análisis se implementará en la siguiente fase.
ja: 分析画面は次のフェーズで実装予定

# general_承認
source: approval
es: aprobación
ja: 承認

# subscription_終了日_endDate
source: End Date: $endDate
es: Fecha de finalización: $endDate
ja: 終了日: $endDate

# workout_実際の1RMとは誤差がある可能性があります
source: • There may be some discrepancy with the actual 1RM.
es: • Puede haber alguna discrepancia con el 1RM real.
ja: • 実際の1RMとは誤差がある可能性があります

# general_徳島
source: Tokushima
ja: 徳島

# general_dormantCount名
source: $dormantCount name
es: $dormantCount nombre
ja: $dormantCount名

# subscription_プランキャッシュクリア完了
source: 🗑️ Plan cache cleared
es: 🗑️ Se borró el caché del plan
ja: 🗑️ プランキャッシュクリア完了

# general_memberremainingSessions回
source: ${member.remainingSessions} times
es: ${member.remainingSessions} veces
ja: ${member.remainingSessions}回

# general_投稿テンプレート
source: Post Template
es: Plantilla de publicación
ja: 投稿テンプレート

# workout_ワークアウトデータが空です
source: Workout data is empty
es: Los datos de entrenamiento están vacíos
ja: ワークアウトデータが空です

# general_Firestore読み取り実行_docRefpath
source: ⏳ Firestore Read Execute: ${docRef.path}
es: ⏳ Lectura y ejecución de Firestore: ${docRef.path}
ja: ⏳ Firestore読み取り実行: ${docRef.path}

# general_すべて表示
source: Show all
es: Mostrar todo
ja: すべて表示

# profile_Proプランにアップグレードしてご利用ください
source: Please upgrade to the Pro plan.
es: Actualice al plan Pro.
ja: Proプランにアップグレードしてご利用ください。

# general_足全体で押すイメージで
source: Imagine pushing with your whole foot
es: Imagina empujar con todo el pie.
ja: 足全体で押すイメージで

# workout_科学的根拠に基づくトレーニングメニュー
source: # Scientifically-based training menu
es: # Menú de entrenamiento con base científica
ja: # 科学的根拠に基づくトレーニングメニュー

# workout_WorkoutLogScreen_初期化完了UI更新
source: 📱 [WorkoutLogScreen] Initialization completed, UI updated
es: 📱 [WorkoutLogScreen] Inicialización completada, interfaz de usuario actualizada
ja: 📱 [WorkoutLogScreen] 初期化完了、UI更新

# general_埼玉
source: Saitama
ja: 埼玉

# general_Web版テストモード_ボタンを押すと2秒後にAIクレジットを獲得できます
source: [Web Test Mode] Press the button and receive AI credits after 2 seconds.
es: [Modo de prueba web] Presiona el botón y recibe créditos de IA después de 2 segundos.
ja: 【Web版テストモード】 ボタンを押すと2秒後にAIクレジットを獲得できます

# workout_PR記録取得_snapshotdocslength件のworkout_logs_種目_exercis
source: 📊 Get PR records: ${snapshot.docs.length} workout_logs (exercise: $exercise)
es: 📊 Obtener registros de PR: ${snapshot.docs.length} registros_de_entrenamiento (ejercicio: $ejercicio)
ja: 📊 PR記録取得: ${snapshot.docs.length}件のworkout_logs (種目: $exercise)

# personalFactor_年齢_加齢による回復力の変化
source: • Age: Changes in recovery ability with age
es: • Edad: Cambios en la capacidad de recuperación con el envejecimiento.
ja: • 年齢: 加齢による回復力の変化

# workout_weight分_repskm
source: ${weight}min × ${reps}km
es: ${peso}mín × ${repeticiones}km
ja: ${weight}分 × ${reps}km

# workout_マイテンプレート
source: My Templates
es: Mis plantillas
ja: マイテンプレート

# general_中級者は4ヶ月で約15の筋力向上
source: Intermediate level participants will improve their strength by approximately 15% in 4 months.
es: Los participantes de nivel intermedio mejorarán su fuerza en aproximadamente un 15% en 4 meses.
ja: 中級者は4ヶ月で約15%の筋力向上

# general_岐阜
source: Gifu
ja: 岐阜

# workout_4560分で完了_languageInstruction_重要_各種目に具体的な重量と回数を必ず記載
source: } - Complete in 45-60 minutes - $languageInstruction **Important: Be sure to enter the specific weight and repetitions for each exercise. For aerobic exercise, enter the weight as 0kg and the time as XX minutes.** ${targetParts.contains(AppLocalizations.of(context)!.exerciseCardio) ?
es: } - Completar en 45-60 minutos - $languageInstruction **Importante: Asegúrate de introducir el peso y las repeticiones específicas para cada ejercicio. Para ejercicios aeróbicos, introduce el peso como 0 kg y el tiempo como XX minutos.** ${targetParts.contains(AppLocalizations.of(context)!.exerciseCardio) ?
ja: } - 45-60分で完了 - $languageInstruction **重要: 各種目に具体的な重量と回数を必ず記載してください。有酸素運動の場合は重量0kg、時間をXX分形式で記載してください。** ${targetParts.contains(AppLocalizations.of(context)!.exerciseCardio) ?

# workout_次のセットに進みましょう
source: Let's move on to the next set! 💪
es: ¡Pasemos al siguiente conjunto! 💪
ja: 次のセットに進みましょう！💪

# general_ブラウザで位置情報を許可してください
source: Please allow location information in your browser
es: Por favor permita la información de ubicación en su navegador
ja: ブラウザで位置情報を許可してください

# profile_Appleの返金ポリシーに準拠します返金についてはApp_Storeサポートにお問い合わせください
source: We follow Apple's refund policy. For refunds, please contact App Store Support.
es: Seguimos la política de reembolsos de Apple. Para solicitar un reembolso, contacta con el soporte de la App Store.
ja: Appleの返金ポリシーに準拠します。返金については、App Storeサポートにお問い合わせください。

# general_招待した側
source: The person who invited
es: La persona que invitó
ja: 招待した側

# subscription_ジムレビュー投稿_1
source: • Post a gym review
es: • Publica una reseña del gimnasio.
ja: • ジムレビュー投稿

# workout_システムサウンド再生成功
source: ✅ System sound playback successful
es: ✅ El sonido del sistema se reprodujo correctamente
ja: ✅ システムサウンド再生成功

# error_AI分析エラー_e
source: ❌ AI analysis error: $e
es: ❌ Error de análisis de IA: $e
ja: ❌ AI分析エラー: $e

# workout_setslength_0_if_exerciseRecordslength_4_break_if_e
source: : sets?.length ?? 0, }); if (exerciseRecords.length >= 4) break; } } } if (exerciseRecords.length >= 4) break; } / Sort by date (newest first) exerciseRecords.sort((a, b) => (b[
es: : establece?.length ?? 0, }); if (exerciseRecords.length >= 4) break; } } } if (exerciseRecords.length >= 4) break; } / Ordenar por fecha (más reciente primero) exerciseRecords.sort((a, b) => (b[
ja: : sets?.length ?? 0, }); if (exerciseRecords.length >= 4) break; } } } if (exerciseRecords.length >= 4) break; } // 日付順にソート（新しい順） exerciseRecords.sort((a, b) => (b[

# gym_マシン器具
source: Machines and equipment
es: Máquinas y equipos
ja: マシン・器具

# subscription_一時停止で無駄な支払いを避けて必要な時に再開できます
source: Pause to avoid unnecessary payments and resume when you need to
es: Haz una pausa para evitar pagos innecesarios y reanúdalo cuando lo necesites
ja: 一時停止で無駄な支払いを避けて、必要な時に再開できます

# general_電話番号を入力してください
source: Please enter your phone number
es: Por favor ingrese su número de teléfono
ja: 電話番号を入力してください

# general_大阪
source: Osaka
ja: 大阪

# general_リワード広告SDK初期化成功
source: ✅ Rewarded Ad SDK initialization successful
es: ✅ Inicialización exitosa del SDK de anuncios recompensados
ja: ✅ リワード広告SDK初期化成功

# general_更新確認_verifySetslengthセット期待値_remainingSetslength
source: ✅ Update verification: ${verifySets.length} sets (expected value: ${remainingSets.length})
es: ✅ Verificación de actualización: ${verifySets.length} conjuntos (valor esperado: ${remainingSets.length})
ja: ✅ 更新確認: ${verifySets.length}セット（期待値: ${remainingSets.length}）

# general_既に友達申請を送信しています
source: You have already sent a friend request
es: Ya has enviado una solicitud de amistad.
ja: 既に友達申請を送信しています

# workout_コア
source: core
es: centro
ja: コア

# general_パワーレッド_シルバー_情熱と力強さを表現
source: Power Red x Silver - Expressing passion and strength
es: Power Red x Silver: Expresando pasión y fuerza
ja: パワーレッド × シルバー 情熱と力強さを表現

# error_PR取得エラー_e
source: ❌ PR acquisition error: $e
es: ❌ Error de adquisición de relaciones públicas: $e
ja: ❌ PR取得エラー: $e

# general_totalSets_セット
source: $totalSets Sets
es: $totalSets Conjuntos
ja: $totalSets セット

# general_予約申込を送信しました店舗から連絡があります
source: ✅ Your reservation request has been sent! The store will contact you.
es: ¡Tu solicitud de reserva ha sido enviada! La tienda se pondrá en contacto contigo.
ja: ✅ 予約申込を送信しました！店舗から連絡があります。

# workout_あなたのレベル_userLevel_に合わせた重量回数を設定しています
source: The weight and number of repetitions are set according to your level ($userLevel)
es: El peso y el número de repeticiones se establecen según tu nivel ($userLevel).
ja: あなたのレベル ($userLevel) に合わせた重量・回数を設定しています

# workout_style_TextStyle_fontSize_11_color_Colorsgreyshade6_3
source: , style: TextStyle( fontSize: 11, color: Colors.grey.shade600, fontStyle: FontStyle.italic, ), ), ), const SizedBox(height: 16), / Plateau detection toggle SwitchListTile( title: const Text(
es: , style: TextStyle( fontSize: 11, color: Colors.grey.shade600, fontStyle: FontStyle.italic, ), ), ), const SizedBox(height: 16), / Activación/desactivación de detección de meseta SwitchListTile( title: const Text(
ja: , style: TextStyle( fontSize: 11, color: Colors.grey.shade600, fontStyle: FontStyle.italic, ), ), ), const SizedBox(height: 16), // プラトー検出トグル SwitchListTile( title: const Text(

# workout_トレーニングメニューを提案してください_advancedExerciseDatabase_histo_1
source: )}" Please suggest a training menu. $_advancedExerciseDatabase $historyInfo [Target Audience] - 6 months to 2 years of strength training experience - Those aiming for muscle strength and hypertrophy - Those seeking to master more advanced techniques [Proposal Format] **Please output in this format:** ``` ## Body Part Training Menu **Exercise 1: Exercise Name** * Weight: XX kg * Reps: XX * Sets: X sets * Rest Time: XX seconds * Key Points: Description **Exercise 2: Exercise Name** * Weight: XX kg * Reps: XX * Sets: X sets ``` Please include the following information for each exercise: - Exercise Name (select from the exercise database) - **Specific Weight (kg)** ← Suggestions are based on 70-85% of your historical 1RM. *For aerobic exercise, enter "Weight: 0 kg" and "Time: XX minutes" instead of "Reps." - **Number of repetitions (8-12)** ← For aerobic exercise, choose "Time: 30-45 minutes" or "Interval format" - Number of sets (3-4 sets) ← For aerobic exercise, choose "1 set" - Rest period (60-90 seconds) - Technique tips (drop sets, supersets, etc.) [Conditions] - ${targetParts.isEmpty ?
es: )}" Sugiera un menú de entrenamiento. $_advancedExerciseDatabase $historyInfo [Público objetivo] - De 6 meses a 2 años de experiencia en entrenamiento de fuerza - Personas que buscan fuerza muscular e hipertrofia - Personas que buscan dominar técnicas más avanzadas [Formato de la propuesta] **Por favor, escriba en este formato:** ``` ## Menú de entrenamiento por parte del cuerpo **Ejercicio 1: Nombre del ejercicio** * Peso: XX kg * Repeticiones: XX * Series: X series * Tiempo de descanso: XX segundos * Puntos clave: Descripción **Ejercicio 2: Nombre del ejercicio** * Peso: XX kg * Repeticiones: XX * Series: X series ``` Incluya la siguiente información para cada ejercicio: - Nombre del ejercicio (seleccione de la base de datos de ejercicios) - **Peso específico (kg)** ← Las sugerencias se basan en el 70-85 % de su 1RM histórico. *Para ejercicio aeróbico, introduzca "Peso: 0 kg" y "Tiempo: XX minutos" en lugar de "Repeticiones". - **Número de repeticiones (8-12)** ← Para ejercicios aeróbicos, elige "Tiempo: 30-45 minutos" o "Formato de intervalos". - Número de series (3-4 series) ← Para ejercicios aeróbicos, elige "1 serie". - Periodo de descanso (60-90 segundos). - Consejos técnicos (series descendentes, superseries, etc.). [Condiciones] - ${targetParts.isEmpty ?
ja: )}」トレーニングメニューを提案してください。 $_advancedExerciseDatabase $historyInfo 【対象者】 - 筋トレ経験6ヶ月〜2年程度 - 筋力・筋肥大を目指す方 - より高度なテクニックを習得したい方 【提案形式】 **必ずこの形式で出力してください：** ``` ## 部位トレーニングメニュー **種目1：種目名** * 重量：XXkg * 回数：XX回 * セット数：Xセット * 休憩時間：XX秒 * ポイント：説明文 **種目2：種目名** * 重量：XXkg * 回数：XX回 * セット数：Xセット ``` 各種目について以下の情報を含めてください： - 種目名（種目データベースから選択） - **具体的な重量（kg）** ← 履歴の1RMの70-85%を目安に提案 ※有酸素運動の場合は「重量：0kg」とし、回数の代わりに「時間：XX分」を記載 - **回数（8-12回）** ← 有酸素の場合は「時間：30-45分」または「インターバル形式」 - セット数（3-4セット）← 有酸素の場合は「1セット」 - 休憩時間（60-90秒） - テクニックのポイント（ドロップセット、スーパーセット等） 【条件】 - ${targetParts.isEmpty ?

# gym_エラー_e
source: Error: $e
ja: エラー: $e

# profile_画像読み込み完了_byteslength_bytes_byteslength_1024toStrin
source: ✅ Image loaded: ${bytes.length} bytes (${(bytes.length / 1024).toStringAsFixed(2)} KB)
es: ✅ Imagen cargada: ${bytes.length} bytes (${(bytes.length / 1024).toStringAsFixed(2)} KB)
ja: ✅ 画像読み込み完了: ${bytes.length} bytes (${(bytes.length / 1024).toStringAsFixed(2)} KB)

# gym_東京都世田谷区三軒茶屋151515
source: 15-15-15 Sangenjaya, Setagaya-ku, Tokyo
es: 15-15-15 Sangenjaya, Setagaya-ku, Tokio
ja: 東京都世田谷区三軒茶屋15-15-15

# workout_前回記録取得_snapshotdocslength件のワークアウト履歴
source: 📊 Get last record: ${snapshot.docs.length} workout history
es: 📊 Obtener el último registro: ${snapshot.docs.length} historial de entrenamiento
ja: 📊 前回記録取得: ${snapshot.docs.length}件のワークアウト履歴

# general_総合疲労度分析
source: 🔬 Overall fatigue analysis
es: 🔬 Análisis general de la fatiga
ja: 🔬 総合疲労度分析

# general_紹介特典ゲット
source: Get referral benefits!
es: ¡Obtenga beneficios por recomendación!
ja: 紹介特典ゲット！

# workout_処理中_line
source: 📄 Processing: $line
es: 📄 Procesando: $line
ja: 📄 処理中: $line

# general_AIクレジット1回分を獲得しました
source: ✅ You have earned 1 AI credit!
es: ✅ ¡Has ganado 1 crédito de IA!
ja: ✅ AIクレジット1回分を獲得しました！

# subscription_バックグラウンド永年プランチェックエラー_e
source: ⚠️ Background permanent plan check error: $e
es: ⚠️ Error de verificación del plan permanente en segundo plano: $e
ja: ⚠️ バックグラウンド永年プランチェックエラー: $e

# error_アップロードエラー_e
source: ❌ Upload Error: $e
es: ❌ Error de carga: $e
ja: ❌ アップロードエラー: $e

# error_ユーザー情報取得失敗_e
source: ❌ Failed to get user information: $e
es: ❌ No se pudo obtener la información del usuario: $e
ja: ❌ ユーザー情報取得失敗: $e

# subscription_トライアル残り日数取得エラー_e
source: ❌ Error getting remaining trial days: $e
es: ❌ Error al obtener los días de prueba restantes: $e
ja: ❌ トライアル残り日数取得エラー: $e

# workout_大腿四頭筋
source: quadriceps femoris
es: cuádriceps femoral
ja: 大腿四頭筋

# gym_東京都港区高輪555
source: 5-5-5 Takanawa, Minato-ku, Tokyo
es: 5-5-5 Takanawa, Minato-ku, Tokio
ja: 東京都港区高輪5-5-5

# general_休眠中です2週間以上セッションなし
source: Dormant (no sessions for over 2 weeks)
es: Inactivo (sin sesiones durante más de 2 semanas)
ja: 休眠中です（2週間以上セッションなし）

# workout_トレーナー記録取得開始_email
source: 📧 Start getting trainer records: $email
es: 📧 Comienza a recibir registros de entrenadores: $email
ja: 📧 トレーナー記録取得開始: $email

# bodyPart_胸背中肩を集中的に鍛えるテンプレート
source: Templates for focusing on chest, back, and shoulders
es: Plantillas para centrarse en el pecho, la espalda y los hombros.
ja: 胸・背中・肩を集中的に鍛えるテンプレート

# general_削除対象ドキュメント
source: 📄 Documents to be deleted:
es: 📄 Documentos a eliminar:
ja: 📄 削除対象ドキュメント:

# general_Proプラン限定機能です
source: This feature is only available on the Pro plan
es: Esta función es exclusiva del plan Pro
ja: Proプラン限定機能です

# general_クーポン_couponCodeControllertexttoUpperCase
source: Coupon: ${_couponCodeController.text.toUpperCase()}
es: Cupón: ${_couponCodeController.text.toUpperCase()}
ja: クーポン: ${_couponCodeController.text.toUpperCase()}

# workout_履歴形式が不正
source: ⚠️ Invalid history format
es: ⚠️ Formato de historial no válido
ja: ⚠️ 履歴形式が不正

# workout_ワークアウトメモ_匿名認証エラー_e
source: ❌ Workout Notes: Anonymous authentication error: $e
es: ❌ Notas de entrenamiento: Error de autenticación anónima: $e
ja: ❌ ワークアウトメモ: 匿名認証エラー: $e

# general_レビューリクエスト送信成功
source: ✅ Review request sent successfully
es: ✅ Solicitud de revisión enviada exitosamente
ja: ✅ レビューリクエスト送信成功
