Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# workout_今月のAI使用回数が上限に達しました
source: The limit for AI usage has been reached this month.
es: Este mes se ha alcanzado el límite de uso de IA.
ja: 今月のAI使用回数が上限に達しました。

# workout_duration分
source: $duration minutes
es: $duración minutos
ja: $duration分

# general_Premium_1ヶ月無料
source: 🎁 1 month free Premium!
es: 🎁 ¡1 mes Premium gratis!
ja: 🎁 Premium 1ヶ月無料！

# error_レビューリクエストエラー_e
source: ❌ Review request error: $e
es: ❌ Error en la solicitud de revisión: $e
ja: ❌ レビューリクエストエラー: $e

# workout_CSV解析開始
source: 📄 Start CSV analysis...
es: 📄 Iniciar análisis CSV...
ja: 📄 CSV解析開始...

# general_Phase_1リセット後は必ずアプリを再起動してください
source: ⚠️ Be sure to restart the app after performing a Phase 1 reset.
es: ⚠️ Asegúrate de reiniciar la aplicación después de realizar un restablecimiento de la Fase 1.
ja: ⚠️ Phase 1リセット後は必ずアプリを再起動してください

# workout_部位別トレーニング今月
source: Body Part Training (This Month)
es: Entrenamiento de partes del cuerpo (este mes)
ja: 部位別トレーニング（今月）

# general_ピリオダイゼーション必須の緩成長期
source: A slow growth period where periodization is essential
es: Un período de crecimiento lento donde la periodización es esencial
ja: ピリオダイゼーション必須の緩成長期

# general_クーポンコード_任意
source: Coupon code (optional)
es: Código de cupón (opcional)
ja: クーポンコード (任意)

# workout_トレーナー記録取得_querySnapshotdocslength件_email_memberEma
source: Get trainer records: ${querySnapshot.docs.length} (email: $memberEmail)
es: Obtener registros del entrenador: ${querySnapshot.docs.length} (correo electrónico: $memberEmail)
ja: トレーナー記録取得: ${querySnapshot.docs.length}件 (email: $memberEmail)

# general_あなたの特典
source: 🎁 Your Perks
es: 🎁 Tus beneficios
ja: 🎁 あなたの特典

# error_AdMob_バナー広告読み込み失敗
source: ❌ [AdMob] Banner ad loading failure
es: ❌ [AdMob] Error al cargar el banner publicitario
ja: ❌ [AdMob] バナー広告読み込み失敗

# workout_メモを入力
source: Enter your notes...
es: Introduce tus notas...
ja: メモを入力...

# general_レジェンド
source: Legend
es: Leyenda
ja: レジェンド

# workout_種目追加
source: Addition of new events
es: Adición de nuevos eventos
ja: 種目追加

# workout_強度
source: strength
es: fortaleza
ja: 強度

# general_新潟
source: Niigata
ja: 新潟

# error_予期しないAI追加パック購入エラー_e
source: ❌ Unexpected AI add-on pack purchase error: $e
es: ❌ Error inesperado en la compra del paquete complementario de IA: $e
ja: ❌ 予期しないAI追加パック購入エラー: $e

# error_トレーニング記録の読み込みエラー_e
source: ❌ Error loading training record: $e
es: ❌ Error al cargar el registro de entrenamiento: $e
ja: ❌ トレーニング記録の読み込みエラー: $e

# workout_毎週月曜日に自動生成されます
source: Automatically generated every Monday
es: Generado automáticamente cada lunes
ja: 毎週月曜日に自動生成されます

# general_ホーム画面に追加する方法
source: How to add it to your home screen
es: Cómo agregarlo a tu pantalla de inicio
ja: ホーム画面に追加する方法

# general_友達をもっと誘ってさらに特典をゲットしよう
source: 🚀 Invite more friends and get more rewards!
es: 🚀 ¡Invita a más amigos y obtén más recompensas!
ja: 🚀 友達をもっと誘って、さらに特典をゲットしよう！

# general_今月_currentMonthVolumetoStringAsFixed2t
source: This month: ${currentMonthVolume.toStringAsFixed(2)}t
es: Este mes: ${currentMonthVolume.toStringAsFixed(2)}t
ja: 今月: ${currentMonthVolume.toStringAsFixed(2)}t

# workout_デバッグ_生成されたテキストを見る
source: 🐛 Debugging: Viewing the generated text
es: 🐛 Depuración: Visualización del texto generado
ja: 🐛 デバッグ: 生成されたテキストを見る

# general_スワイプ削除実行_exerciseName_ID_workoutId
source: 👆 Swipe to delete Run: $exerciseName (ID: $workoutId)
es: 👆 Deslizar Eliminar Ejecutar: $exerciseName (ID: $workoutId)
ja: 👆 スワイプ削除実行: $exerciseName (ID: $workoutId)

# error_スケジュール分析エラー_e
source: ❌ Schedule analysis error: $e
es: ❌ Error de análisis de programación: $e
ja: ❌ スケジュール分析エラー: $e

# general_総ボリューム
source: Total Volume
es: Volumen total
ja: 総ボリューム

# workout_AIがトレーニングメニューを提案
source: 🤖 AI suggests training menus
es: 🤖 La IA sugiere menús de entrenamiento
ja: 🤖 AIがトレーニングメニューを提案

# workout_対象日_targetDate
source: 📅 Target Date: $targetDate
es: 📅 Fecha objetivo: $targetDate
ja: 📅 対象日: $targetDate

# general_アプリ起動開始_Firebase_firebaseInitialized
source: 🚀 App launch (Firebase: ${firebaseInitialized ?
es: 🚀 Lanzamiento de la aplicación (Firebase: ${firebaseInitialized ?
ja: 🚀 アプリ起動開始 (Firebase: ${firebaseInitialized ?

# general_PO情報が見つかりません
source: PO information not found
es: Información de la orden de compra no encontrada
ja: PO情報が見つかりません

# workout_APIレスポンス_responsestatusCode
source: 📡 API response: ${response.statusCode}
es: 📡 Respuesta de la API: ${response.statusCode}
ja: 📡 APIレスポンス: ${response.statusCode}

# gym_秋葉原駅近くの24時間営業ジムビジネスマンに人気
source: A 24-hour gym near Akihabara Station, popular with businessmen.
es: Un gimnasio abierto las 24 horas cerca de la estación de Akihabara, popular entre los hombres de negocios.
ja: 秋葉原駅近くの24時間営業ジム。ビジネスマンに人気。

# profile_プラン詳細を見る
source: View plan details
es: Ver detalles del plan
ja: プラン詳細を見る

# workout_これらの部位を次回のトレーニングで強化しましょう
source: Strengthen these areas in your next workout
es: Fortalece estas áreas en tu próximo entrenamiento
ja: これらの部位を次回のトレーニングで強化しましょう

# workout_例_5
source: Example: 5
es: Ejemplo: 5
ja: 例: 5

# general_7日連続トレーニング達成
source: Achieved 7 days of continuous training
es: Se lograron 7 días de capacitación continua
ja: 7日連続トレーニング達成

# error_記録読み込みエラー_e
source: ❌ Error reading record: $e
es: ❌ Error al leer el registro: $e
ja: ❌ 記録読み込みエラー: $e

# subscription_広告表示あり
source: 📢 Ads included
es: 📢 Anuncios incluidos
ja: 📢 広告表示あり

# general_特別報酬
source: special reward
es: recompensa especial
ja: 特別報酬

# general_神経系適応による急速な向上期
source: A period of rapid improvement due to neural adaptation
es: Un período de rápida mejora debido a la adaptación neuronal.
ja: 神経系適応による急速な向上期

# general_ACWRの計算には最低7日間のトレーニングデータが必要です
source: ACWR calculation requires a minimum of 7 days of training data.
es: El cálculo de ACWR requiere un mínimo de 7 días de datos de entrenamiento.
ja: ACWRの計算には最低7日間のトレーニングデータが必要です。

# workout_有酸素時間_totalMinutes分
source: Aerobic minutes: $totalMinutes
es: Minutos aeróbicos: $totalMinutes
ja: 有酸素時間: $totalMinutes分

# general_AI_コーチング
source: AI Coaching
es: Coaching de IA
ja: AI コーチング

# profile_本アプリのサーバーまたはネットワークの機能を破壊したり妨害したりする行為
source: • Any actions that disrupt or interfere with the functionality of the app's servers or network.
es: • Cualquier acción que interrumpa o interfiera con la funcionalidad de los servidores o la red de la aplicación.
ja: • 本アプリのサーバーまたはネットワークの機能を破壊したり、妨害したりする行為

# general_宮城
source: Miyagi
ja: 宮城

# subscription_購入エラー_e
source: ❌ Purchase Error: $e
es: ❌ Error de compra: $e
ja: ❌ 購入エラー: $e

# general_削除キャンセル_exerciseName
source: ❌Cancel deletion: $exerciseName
es: ❌Cancelar eliminación: $exerciseName
ja: ❌ 削除キャンセル: $exerciseName

# general_位置情報設定完了_positionlatitude_positionlongitude
source: ✅ Location information settings completed: ${position!.latitude}, ${position.longitude}
es: ✅ Configuración de información de ubicación completada: ${position!.latitude}, ${position.longitude}
ja: ✅ 位置情報設定完了: ${position!.latitude}, ${position.longitude}

# general_あとremainingtoStringAsFixed0goalunitで達成
source: Just ${remaining.toStringAsFixed(0)}${goal.unit} left to achieve!
es: ¡Solo faltan ${remaining.toStringAsFixed(0)}${goal.unit} para lograrlo!
ja: あと${remaining.toStringAsFixed(0)}${goal.unit}で達成！

# general_コピーしたテンプレートを貼り付けて投稿
source: Paste the copied template and post it
es: Pegue la plantilla copiada y publíquela.
ja: コピーしたテンプレートを貼り付けて投稿

# general_ログアウト成功
source: ✅ Logout successful
es: ✅ Cierre de sesión exitoso
ja: ✅ ログアウト成功

# error_Google_Places_API検索エラー_e
source: ⚠️ Google Places API search error: $e
es: ⚠️ Error de búsqueda de la API de Google Places: $e
ja: ⚠️ Google Places API検索エラー: $e

# error_画像の読み込みに失敗しました_e
source: Image failed to load: $e
es: No se pudo cargar la imagen: $e
ja: 画像の読み込みに失敗しました: $e

# workout_秒数
source: Number of seconds
es: Número de segundos
ja: 秒数

# workout_試行_retryCountmaxRetries
source: Attempts $retryCount/$maxRetries...
es: Intentos $retryCount/$maxRetries...
ja: 試行 $retryCount/$maxRetries...

# general_30秒の動画視聴でAI機能1回追加
source: Watch a 30-second video to unlock one AI feature
es: Mire un video de 30 segundos para desbloquear una función de IA
ja: 30秒の動画視聴でAI機能1回追加

# general_津福
source: Tsufuku
ja: 津福

# workout_トレーニングメニューを提案してください_対象者_筋トレ初心者ジム通い始めて13ヶ月程度_target
source: )}" Please suggest a training menu. [Target Audience] - Beginners to strength training (1-3 months into gym attendance) - ${targetParts.join(
es: )}" Por favor, sugiera un menú de entrenamiento. [Público objetivo] - Principiantes en entrenamiento de fuerza (1-3 meses de asistencia al gimnasio) - ${targetParts.join(
ja: )}」トレーニングメニューを提案してください。 【対象者】 - 筋トレ初心者（ジム通い始めて1〜3ヶ月程度） - ${targetParts.join(

# workout_length_0種目
source: ]?.length ?? 0}Event
ja: ]?.length ?? 0}種目

# error_AI利用ログ記録エラー_e
source: ❌ AI usage log recording error: $e
es: ❌ Error en el registro de uso de IA: $e
ja: ❌ AI利用ログ記録エラー: $e

# general_位置情報権限が拒否されました
source: ❌ Location permission denied
es: ❌ Permiso de ubicación denegado
ja: ❌ 位置情報権限が拒否されました

# general_平均30秒未満の連続利用
source: Average continuous use of less than 30 seconds
es: Uso continuo promedio de menos de 30 segundos
ja: 平均30秒未満の連続利用

# workout_最初の行_csvRowsfirst
source: 📊 First row: ${csvRows.first}
es: 📊 Primera fila: ${csvRows.first}
ja: 📊 最初の行: ${csvRows.first}

# general_SafariやChromeの共有ボタンをタップ
source: Tap the share button (📤) in Safari or Chrome
es: Toca el botón compartir (📤) en Safari o Chrome
ja: SafariやChromeの共有ボタン（📤）をタップ

# subscription_全国のジム検索
source: Search gyms nationwide
es: Busca gimnasios en todo el país
ja: 全国のジム検索

# workout_AIコーチングについて
source: About AI Coaching
es: Acerca del coaching de IA
ja: AIコーチングについて

# workout_ジムにあるプレートだけを選択してください
source: • Select only plates found in your gym.
es: • Selecciona solo los platos que se encuentran en tu gimnasio.
ja: • ジムにあるプレートだけを選択してください

# workout_選択種目_selectedExerciseslength件
source: 📋 Selected Exercises: ${selectedExercises.length}
es: 📋 Ejercicios seleccionados: ${selectedExercises.length}
ja: 📋 選択種目: ${selectedExercises.length}件

# workout_動画を視聴
source: Watch the video
es: Mira el video
ja: 動画を視聴

# workout_種目リスト読み込みエラー_e
source: ⚠️ Error loading event list: $e
es: ⚠️ Error al cargar la lista de eventos: $e
ja: ⚠️ 種目リスト読み込みエラー: $e

# general_招待コードは1回のみ使用可能です_既に他のユーザーが使用したコードは無効です
source: * An invitation code can only be used once. * Codes already used by other users are invalid.
es: * Un código de invitación solo se puede usar una vez. * Los códigos ya utilizados por otros usuarios no son válidos.
ja: ※ 招待コードは1回のみ使用可能です ※ 既に他のユーザーが使用したコードは無効です

# profile_第6条準拠法裁判管轄
source: Article 6 (Governing Law and Jurisdiction)
es: Artículo 6 (Ley aplicable y jurisdicción)
ja: 第6条（準拠法・裁判管轄）

# general_AI利用ログ記録_userId_featureType
source: ✅ AI usage log: $userId - $featureType
es: ✅ Registro de uso de IA: $userId - $featureType
ja: ✅ AI利用ログ記録: $userId - $featureType

# general_乗り換え割キャンペーン
source: 🎉 Transfer Discount Campaign
es: 🎉 Campaña de Descuento por Transferencia
ja: 🎉 乗り換え割キャンペーン

# profile_自動更新
source: automatic update
es: actualización automática
ja: 自動更新

# general_FitSyncをインストール
source: Install FitSync
es: Instalar FitSync
ja: FitSyncをインストール

# general_匿名ユーザー
source: Anonymous users
es: Usuarios anónimos
ja: 匿名ユーザー

# gym_ルネサンス_恵比寿
source: Renaissance Ebisu
es: Ebisu renacentista
ja: ルネサンス 恵比寿

# workout_あなたのトレーニングデータを基に疲労度を科学的に分析します
source: Your fatigue level is scientifically analyzed based on your training data.
es: Tu nivel de fatiga se analiza científicamente en función de tus datos de entrenamiento.
ja: あなたのトレーニングデータを基に、疲労度を科学的に分析します。

# general_目標レップ数を12回超過達成
source: Achieve 1-2 reps more than your target number of reps
es: Consigue 1 o 2 repeticiones más que tu número objetivo de repeticiones.
ja: 目標レップ数を1-2回超過達成

# general_バナー広告読み込み成功
source: ✅ Banner ad loaded successfully
es: ✅ El anuncio de banner se cargó correctamente
ja: ✅ バナー広告読み込み成功

# general_沖縄
source: Okinawa
ja: 沖縄

# profile_第5条免責事項
source: Article 5 (Disclaimer)
es: Artículo 5 (Descargo de responsabilidad)
ja: 第5条（免責事項）

# general_却下
source: Rejected
es: Rechazado
ja: 却下

# general_兵庫
source: Hyogo
es: Hyōgo
ja: 兵庫

# subscription_高度なフィルター検索
source: • Advanced filter search
es: • Búsqueda de filtros avanzados
ja: • 高度なフィルター検索

# general_武道館
source: Budokan
ja: 武道館

# workout_推定1RM_oneRMtoStringAsFixed1
source: 💪 Estimated 1RM: ${oneRM?.toStringAsFixed(1) ??
es: 💪 1RM estimado: ${oneRM?.toStringAsFixed(1) ??
ja: 💪 推定1RM: ${oneRM?.toStringAsFixed(1) ??

# general_拒否
source: rejection
es: rechazo
ja: 拒否

# general_もっと招待する
source: Invite more
es: Invitar a más
ja: もっと招待する

# workout_有酸素時間検出_timeMatchgroup1分_repscurrentReps_line_clea
source: ⏱️ Cardio time detection: ${timeMatch.group(1)} minutes → reps=$currentReps (line: $cleanLine)
es: ⏱️ Detección de tiempo de cardio: ${timeMatch.group(1)} minutos → repeticiones = $currentReps (línea: $cleanLine)
ja: ⏱️ 有酸素時間検出: ${timeMatch.group(1)}分 → reps=$currentReps (line: $cleanLine)

# workout_Phase_7_Weight_Ratio計算準備完了_体重weightkg
source: 🎯 [Phase 7] Weight Ratio calculation ready: Weight=${weight}kg
es: 🎯 [Fase 7] Cálculo de la relación de peso listo: Peso = ${weight}kg
ja: 🎯 [Phase 7] Weight Ratio計算準備完了: 体重=${weight}kg

# personalFactor_変更頻度_低
source: Change frequency: Low
es: Frecuencia de cambio: Baja
ja: 変更頻度: 低

# general_ダッシュボードデータ読み込み開始
source: 📊 Dashboard data loading...
es: 📊 Cargando datos del tablero...
ja: 📊 ダッシュボードデータ読み込み開始...

# workout_バーベルに必要なプレート組み合わせを計算
source: Calculate the barbell plate combination you need
es: Calcula la combinación de discos y barras que necesitas
ja: バーベルに必要なプレート組み合わせを計算

# workout_entrykey_最大重量entryvalue
source: ${entry.key}: max weight=${entry.value[
es: ${entry.key}: peso máximo=${entry.value[
ja: ${entry.key}: 最大重量=${entry.value[

# error_AI予測の生成に失敗しました_e
source: Failed to generate AI prediction: $e
es: No se pudo generar la predicción de IA: $e
ja: AI予測の生成に失敗しました: $e

# workout_canUseAI結果_canUse
source: canUseAI result: $canUse
es: Resultado de canUseAI: $canUse
ja: canUseAI結果: $canUse

# profile_AI使用回数_5回
source: AI usage count +5 times
es: Recuento de uso de IA +5 veces
ja: AI使用回数 +5回

# general_取得件数_querySnapshotdocslength
source: 📊 Number of results: ${querySnapshot.docs.length}
es: 📊 Número de resultados: ${querySnapshot.docs.length}
ja: 📊 取得件数: ${querySnapshot.docs.length}

# general_トレーニング統計
source: Training Statistics
es: Estadísticas de entrenamiento
ja: トレーニング統計

# profile_リクエスト受信時に通知
source: Notify when a request is received
es: Notificar cuando se recibe una solicitud
ja: リクエスト受信時に通知

# workout_toDouble_0_if_weight_maxWeight_maxWeight_weight_記録
source: ]?.toDouble() ?? 0; if (weight > maxWeight) { maxWeight = weight; } } } } / Add a record (stop when 4 records are reached) exerciseRecords.add({
es: ]?.toDouble() ?? 0; if (weight > maxWeight) { maxWeight = weight; } } } } / Añadir un registro (detenerse al alcanzar 4 registros) exerciseRecords.add({
ja: ]?.toDouble() ?? 0; if (weight > maxWeight) { maxWeight = weight; } } } // 記録を追加（4件に達したら終了） exerciseRecords.add({

# workout_setsセット
source: ${sets} Sets
es: ${sets} Conjuntos
ja: ${sets}セット

# general_ブロックする
source: Block
es: Bloquear
ja: ブロックする

# workout_広告視聴結果_watchedAd
source: Ad watched result: $watchedAd
es: Resultado del anuncio visto: $watchedAd
ja: 広告視聴結果: $watchedAd

# general_履歴
source: history
es: historia
ja: 履歴

# general_推奨アクションプラン
source: ## Recommended Action Plan
es: ## Plan de acción recomendado
ja: ## 推奨アクションプラン

# general_セッション全体を振り返り最も適切な値を選択してください
source: Think back through the session and choose the most appropriate value.
es: Recuerde la sesión y elija el valor más apropiado.
ja: セッション全体を振り返り、最も適切な値を選択してください

# general_ビジター予約設定
source: Visitor reservation settings
es: Configuración de reservas para visitantes
ja: ビジター予約設定

# general_トレーニング頻度
source: Training background
es: Antecedentes de formación
ja: トレーニング頻度

# workout_exerciseNameを削除しました残りremainingExerciseNames種目
source: "$exerciseName" has been deleted (${remainingExerciseNames} exercises remaining)
es: "$exerciseName" ha sido eliminado (${remainingExerciseNames} ejercicios restantes)
ja: 「$exerciseName」を削除しました（残り${remainingExerciseNames}種目）

# profile_希望エリア
source: Preferred area
es: Zona preferida
ja: 希望エリア

# workout_オフライン
source: 📴 Offline
es: 📴 Sin conexión
ja: 📴 オフライン

# workout_value_selectedBodyPart_items_bodyParts_onChanged_v
source: , value: _selectedBodyPart, items: _bodyParts, onChanged: (value) { setState(() { _selectedBodyPart = value!; // Automatically select exercise when changing body part _selectedExercise = _availableExercises.isNotEmpty ? _availableExercises.first : AppLocalizations.of(context)!.exerciseBenchPress; }); }, ), const SizedBox(height: 16), // Select exercise _buildDropdownField( label:
es: , valor: _selectedBodyPart, elementos: _bodyParts, onChanged: (valor) { setState(() { _selectedBodyPart = valor!; // Seleccionar ejercicio automáticamente al cambiar la parte del cuerpo _selectedExercise = _availableExercises.isNotEmpty ? _availableExercises.first : AppLocalizations.of(context)!.exerciseBenchPress; }); }, ), const SizedBox(altura: 16), // Seleccionar ejercicio _buildDropdownField( etiqueta:
ja: , value: _selectedBodyPart, items: _bodyParts, onChanged: (value) { setState(() { _selectedBodyPart = value!; // 部位変更時に種目を自動選択 _selectedExercise = _availableExercises.isNotEmpty ? _availableExercises.first : AppLocalizations.of(context)!.exerciseBenchPress; }); }, ), const SizedBox(height: 16), // 種目選択 _buildDropdownField( label:

# general_トレーニング後の疲労度を科学的に分析し
source: Scientifically analyzes fatigue levels after training,
es: Analiza científicamente los niveles de fatiga después del entrenamiento,
ja: トレーニング後の疲労度を科学的に分析し、

# general_テストにはTestFlightサンドボックス課金を使用してください
source: Please use "TestFlight Sandbox Billing" for testing.
es: Utilice "TestFlight Sandbox Billing" para realizar pruebas.
ja: テストには「TestFlightサンドボックス課金」を使用してください。

# workout_タイマー停止
source: Timer stop
es: Parada del temporizador
ja: タイマー停止

# exercise_インクラインベンチプレス
source: Incline Bench Press
es: Press de banca inclinado
ja: インクラインベンチプレス

# profile_コードをコピーしました
source: ✅ Code copied!
es: ✅ ¡Código copiado!
ja: ✅ コードをコピーしました！

# subscription_AI機能無制限_広告なし_すべての機能を永久利用
source: Unlimited AI Features | No Ads | All Features Forever
es: Funciones de IA ilimitadas | Sin anuncios | Todas las funciones para siempre
ja: AI機能無制限 | 広告なし | すべての機能を永久利用

# general_ジムマップ
source: Gym Map
es: Mapa del gimnasio
ja: ジムマップ

# workout_AI機能を月10回まで使用可能
source: • AI features can be used up to 10 times per month
es: • Las funciones de IA se pueden utilizar hasta 10 veces al mes
ja: • AI機能を月10回まで使用可能

# general_PO管理ページ
source: PO Management Page
es: Página de gestión de órdenes de compra
ja: PO管理ページ

# general_通報を受け付けましたご協力ありがとうございます
source: Your report has been received. Thank you for your cooperation.
es: Hemos recibido su informe. Gracias por su cooperación.
ja: 通報を受け付けました。ご協力ありがとうございます。

# profile_シェア
source: share
es: compartir
ja: シェア

# general_成長率
source: growth rate
es: índice de crecimiento
ja: 成長率

# workout_記録時のメモ
source: Recording notes
es: Notas de grabación
ja: 記録時のメモ

# general_フェーズ1_統計ベース
source: Phase 1: Statistics-based
es: Fase 1: Basada en estadísticas
ja: フェーズ1: 統計ベース

# general_市役所
source: City Hall
es: Ayuntamiento
ja: 市役所

# workout_前回データ読み込みエラー_e
source: ❌ Last data load error: $e
es: ❌ Último error de carga de datos: $e
ja: ❌ 前回データ読み込みエラー: $e

# profile_ジム情報更新
source: Gym information update
es: Actualización de la información del gimnasio
ja: ジム情報更新

# workout_データ_datakeystoList
source: Data: ${data.keys.toList()}
es: Datos: ${data.keys.toList()}
ja: データ: ${data.keys.toList()}

# profile_PRO限定
source: PRO only
es: Solo PRO
ja: PRO限定

# gym_お知らせ投稿
source: Announcement Post
es: Publicación de anuncio
ja: お知らせ投稿

# gym_お知らせの詳細を入力してください
source: Enter the details of your announcement
es: Ingresa los detalles de tu anuncio
ja: お知らせの詳細を入力してください

# gym_最新の料金プランや設備情報はジムの公式サイトでご確認ください
source: Please check the gym's official website for the latest pricing and facility information.
es: Consulte el sitio web oficial del gimnasio para obtener la información más reciente sobre precios e instalaciones.
ja: 最新の料金プランや設備情報は、ジムの公式サイトでご確認ください

# general_キャンペーンを保存しましたユーザーアプリに即反映されます
source: ✅ The campaign has been saved! It will be reflected in the user app immediately.
es: ¡La campaña se ha guardado! Se verá reflejada inmediatamente en la app del usuario.
ja: ✅ キャンペーンを保存しました！ユーザーアプリに即反映されます

# general_ℹ_テキスト検索が優先されるためGPS検索はスキップ
source: ℹ️ GPS search skipped in favor of text search
es: ℹ️ Se omitió la búsqueda de GPS en favor de la búsqueda de texto
ja: ℹ️ テキスト検索が優先されるため、GPS検索はスキップ

# subscription_サブスクリプション一時停止_durationMonths_ヶ月理由_reason
source: ✅ Subscription paused: $durationMonths months (reason: $reason)
es: ✅ Suscripción pausada: $durationMonths meses (razón: $reason)
ja: ✅ サブスクリプション一時停止: $durationMonths ヶ月（理由: $reason）

# workout_現在のセット数_setslength
source: 📊 Current set count: ${sets.length}
es: 📊 Cantidad de conjuntos actual: ${sets.length}
ja: 📊 現在のセット数: ${sets.length}

# workout_最後の状態
source: 📋 Last Status:
es: 📋 Último estado:
ja: 📋 最後の状態:

# workout_開始
source: start
es: comenzar
ja: 開始

# general_RevenueCatキャッシュ無効化完了
source: ✅ RevenueCat cache invalidation completed
es: ✅ Se completó la invalidación de caché de RevenueCat
ja: ✅ RevenueCatキャッシュ無効化完了

# profile_返金ポリシー
source: Refund Policy
es: Política de reembolso
ja: 返金ポリシー

# workout_GYMMATCH_筋トレ記録
source: #GYMMATCH #muscletrainingrecord
es: #GYMMATCH #récorddeentrenamientomuscular
ja: #GYMMATCH #筋トレ記録

# general_上級リフター
source: Advanced Lifter
es: Levantador avanzado
ja: 上級リフター

# subscription_こんな選択肢もあります
source: 💡 Here are some other options
es: 💡Aquí tienes otras opciones
ja: 💡 こんな選択肢もあります

# general_詳細な成長グラフ
source: Detailed growth graph
es: Gráfico de crecimiento detallado
ja: 詳細な成長グラフ

# personalFactor_動的要因_トレーニング前日当日に更新
source: • Dynamic factors: Updated the day before and the day of training
es: • Factores dinámicos: Actualizados el día anterior y el día del entrenamiento
ja: • 動的要因: トレーニング前日・当日に更新

# general_銭湯
source: public bath
es: baño público
ja: 銭湯

# workout_ユーザー体重を取得_weightkg
source: ✅ Get user weight: ${weight}kg
es: ✅ Obtener el peso del usuario: ${weight}kg
ja: ✅ ユーザー体重を取得: ${weight}kg
