Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# workout_style_TextStyle_fontSize_11_color_Colorsgreyshade6_5
source: , style: TextStyle( fontSize: 11, color: Colors.grey.shade600, fontStyle: FontStyle.italic, ), ), ), ], ), ], ), ), ); } /// dropdown field Widget _buildDropdownField({ required String label, required String value, required List<String> items, required ValueChanged<String?> onChanged, }) { return DropdownButtonFormField<String>( decoration: InputDecoration( labelText: label, border: const OutlineInputBorder(), ), value: value, items: items.map((item) { return DropdownMenuItem( value: item, child: Text(item), ); }).toList(), onChanged: onChanged, ); } /// slider field Widget _buildSliderField({ required String label, required double value, required double min, required double max, required int divisions, required ValueChanged<double> onChanged, required String displayValue, }) { return Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Row( mainAxisAlignment: MainAxisAlignment.spaceBetween, children: [ Text(label, style: const TextStyle(fontWeight: FontWeight.w500)), Text( displayValue, style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, color: Colors.purple.shade700, ), ), ], ), Slider( value: value, min: min, max: max, divisions: divisions, onChanged: onChanged, activeColor: Colors.purple.shade700, ), ], ); } /// Prediction execution button Widget _buildPredictButton() { return ElevatedButton.icon( onPressed: _isLoading ? null : () { FocusScope.of(context).unfocus(); _executePrediction(); }, icon: _isLoading ? const SizedBox( width: 20, height: 20, child: CircularProgressIndicator( strokeWidth: 2, valueColor: AlwaysStoppedAnimation<Color>(Colors.white), ), ) : Icon(Icons.auto_graph), label: Text(_isLoading ? AppLocalizations.of(context)!.aiAnalyzing : AppLocalizations.of(context)!.executeGrowthPrediction), style: ElevatedButton.styleFrom( padding: const EdgeInsets.symmetric(vertical: 16), backgroundColor: Colors.purple.shade700, foregroundColor: Colors.white, ), ); } /// Loading indicator Widget _buildLoadingIndicator() { return Center( child: Column( children: [ CircularProgressIndicator(), SizedBox(height: 16), Text(AppLocalizations.of(context)!.aiAnalyzingScientific), ], ), ); } /// Display prediction results Widget _buildPredictionResult() { // Check for null if (_predictionResult == null) { return Card( color: Colors.grey.shade100, child: Padding( padding: const EdgeInsets.all(16.0), child: Text(
es: , estilo: TextStyle( fontSize: 11, color: Colors.grey.shade600, fontStyle: FontStyle.italic, ), ), ), ], ), ], ), ); } /// Campo desplegable Widget _buildDropdownField({ String requerido: etiqueta, String requerido: valor, List<String> requerido: elementos, ValueChanged<String?> requerido: onChanged, }) { return DropdownButtonFormField<String>( decoration: InputDecoration( labelText: etiqueta, border: const OutlineInputBorder(), ), value: valor, items: items.map((item) { return DropdownMenuItem( value: elemento, child: Text(item), ); }).toList(), onChanged: onChanged, ); } /// Widget de campo deslizante _buildSliderField({ String requerido: etiqueta, double requerido: valor, double requerido: mínimo, double requerido: máximo, int requerido: divisiones, ValueChanged<double> requerido: onChanged, String requerido: valor de visualización, }) { return Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Row( mainAxisAlignment: MainAxisAlignment.spaceBetween, children: [ Text(label, style: const TextStyle(fontWeight: FontWeight.w500)), Text( displayValue, style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, color: Colors.purple.shade700, ), ), ], ), Slider( value: valor, min: min, max: max, divisiones: divisiones, onChanged: onChanged, activeColor: Colors.purple.shade700, ), ], ); } /// Botón de ejecución de predicción Widget _buildPredictButton() { return ElevatedButton.icon( onPressed: _isLoading ? null : () { FocusScope.of(context).unfocus(); _executePrediction(); }, icon: _isLoading ? const SizedBox( ancho: 20, alto: 20, child: CircularProgressIndicator( strokeWidth: 2, valueColor: AlwaysStoppedAnimation<Color>(Colors.white), ), ) : Icon(Icons.auto_graph), etiqueta: Text(_isLoading ? AppLocalizations.of(context)!.aiAnalyzing : AppLocalizations.of(context)!.executeGrowthPrediction), style: ElevatedButton.styleFrom( padding: const EdgeInsets.symmetric(vertical: 16), backgroundColor: Colors.purple.shade700, foregroundColor: Colors.white, ), ); } /// Indicador de carga Widget _buildLoadingIndicator() { return Center( child: Column( children: [ CircularProgressIndicator(), SizedBox(height: 16), Text(AppLocalizations.of(context)!.aiAnalyzingScientific), ], ), ); } /// Mostrar resultados de predicción Widget _buildPredictionResult() { // Comprobar valores nulos if (_predictionResult == null) { return Card( color: Colors.grey.shade100, child: Padding( padding: const EdgeInsets.all(16.0), child: Text(
ja: , style: TextStyle( fontSize: 11, color: Colors.grey.shade600, fontStyle: FontStyle.italic, ), ), ), ], ), ], ), ), ); } /// ドロップダウンフィールド Widget _buildDropdownField({ required String label, required String value, required List<String> items, required ValueChanged<String?> onChanged, }) { return DropdownButtonFormField<String>( decoration: InputDecoration( labelText: label, border: const OutlineInputBorder(), ), value: value, items: items.map((item) { return DropdownMenuItem( value: item, child: Text(item), ); }).toList(), onChanged: onChanged, ); } /// スライダーフィールド Widget _buildSliderField({ required String label, required double value, required double min, required double max, required int divisions, required ValueChanged<double> onChanged, required String displayValue, }) { return Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Row( mainAxisAlignment: MainAxisAlignment.spaceBetween, children: [ Text(label, style: const TextStyle(fontWeight: FontWeight.w500)), Text( displayValue, style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, color: Colors.purple.shade700, ), ), ], ), Slider( value: value, min: min, max: max, divisions: divisions, onChanged: onChanged, activeColor: Colors.purple.shade700, ), ], ); } /// 予測実行ボタン Widget _buildPredictButton() { return ElevatedButton.icon( onPressed: _isLoading ? null : () { FocusScope.of(context).unfocus(); _executePrediction(); }, icon: _isLoading ? const SizedBox( width: 20, height: 20, child: CircularProgressIndicator( strokeWidth: 2, valueColor: AlwaysStoppedAnimation<Color>(Colors.white), ), ) : Icon(Icons.auto_graph), label: Text(_isLoading ? AppLocalizations.of(context)!.aiAnalyzing : AppLocalizations.of(context)!.executeGrowthPrediction), style: ElevatedButton.styleFrom( padding: const EdgeInsets.symmetric(vertical: 16), backgroundColor: Colors.purple.shade700, foregroundColor: Colors.white, ), ); } /// ローディングインジケーター Widget _buildLoadingIndicator() { return Center( child: Column( children: [ CircularProgressIndicator(), SizedBox(height: 16), Text(AppLocalizations.of(context)!.aiAnalyzingScientific), ], ), ); } /// 予測結果表示 Widget _buildPredictionResult() { // nullチェック if (_predictionResult == null) { return Card( color: Colors.grey.shade100, child: Padding( padding: const EdgeInsets.all(16.0), child: Text(

# general_AI無料利用3回
source: Free AI use x 3 times
es: Uso gratuito de IA x 3 veces
ja: AI無料利用×3回

# workout_開始時_label
source: At start ($label)
es: Al inicio ($label)
ja: 開始時 ($label)

# general_広告動画を1回視聴するとAI機能を1回使えるクレジットを獲得できます
source: By watching an ad video once, you can earn credits that can be used once with AI features.
es: Al mirar un video publicitario una vez, puede ganar créditos que pueden usarse una vez con funciones de IA.
ja: 広告動画を1回視聴すると、AI機能を1回使えるクレジットを獲得できます

# error_オフ日の取得エラー_e
source: ❌ Error getting off days: $e
es: ❌ Error al salir de días: $e
ja: ❌ オフ日の取得エラー: $e

# general_友達申請を送信しました
source: Friend request sent
es: Solicitud de amistad enviada
ja: 友達申請を送信しました

# general_Apple審査対応のため開発者メニューからのプラン変更機能は削除されました
source: Due to Apple's review, the plan change function from the developer menu has been removed.
es: Debido a la revisión de Apple, se ha eliminado la función de cambio de plan del menú de desarrollador.
ja: Apple審査対応のため、開発者メニューからのプラン変更機能は削除されました。

# workout_体重取得_ユーザー未ログイン
source: ⚠️ Get weight: User not logged in
es: ⚠️ Obtener peso: Usuario no conectado
ja: ⚠️ 体重取得: ユーザー未ログイン

# workout_style_TextStylecolor_Colorsredshade700_final_resul_1
source: , style: TextStyle(color: Colors.red.shade700), ), ], ), ), ); } final result = _predictionResult!; / Check for required fields if (!result.containsKey(
es: , style: TextStyle(color: Colors.red.shade700), ), ], ), ), ); } resultado final = _predictionResult!; / Verificar campos obligatorios if (!result.containsKey(
ja: , style: TextStyle(color: Colors.red.shade700), ), ], ), ), ); } final result = _predictionResult!; // 必須フィールドチェック if (!result.containsKey(

# general_GPS位置情報を取得中
source: 🌍Getting GPS location...
es: 🌍Obteniendo ubicación GPS...
ja: 🌍 GPS位置情報を取得中...

# profile_紹介特典
source: 🎁 Referral Rewards
es: 🎁 Recompensas por recomendación
ja: 🎁 紹介特典

# error_リマインダーチェックエラー_e
source: ❌ Reminder check error: $e
es: ❌ Error de comprobación de recordatorio: $e
ja: ❌ リマインダーチェックエラー: $e

# general_exerciseName_weighttoInt_0kg_repstoInt_0回
source: • $exerciseName: ${weight?.toInt() ?? 0}kg × ${reps?.toInt() ?? 0} times
es: • $exerciseName: ${weight?.toInt() ?? 0}kg × ${reps?.toInt() ?? 0} veces
ja: • $exerciseName: ${weight?.toInt() ?? 0}kg × ${reps?.toInt() ?? 0}回

# general_exerciseName_weighttoInt_0kg_repstoInt_0秒
source: • $exerciseName: ${weight?.toInt() ?? 0}kg × ${reps?.toInt() ?? 0} seconds
es: • $exerciseName: ${weight?.toInt() ?? 0}kg × ${reps?.toInt() ?? 0} segundos
ja: • $exerciseName: ${weight?.toInt() ?? 0}kg × ${reps?.toInt() ?? 0}秒

# workout_請用繁體中文提供詳細說明
source: Details of request provided in Chinese
es: Detalles de la solicitud proporcionados en chino
ja: 請用繁體中文提供詳細說明

# general_トレーニング頻度を週1回増やす
source: Increase training frequency by +1 day per week
es: Aumentar la frecuencia de entrenamiento en +1 día por semana
ja: トレーニング頻度を週+1回増やす

# general_2_フェーズ2_フェーズ3
source: 2. Phase 2 → Phase 3
es: 2. Fase 2 → Fase 3
ja: 2. フェーズ2 → フェーズ3

# general_収益目標の達成確認
source: ✅ Confirm achievement of revenue goals
es: ✅ Confirmar el logro de los objetivos de ingresos.
ja: ✅ 収益目標の達成確認

# workout_priorityColor_Colorsorange_break_default_priorityC
source: : priorityColor = Colors.orange; break; default: priorityColor = Colors.blue; } return Padding( padding: const EdgeInsets.only(bottom: 12), child: Row( crossAxisAlignment: CrossAxisAlignment.start, children: [ Container( width: 6, height: 6, margin: const EdgeInsets.only(top: 6), decoration: BoxDecoration( color: priorityColor, shape: BoxShape.circle, ), ), const SizedBox(width: 12), Expanded( child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Text( category, style: TextStyle( fontSize: 12, color: Colors.grey.shade600, fontWeight: FontWeight.w500, ), ), const SizedBox(height: 4), Text( action, style: const TextStyle( fontSize: 14, height: 1.4, ), ), ], ), ), ], ), ); }), ], ), ), ); } // Show rewarded ad dialog Future<bool?> _showRewardAdDialog() async { return showDialog<bool>( context: context, barrierDismissible: false, builder: (context) => AlertDialog( title: Row( children: [ Icon(Icons.play_circle_outline, color: Colors.blue, size: 28), SizedBox(width: 12), Text(
es: : priorityColor = Colores.naranja; break; predeterminado: priorityColor = Colores.azul; } devolver Relleno( relleno: const EdgeInsets.only(inferior: 12), hijo: Fila( ejeCruzado: AlineaciónEjeCruzado.start, hijos: [ Contenedor( ancho: 6, alto: 6, margen: const EdgeInsets.only(superior: 6), decoración: DecoraciónDeCaja( color: colorDePrioridad, forma: FormaDeCaja.circle, ), ), const CajaDeTamaño(ancho: 12), Expandido( hijo: Columna( ejeCruzado: AlineaciónEjeCruzado.start, hijos: [ Texto( categoría, estilo: EstiloDeTexto( tamañoDeFuente: 12, color: Colores.gris.sombra600, pesoDeFuente: PesoDeFuente.w500, ), ), const CajaDeTamaño(alto: 4), Texto( acción, estilo: const TextStyle( fontSize: 14, height: 1.4, ), ), ], ), ), ], ), ); }), ], ), ), ); } // Mostrar el cuadro de diálogo del anuncio con recompensa Future<bool?> _showRewardAdDialog() async { return showDialog<bool>( context: context, barrierDismissible: false, builder: (context) => AlertDialog( title: Row( children: [ Icon(Icons.play_circle_outline, color: Colors.blue, size: 28), SizedBox(width: 12), Text(
ja: : priorityColor = Colors.orange; break; default: priorityColor = Colors.blue; } return Padding( padding: const EdgeInsets.only(bottom: 12), child: Row( crossAxisAlignment: CrossAxisAlignment.start, children: [ Container( width: 6, height: 6, margin: const EdgeInsets.only(top: 6), decoration: BoxDecoration( color: priorityColor, shape: BoxShape.circle, ), ), const SizedBox(width: 12), Expanded( child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Text( category, style: TextStyle( fontSize: 12, color: Colors.grey.shade600, fontWeight: FontWeight.w500, ), ), const SizedBox(height: 4), Text( action, style: const TextStyle( fontSize: 14, height: 1.4, ), ), ], ), ), ], ), ); }), ], ), ), ); } /// リワード広告ダイアログ表示 Future<bool?> _showRewardAdDialog() async { return showDialog<bool>( context: context, barrierDismissible: false, builder: (context) => AlertDialog( title: Row( children: [ Icon(Icons.play_circle_outline, color: Colors.blue, size: 28), SizedBox(width: 12), Text(

# general_簡単にワークアウトを記録管理
source: Easily record and manage your workouts
es: Graba y gestiona fácilmente tus entrenamientos
ja: 簡単にワークアウトを記録・管理

# general_友達の紹介コードを使っていただきありがとうございます
source: Thank you for using my friend's referral code!
es: ¡Gracias por utilizar el código de referencia de mi amigo!
ja: 友達の紹介コードを使っていただき、ありがとうございます！

# general_たった今
source: right now
es: ahora mismo
ja: たった今

# general_AI機能を5回追加
source: Added AI functions five times
es: Se agregaron funciones de IA cinco veces
ja: AI機能を5回追加

# general_既にアカウントをお持ちの方はこちら
source: If you already have an account, click here
es: Si ya tienes una cuenta, haz clic aquí
ja: 既にアカウントをお持ちの方はこちら

# general_AdMob初期化完了
source: ✅ AdMob initialization completed
es: ✅ Inicialización de AdMob completada
ja: ✅ AdMob初期化完了

# gym_月金_10001900_土_10001300
source: Mon-Fri 10:00-19:00, Sat 10:00-13:00
es: Lunes a viernes de 10:00 a 19:00, sábados de 10:00 a 13:00
ja: 月-金 10:00-19:00, 土 10:00-13:00

# general_メッセージを送信してみましょう
source: Let's send a message
es: Enviemos un mensaje
ja: メッセージを送信してみましょう

# workout_30日間無料トライアル
source: • 30-day free trial
es: • Prueba gratuita de 30 días
ja: • 30日間無料トライアル

# profile_ℹ_画像選択がキャンセルされました
source: ℹ️ Image selection canceled
es: ℹ️ Selección de imágenes cancelada
ja: ℹ️ 画像選択がキャンセルされました

# workout_動画広告を視聴するとAI機能を1回使用できます
source: • Watching a video ad will grant you access to the AI feature once.
es: • Ver un anuncio de video te dará acceso a la función de IA una vez.
ja: • 動画広告を視聴すると、AI機能を1回使用できます

# workout_日付_dateyear年datemonth月dateday日
source: Date: ${date.year}, ${date.month}, ${date.day}
es: Fecha: ${date.year}, ${date.month}, ${date.day}
ja: 日付: ${date.year}年${date.month}月${date.day}日

# workout_エリプティカル
source: elliptical
es: elíptico
ja: エリプティカル

# subscription_トライアル進捗
source: Trial Progress
es: Progreso del ensayo
ja: トライアル進捗

# general_リワード広告初期化完了
source: ✅ Reward ads initialization completed
es: ✅ Inicialización de anuncios de recompensa completada
ja: ✅ リワード広告初期化完了

# workout_1RM1回だけ挙上できる最大重量
source: • 1RM: The maximum weight you can lift once.
es: • 1RM: El peso máximo que puedes levantar una vez.
ja: • 1RM：1回だけ挙上できる最大重量

# gym_東京都港区赤坂131313
source: 13-13-13 Akasaka, Minato-ku, Tokyo
es: 13-13-13 Akasaka, Minato-ku, Tokio
ja: 東京都港区赤坂13-13-13

# general_神奈川
source: Kanagawa
ja: 神奈川

# general_β版テスト運用中
source: Beta version currently in test operation
es: Versión beta actualmente en operación de prueba
ja: β版テスト運用中

# general_PO管理ダッシュボード
source: PO Management Dashboard
es: Panel de gestión de órdenes de compra
ja: PO管理ダッシュボード

# general_Phase_2a2b2c統合実装_Foster_2001_Murray_2016_Windt_Gab
source: Phase 2a+2b+2c Integrated Implementation Foster (2001), Murray (2016), Windt & Gabbett (2017)
es: Implementación integrada de las fases 2a+2b+2c Foster (2001), Murray (2016), Windt y Gabbett (2017)
ja: Phase 2a+2b+2c統合実装 Foster (2001), Murray (2016), Windt & Gabbett (2017)

# general_非常に高強度のトレーニングでした_今日は完全休養を推奨します睡眠栄養ストレッチを重視してください
source: This was very intense training. I recommend complete rest today. Please focus on sleep, nutrition, and stretching.
es: Este entrenamiento fue muy intenso. Te recomiendo que hoy descanses por completo. Céntrate en dormir, comer bien y estirar.
ja: 非常に高強度のトレーニングでした。 今日は完全休養を推奨します。睡眠・栄養・ストレッチを重視してください。

# profile_featureNameは現在開発中です_次回のアップデートでご利用いただけます
source: $featureName is currently in development. Will be available in the next update.
es: $featureName está actualmente en desarrollo. Estará disponible en la próxima actualización.
ja: $featureNameは現在開発中です。 次回のアップデートでご利用いただけます。

# workout_メニュー生成エラー_e
source: ❌ Menu generation error: $e
es: ❌ Error de generación de menú: $e
ja: ❌ メニュー生成エラー: $e

# workout_推奨曜日_recsuggestedDaysjoin
source: Suggested days: ${rec.suggestedDays.join(
es: Días sugeridos: ${rec.suggestedDays.join(
ja: 推奨曜日: ${rec.suggestedDays.join(

# general_トレーニングリマインダー設定_muscleGroup_48時間後
source: ✅ Training reminder setting: $muscleGroup (48 hours later)
es: ✅ Configuración de recordatorio de entrenamiento: $muscleGroup (48 horas después)
ja: ✅ トレーニングリマインダー設定: $muscleGroup (48時間後)

# general_recoveryHours時間_1
source: $recoveryHours hours
es: $recoveryHours horas
ja: $recoveryHours時間

# profile_友達がこのコードを入力すると両方に特典が届きます
source: 💡 When your friend enters this code, you both will receive a reward!
es: 💡 ¡Cuando tu amigo ingrese este código, ambos recibirán una recompensa!
ja: 💡 友達がこのコードを入力すると、両方に特典が届きます！

# subscription_トライアル期限切れ_無料プランに戻しました
source: ⏰ Trial expired - reverted to free plan
es: ⏰ La prueba expiró: volví al plan gratuito
ja: ⏰ トライアル期限切れ - 無料プランに戻しました

# general_フィルタリング開始_選択日_selectedDayyear_selectedDaymonth_sel
source: 🔍 Start filtering: Selected date = ${_selectedDay!.year}/${_selectedDay!.month}/${_selectedDay!.day}
es: 🔍 Iniciar filtrado: Fecha seleccionada = ${_selectedDay!.year}/${_selectedDay!.month}/${_selectedDay!.day}
ja: 🔍 フィルタリング開始: 選択日=${_selectedDay!.year}/${_selectedDay!.month}/${_selectedDay!.day}

# workout_IMPORT_日付パース_date
source: ✅ [IMPORT] Date parsing: $date
es: ✅ [IMPORTACIÓN] Análisis de fecha: $date
ja: ✅ [IMPORT] 日付パース: $date

# general_条件に一致するパートナーが見つかりませんでした
source: No matching partners found
es: No se encontraron socios coincidentes
ja: 条件に一致するパートナーが見つかりませんでした

# general_AEL偏心負荷強調
source: AEL (eccentric load emphasis)
es: AEL (énfasis en carga excéntrica)
ja: AEL（偏心負荷強調）

# general_回トレーニングすること_例月曜水曜金曜にbodyPart_のトレーニングを実施週3回_以下の形式で簡
source: ]} times Example: Train $bodyPart on Mondays, Wednesdays, and Fridays (3 times a week) Please answer briefly in the following format (300 characters or less): ## Evaluation of Training Effectiveness (Scientific evaluation of your current program) ## Top Priority Area for Improvement (One most effective improvement) ## Specific Action Plan (Three actions you can take starting this week)
es: ]} veces Ejemplo: Entrena $bodyPart los lunes, miércoles y viernes (3 veces por semana) Responde brevemente en el siguiente formato (300 caracteres o menos): ## Evaluación de la eficacia del entrenamiento (Evaluación científica de tu programa actual) ## Área prioritaria de mejora (Una mejora más efectiva) ## Plan de acción específico (Tres acciones que puedes llevar a cabo a partir de esta semana)
ja: ]}回トレーニングすること 例：月曜・水曜・金曜に$bodyPart のトレーニングを実施（週3回） 以下の形式で簡潔に回答してください（300文字以内）： ## トレーニング効果の評価 （現在のプログラムの科学的評価） ## 最優先改善ポイント （最も効果的な改善策を1つ） ## 具体的アクションプラン （今週から実行できる3つのアクション）

# general_伝説の混雑レポーター
source: 👑 Legendary crowd reporter!
es: 👑¡Reportero de multitudes legendario!
ja: 👑 伝説の混雑レポーター！

# general_現在のバージョン_currentVersion_Build_currentBuildNumber
source: 📱 Current version: $currentVersion (Build: $currentBuildNumber)
es: 📱 Versión actual: $currentVersion (Compilación: $currentBuildNumber)
ja: 📱 現在のバージョン: $currentVersion (Build: $currentBuildNumber)

# error_認証に失敗しました
source: Authentication failed
es: Falló la autenticación
ja: 認証に失敗しました

# personalFactor_個人要因設定
source: 🔬 Personal Factor Settings
es: 🔬 Configuración de factores personales
ja: 🔬 個人要因設定

# general_会員リストの表示と管理
source: View and manage your membership list
es: Ver y administrar su lista de miembros
ja: 会員リストの表示と管理

# workout_休憩終了
source: Break's over!
es: ¡Se acabaron las vacaciones!
ja: 休憩終了！

# workout_前回ボタンタップ_exerciseName
source: 🔘 Last button tap: $exerciseName
es: 🔘 Último botón pulsado: $exerciseName
ja: 🔘 前回ボタンタップ: $exerciseName

# general_exerciseNameの記録を削除しますか_この操作は取り消せません
source: Do you want to delete the recording of "$exerciseName"? This action cannot be undone.
es: ¿Quieres eliminar la grabación de "$exerciseName"? Esta acción no se puede deshacer.
ja: 「$exerciseName」の記録を削除しますか？ この操作は取り消せません。

# workout_週間統計最終結果
source: 📊 === Final weekly statistics ===
es: 📊 === Estadísticas semanales finales ===
ja: 📊 === 週間統計最終結果 ===

# general_会員管理画面は次のフェーズで実装予定
source: Membership management screen will be implemented in the next phase
es: La pantalla de gestión de membresía se implementará en la siguiente fase
ja: 会員管理画面は次のフェーズで実装予定

# general_ユーザー_userId_のスケジュール分析完了_schedulekeyslengthジム
source: ✅ Schedule analysis completed for user $userId: ${schedule.keys.length}Gym
es: ✅ Análisis de horario completado para el usuario $userId: ${schedule.keys.length}Gimnasio
ja: ✅ ユーザー $userId のスケジュール分析完了: ${schedule.keys.length}ジム

# general_不要
source: Unnecessary
es: Innecesario
ja: 不要

# profile_個人情報の取扱い
source: Handling of personal information
es: Manejo de información personal
ja: 個人情報の取扱い

# general_トレーニング負荷が低すぎます_徐々に負荷を上げることでパフォーマンス向上が期待できます
source: Your training load is too low. Your performance can be improved by gradually increasing the load.
es: Tu carga de entrenamiento es demasiado baja. Puedes mejorar tu rendimiento aumentando la carga gradualmente.
ja: トレーニング負荷が低すぎます。 徐々に負荷を上げることでパフォーマンス向上が期待できます。

# gym_10文字以上入力してください
source: Please enter at least 10 characters
es: Por favor, introduzca al menos 10 caracteres
ja: 10文字以上入力してください

# general_人気ジムのみAPI使用で品質向上
source: Improve quality by using API only for popular gyms
es: Mejora la calidad utilizando API solo para gimnasios populares
ja: 人気ジムのみAPI使用で品質向上

# workout_タップしてトレーニングの感想や気づきを記録
source: Tap to record your thoughts and impressions on training
es: Toca para registrar tus pensamientos e impresiones sobre el entrenamiento.
ja: タップしてトレーニングの感想や気づきを記録

# general_クラスターセット
source: Cluster Set
es: Conjunto de clústeres
ja: クラスターセット

# subscription_復元に失敗しました_etoString
source: Restore failed: ${e.toString()}
es: Error de restauración: ${e.toString()}
ja: 復元に失敗しました: ${e.toString()}

# general_適切な栄養摂取タンパク質1622gkg日
source: * Adequate nutritional intake (protein 1.6-2.2g/kg/day)
es: * Ingesta nutricional adecuada (proteínas 1,6-2,2 g/kg/día)
ja: * 適切な栄養摂取（タンパク質1.6-2.2g/kg/日）

# general_ダッシュボードデータ読み込み完了
source: ✅ Dashboard data loading completed
es: ✅ Se completó la carga de datos del panel
ja: ✅ ダッシュボードデータ読み込み完了

# profile_Pro限定機能
source: Pro-only features
es: Funciones exclusivas para profesionales
ja: Pro限定機能

# workout_setslengthセット
source: ]} (${sets.length} sets)
es: ]} (${sets.length} conjuntos)
ja: ]} (${sets.length}セット)

# general_鳥取
source: Tottori
es: totori
ja: 鳥取

# workout_自動閉じスキップ既に閉じられています
source: ⚠️ Skip auto-close (already closed)
es: ⚠️ Omitir cierre automático (ya cerrado)
ja: ⚠️ 自動閉じスキップ（既に閉じられています）

# workout_プッシュ系種目を集中的に鍛えるテンプレート
source: A template for focusing on push exercises
es: Una plantilla para centrarse en los ejercicios de empuje
ja: プッシュ系種目を集中的に鍛えるテンプレート
