Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# general_パートナージム_partnerCount件
source: 🏆 Partner Gyms: ${partnerCount}
es: Gimnasios asociados: ${partnerCount}
ja: 🏆 パートナージム: ${partnerCount}件

# general_exerciseNameを削除しました残りtotalRemainingExercises種目
source: "$exerciseName" has been deleted (${totalRemainingExercises} remaining)
es: "$exerciseName" se ha eliminado (quedan {totalRemainingExercises})
ja: 「$exerciseName」を削除しました（残り${totalRemainingExercises}種目）

# general_AIクレジットFirestore保存_newTotal
source: ✅ AI credit Firestore save: $newTotal
es: ✅ Ahorro de Firestore con crédito de IA: $newTotal
ja: ✅ AIクレジットFirestore保存: $newTotal

# gym_了解
source: roger that
es: entendido
ja: 了解

# general_トレーナーが記録したトレーニング履歴
source: Training history recorded by trainers
es: Historial de entrenamiento registrado por los entrenadores
ja: トレーナーが記録したトレーニング履歴

# exercise_リバースグリッププレスダウン
source: Reverse Grip Press Down
es: Presione hacia abajo con agarre inverso
ja: リバースグリッププレスダウン

# general_ロイヤル
source: Royal
es: Real
ja: ロイヤル

# general_休眠会員
source: Dormant members
es: Miembros inactivos
ja: 休眠会員

# subscription_必要な機能がない
source: Missing required features
es: Faltan funciones requeridas
ja: 必要な機能がない

# workout_セットを追加
source: Add Set
es: Agregar conjunto
ja: セットを追加

# general_友達申請が見つかりません
source: Friend request not found
es: Solicitud de amistad no encontrada
ja: 友達申請が見つかりません

# exercise_ケーブルプレスダウン
source: Cable Press Down
es: Prensa de cable hacia abajo
ja: ケーブルプレスダウン

# general_aiBonus回
source: ×$aiBonus times
es: ×$aiVeces de bonificación
ja: ×$aiBonus回

# workout_ワンハンドダンベルロウ
source: One-handed dumbbell row
es: Remo con mancuernas a una mano
ja: ワンハンドダンベルロウ

# general_継続
source: continuation
es: continuación
ja: 継続

# general_ドメイン_errordomain
source: Domain: ${error.domain}
es: Dominio: ${error.domain}
ja: ドメイン: ${error.domain}

# profile_好きな種目
source: Favorite sport
es: Deporte favorito
ja: 好きな種目

# workout_休憩_23分
source: - Break: 2-3 minutes
es: - Descanso: 2-3 minutos
ja: - 休憩: 2-3分

# general_体脂肪率_bodyFattoStringAsFixed1
source: Body fat percentage: ${bodyFat.toStringAsFixed(1)}%
es: Porcentaje de grasa corporal: ${bodyFat.toStringAsFixed(1)}%
ja: 体脂肪率: ${bodyFat.toStringAsFixed(1)}%

# workout_全ドキュメント数_snapshotdocslength
source: 📊 Total number of documents: ${snapshot.docs.length}
es: 📊 Número total de documentos: ${snapshot.docs.length}
ja: 📊 全ドキュメント数: ${snapshot.docs.length}

# gym_入会金50OFF初月無料
source: 50% off registration fee and first month free
es: 50% de descuento en la tarifa de inscripción y primer mes gratis
ja: 入会金50%OFF・初月無料

# gym_ライザップ_表参道店
source: Rizap Omotesando store
es: Tienda Rizap Omotesando
ja: ライザップ 表参道店

# workout_RM_Repetition_Maximum_計算
source: RM (Repetition Maximum) calculation
es: Cálculo de RM (Máximo de Repetición)
ja: RM (Repetition Maximum) 計算

# general_高い代謝ストレス誘発
source: Induces high metabolic stress
es: Induce un alto estrés metabólico
ja: 高い代謝ストレス誘発

# general_プラトー対策
source: Countermeasures for plateau
es: Contramedidas para la meseta
ja: プラトー対策

# subscription_AI機能_月10回
source: 🤖 AI function 10 times a month
es: Función de IA 10 veces al mes
ja: 🤖 AI機能 月10回

# general_ℹ_ユーザー_userId_1RM更新スキップ記録なし
source: ℹ️ User $userId: Skip 1RM update (no record)
es: ℹ️ Usuario $userId: Omitir actualización de 1RM (sin registro)
ja: ℹ️ ユーザー $userId: 1RM更新スキップ（記録なし）

# general_ユーザー_userId_の平均1RM更新_average1RMtoStringAsFixed1kg
source: ✅ Average 1RM for user $userId updated: ${average1RM.toStringAsFixed(1)}kg
es: ✅ Promedio de 1RM para el usuario $userId actualizado: ${average1RM.toStringAsFixed(1)}kg
ja: ✅ ユーザー $userId の平均1RM更新: ${average1RM.toStringAsFixed(1)}kg

# profile_ファイルサイズが大きすぎます5MB以下
source: ❌ File size is too large (less than 5MB)
es: ❌ El tamaño del archivo es demasiado grande (menos de 5 MB)
ja: ❌ ファイルサイズが大きすぎます（5MB以下）

# gym_イベント
source: event
es: evento
ja: イベント

# general_Google_Gemini_20_が_あなたに最適なメニューを自動生成
source: Google Gemini 2.0 automatically generates the best menu for you
es: Google Gemini 2.0 genera automáticamente el mejor menú para ti
ja: Google Gemini 2.0 が あなたに最適なメニューを自動生成

# general_クリーンアップ不要
source: ✅ No cleanup required
es: ✅ No requiere limpieza
ja: ✅ クリーンアップ不要

# general_imageslength枚の画像をアップロードしました
source: ✅ ${images.length} images uploaded!
es: ✅ ¡${images.length} imágenes cargadas!
ja: ✅ ${images.length}枚の画像をアップロードしました！

# general_匿名アカウントをメールアカウントにリンク成功
source: ✅ Successfully linked anonymous account to email account
es: ✅ Se vinculó exitosamente la cuenta anónima a la cuenta de correo electrónico
ja: ✅ 匿名アカウントをメールアカウントにリンク成功

# general_entrykey_kg_プレート
source: ${entry.key} kg plate
es: Plato de ${entry.key} kg
ja: ${entry.key} kg プレート

# general_開発者専用
source: ⚠️ For developers only
es: ⚠️ Solo para desarrolladores
ja: ⚠️ 開発者専用

# error_訪問履歴削除失敗_e
source: ❌ Failed to delete visit history: $e
es: ❌ No se pudo eliminar el historial de visitas: $e
ja: ❌ 訪問履歴削除失敗: $e

# error_canEarnCreditFromAd_エラー_e
source: ❌ [canEarnCreditFromAd] Error: $e
ja: ❌ [canEarnCreditFromAd] エラー: $e

# general_全マイルストーン達成
source: All milestones achieved!
es: ¡Todos los hitos alcanzados!
ja: 全マイルストーン達成！

# gym_上野エリア最大級の24時間フィットネスジム
source: One of the largest 24-hour fitness gyms in the Ueno area.
es: Uno de los gimnasios de fitness más grandes abiertos las 24 horas en el área de Ueno.
ja: 上野エリア最大級の24時間フィットネスジム。

# subscription_トライアル期限切れチェックエラー_e
source: ❌ Trial Expiry Check Error: $e
es: ❌ Error de verificación de vencimiento de prueba: $e
ja: ❌ トライアル期限切れチェックエラー: $e

# general_アップロード完了_bannerUrl
source: ✅ Uploaded: $bannerUrl
es: ✅ Cargado: $bannerUrl
ja: ✅ アップロード完了: $bannerUrl

# subscription_14日間無料トライアル
source: 14-day free trial
es: Prueba gratuita de 14 días
ja: 14日間無料トライアル

# workout_トレーニング履歴読み込み完了_exerciseDatalength種目
source: ✅ Training history loaded: ${exerciseData.length} exercises
es: ✅ Historial de entrenamiento cargado: ${exerciseData.length} ejercicios
ja: ✅ トレーニング履歴読み込み完了: ${exerciseData.length}種目

# general_ゲスト
source: guest
es: invitado
ja: ゲスト

# workout_style_TextStyle_fontSize_16_fontWeight_FontWeightb
source: , style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, ), ), const SizedBox(height: 16), / 🆕 Phase 7: Age display (automatic acquisition) _buildAutoLoadedDataDisplay(), const SizedBox(height: 16), / Target body part _buildDropdownField( label:
es: , style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, ), ), const SizedBox(height: 16), / 🆕 Fase 7: Visualización de la edad (adquisición automática) _buildAutoLoadedDataDisplay(), const SizedBox(height: 16), / Parte del cuerpo objetivo _buildDropdownField( label:
ja: , style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, ), ), const SizedBox(height: 16), // 🆕 Phase 7: 年齢表示（自動取得） _buildAutoLoadedDataDisplay(), const SizedBox(height: 16), // 対象部位 _buildDropdownField( label:

# profile_アプリを再起動して変更を反映します
source: Restart the app for the changes to take effect.
es: Reinicie la aplicación para que los cambios surtan efecto.
ja: アプリを再起動して変更を反映します。

# general_リワード広告初期化開始
source: 🎬 Rewarded ads initialization starting...
es: 🎬 Inicialización de anuncios recompensados comenzando...
ja: 🎬 リワード広告初期化開始...

# profile_トレーニング記録の管理保存
source: • Manage and store training records
es: • Gestionar y almacenar registros de formación.
ja: • トレーニング記録の管理・保存

# subscription_年額_お得
source: Annual (💥Great Value)
es: Anual (💥Gran Valor)
ja: 年額 (💥お得)

# workout_reportstreak日
source: ${report.streak} days
es: ${report.streak} días
ja: ${report.streak}日

# general_メッセージ送信成功
source: ✅ Message sent successfully
es: ✅ Mensaje enviado exitosamente
ja: ✅ メッセージ送信成功

# general_プログラムのミスマッチ遺伝的限界ではない
source: Program mismatch (not genetic limitations)
es: Desajuste de programas (no limitaciones genéticas)
ja: プログラムのミスマッチ（遺伝的限界ではない）

# error_監視停止エラー_e
source: ❌ Monitor stop error: $e
es: ❌ Error de detención del monitor: $e
ja: ❌ 監視停止エラー: $e

# workout_週次レポートはまだありません
source: There are no weekly reports yet
es: Aún no hay informes semanales
ja: 週次レポートはまだありません

# general_この申請を拒否する権限がありません
source: You do not have the authority to reject this request
es: No tienes la autoridad para rechazar esta solicitud.
ja: この申請を拒否する権限がありません

# general_和歌山
source: Wakayama
ja: 和歌山

# general_紹介コード適用成功
source: 🎉 Referral code applied successfully!
es: 🎉 ¡Código de referencia aplicado exitosamente!
ja: 🎉 紹介コード適用成功！

# gym_gymrating_gymreviewCount件
source: ${gym.rating} (${gym.reviewCount})
ja: ${gym.rating} (${gym.reviewCount}件)

# workout_回数_812回
source: - Number of repetitions: 8-12
es: - Número de repeticiones: 8-12
ja: - 回数: 8-12回

# error_AI追加パック購入エラー_ecode_emessage
source: ❌ AI Add-on Pack Purchase Error: ${e.code} - ${e.message}
es: ❌ Error de compra del paquete complementario de IA: ${e.code} - ${e.message}
ja: ❌ AI追加パック購入エラー: ${e.code} - ${e.message}

# error_購入エラー_ecode_emessage
source: ❌ Purchase Error: ${e.code} - ${e.message}
es: ❌ Error de compra: ${e.code} - ${e.message}
ja: ❌ 購入エラー: ${e.code} - ${e.message}

# general_AIクレジット_credits回
source: AI credits: $credits
es: Créditos de IA: $créditos
ja: AIクレジット: $credits回

# gym_スポーツクラブNAS_世田谷
source: Sports Club NAS Setagaya
es: Club deportivo NAS Setagaya
ja: スポーツクラブNAS 世田谷

# error_予期しない購入エラー_e
source: ❌ Unexpected purchase error: $e
es: ❌ Error de compra inesperado: $e
ja: ❌ 予期しない購入エラー: $e

# general_宮崎
source: Miyazaki
ja: 宮崎

# workout_한국어로_자세한_설명을_제공하세요
source: I want to know what I'm saying
es: Quiero saber lo que estoy diciendo
ja: 한국어로 자세한 설명을 제공하세요

# general_オフ日_restDayslength日
source: ✅ Days off: ${restDays.length} days
es: ✅ Días libres: ${restDays.length} días
ja: ✅ オフ日: ${restDays.length}日

# personalFactor_変更頻度_高日々更新推奨
source: Change frequency: High (daily updates recommended)
es: Frecuencia de cambio: Alta (se recomiendan actualizaciones diarias)
ja: 変更頻度: 高（日々更新推奨）

# subscription_トライアル条件達成プレミアム7日間無料
source: 🎉 Trial conditions met! Premium free for 7 days
es: ¡Condiciones de prueba cumplidas! Premium gratis durante 7 días.
ja: 🎉 トライアル条件達成！プレミアム7日間無料

# general_バッジ獲得
source: 🎖️ Badge earned!
es: ¡Insignia ganada!
ja: 🎖️ バッジ獲得！

# general_前回_lastWeight分_lastRepskm
source: Last time: ${lastWeight}min × ${lastReps}km
es: Última vez: ${lastWeight}min × ${lastReps}km
ja: 前回: ${lastWeight}分 × ${lastReps}km

# subscription_変更理由
source: Reason for change
es: Motivo del cambio
ja: 変更理由

# general_胸を大きく開くイメージで
source: Imagine opening your chest wide
es: Imagina abrir bien el pecho
ja: 胸を大きく開くイメージで

# bodyPart_例_胸を集中的に鍛えるメニュー
source: Example: Chest-focused workout
es: Ejemplo: Entrenamiento centrado en el pecho
ja: 例: 胸を集中的に鍛えるメニュー

# general_differenceinMinutes分前
source: ${difference.inMinutes} minutes ago
es: Hace ${difference.inMinutes} minutos
ja: ${difference.inMinutes}分前

# workout_メモ保存完了_noteId_workout_session_workoutDocid
source: ✅ Memo saved: $noteId -> workout_session: ${workoutDoc.id}
es: ✅ Nota guardada: $noteId -> workout_session: ${workoutDoc.id}
ja: ✅ メモ保存完了: $noteId -> workout_session: ${workoutDoc.id}

# general_ユーザー情報が見つかりません
source: User information not found
es: No se encontró información del usuario
ja: ユーザー情報が見つかりません

# general_精度_positionaccuracym
source: Accuracy: ${position.accuracy}m
es: Precisión: ${position.accuracy}m
ja: 精度: ${position.accuracy}m

# general_月が変わると追加購入分もリセットされます
source: • Additional purchases will be reset when the month changes.
es: • Las compras adicionales se restablecerán cuando cambie el mes.
ja: • 月が変わると追加購入分もリセットされます

# general_フィットネスソーシャルマップ
source: Fitness Social Map
es: Mapa social de fitness
ja: フィットネスソーシャルマップ

# general_週weeklyGrowthtoStringAsFixed1成長ペースが遅め
source: Week + ${weeklyGrowth.toStringAsFixed(1)}%: Slower growth
es: Semana + ${weeklyGrowth.toStringAsFixed(1)}%: Crecimiento más lento
ja: 週+${weeklyGrowth.toStringAsFixed(1)}%：成長ペースが遅め

# error_ジム監視停止エラー_e
source: ❌ Gym monitoring stopped error: $e
es: ❌ Error al detener el monitoreo del gimnasio: $e
ja: ❌ ジム監視停止エラー: $e

# general_トライアル期限チェック
source: 🎁 Check trial expiration date...
es: 🎁Comprueba la fecha de caducidad del periodo de prueba...
ja: 🎁 トライアル期限チェック...

# general_フェーズ3_フルAPI
source: Phase 3: Full API
es: Fase 3: API completa
ja: フェーズ3: フルAPI

# general_オンボーディングをリセット
source: Reset Onboarding
es: Restablecer la incorporación
ja: オンボーディングをリセット

# general_高知
source: Kochi
es: Cochín
ja: 高知

# subscription_AI追加パック残回数なし
source: ❌ No remaining AI add-on packs
es: ❌ No quedan paquetes adicionales de IA
ja: ❌ AI追加パック残回数なし

# general_設備情報を更新しました
source: ✅ Facility information has been updated!
es: ✅ ¡Se ha actualizado la información de las instalaciones!
ja: ✅ 設備情報を更新しました！

# general_山梨
source: Yamanashi
ja: 山梨

# general_予約状況
source: Reservation status
es: Estado de la reserva
ja: 予約状況

# general_特徴
source: Features:
es: Características:
ja: 特徴:

# general_この調子で続ければ長期的な習慣になります
source: If you keep it up, it will become a long-term habit.
es: Si continúas así, se convertirá en un hábito a largo plazo.
ja: この調子で続ければ、長期的な習慣になります

# profile_CSVから取り込み
source: 📄 Import from CSV
es: 📄 Importar desde CSV
ja: 📄 CSVから取り込み

# general_業界最高レベルの精度
source: ✅ Industry-leading accuracy
es: ✅ Precisión líder en la industria
ja: ✅ 業界最高レベルの精度

# workout_重さ_kg
source: Weight (kg)
es: Peso (kg)
ja: 重さ (kg)

# workout_メニューを保存
source: 💾 Save Menu
es: 💾 Guardar menú
ja: 💾 メニューを保存

# workout_回数_58回
source: - Number of repetitions: 5-8
es: - Número de repeticiones: 5-8
ja: - 回数: 5-8回

# general_AI追加パックを購入しますか
source: Would you like to purchase the AI add-on pack?
es: ¿Te gustaría comprar el paquete complementario de IA?
ja: AI追加パックを購入しますか？

# profile_ジム検索位置情報表示
source: • Gym search and location information display
es: • Búsqueda de gimnasios y visualización de información de ubicación.
ja: • ジム検索・位置情報表示

# general_考えられる原因
source: Possible causes:
es: Posibles causas:
ja: 考えられる原因:

# general_AI追加パック1個5回分300相当
source: AI additional pack x 1 (5 times, worth ¥300)
es: Paquete adicional de IA x 1 (5 veces, valor ¥300)
ja: AI追加パック×1個（5回分、¥300相当）

# workout_Phase_7_体重取得で例外発生_e
source: ❌ [Phase 7] Exception occurred while getting weight: $e
es: ❌ [Fase 7] Se produjo una excepción al obtener el peso: $e
ja: ❌ [Phase 7] 体重取得で例外発生: $e

# general_PO権限確認完了
source: ✅ PO authorization confirmation completed
es: ✅ Confirmación de autorización de orden de compra completada
ja: ✅ PO権限確認完了

# workout_警告_パースされた種目が0件ですメニューの形式を確認してください
source: ⚠️ WARNING: 0 events parsed. Please check the menu format.
es: ⚠️ ADVERTENCIA: No se han analizado eventos. Por favor, revise el formato del menú.
ja: ⚠️ 警告: パースされた種目が0件です。メニューの形式を確認してください。

# gym_例_レッグプレス
source: Example: Leg Press
es: Ejemplo: Prensa de piernas
ja: 例: レッグプレス

# general_Phase_2c_ACWR分析
source: Phase 2c: ACWR analysis
es: Fase 2c: Análisis del ACWR
ja: Phase 2c: ACWR分析

# general_この商品は現在利用できません
source: This product is currently unavailable.
es: Este producto no está disponible actualmente.
ja: この商品は現在利用できません。

# workout_月間フィルタ後_filteredDocslength件
source: 📊 After monthly filter: ${filteredDocs.length}
es: 📊 Después del filtro mensual: ${filteredDocs.length}
ja: 📊 月間フィルタ後: ${filteredDocs.length}件

# workout_1_種目名
source: 1) Event name
es: 1) Nombre del evento
ja: 1) 種目名

# subscription_期限切れremaininginDaysabs日前に終了
source: ❌ Expired (Ends in ${remaining.inDays.abs()} days)
es: ❌ Vencido (Termina en ${remaining.inDays.abs()} días)
ja: ❌ 期限切れ（${remaining.inDays.abs()}日前に終了）

# workout_reps回
source: ${reps} times
es: ${reps} veces
ja: ${reps}回

# error_ATTリクエストエラー_e
source: ❌ ATT request error: $e
es: ❌ Error de solicitud de ATT: $e
ja: ❌ ATTリクエストエラー: $e

# general_理解しました
source: understood
es: comprendido
ja: 理解しました

# workout_ワークアウトを記録すると部位別の統計が表示されます
source: Record your workout and see your stats by body part
es: Registra tu entrenamiento y mira tus estadísticas por parte del cuerpo.
ja: ワークアウトを記録すると、部位別の統計が表示されます

# error_お気に入り削除エラー_e
source: ❌ Favorite removal error: $e
es: ❌ Error al eliminar favoritos: $e
ja: ❌ お気に入り削除エラー: $e

# subscription_広告が表示されます
source: Ads are displayed
es: Se muestran anuncios
ja: 広告が表示されます

# workout_ネットワーク状態確認中
source: 🔍 Checking network status...
es: 🔍Comprobando el estado de la red...
ja: 🔍 ネットワーク状態確認中...

# error_アラート送信可能チェックエラー_e
source: ❌ Alert sending check error: $e
es: ❌ Error de comprobación de envío de alerta: $e
ja: ❌ アラート送信可能チェックエラー: $e

# profile_目標達成通知
source: Goal achievement notification
es: Notificación de logro de objetivos
ja: 目標達成通知

# profile_ソーシャル
source: Social
ja: ソーシャル

# subscription_再開エラー_e
source: ❌ Resume Error: $e
es: ❌ Error de currículum: $e
ja: ❌ 再開エラー: $e

# general_100回の報告達成神です
source: 100 reports achieved! God!
es: ¡100 informes conseguidos! ¡Dios mío!
ja: 100回の報告達成！神です！

# general_学校
source: school
es: escuela
ja: 学校

# general_新しいバージョンが利用可能です_アップデートをお願いします
source: A new version is available. Please update.
es: Hay una nueva versión disponible. Por favor, actualízala.
ja: 新しいバージョンが利用可能です。 アップデートをお願いします。

# general_新規ジムはデータ不足
source: ⚠️ New gyms lack data
es: ⚠️ Los nuevos gimnasios carecen de datos
ja: ⚠️ 新規ジムはデータ不足

# error_Firestore_タイムアウトエラー_e
source: 📴 [Firestore] Timeout error: $e
es: 📴 [Firestore] Error de tiempo de espera: $e
ja: 📴 [Firestore] タイムアウトエラー: $e

# workout_ワークアウトが見つかりません
source: No workouts found
es: No se encontraron entrenamientos
ja: ワークアウトが見つかりません

# general_クリニック
source: clinic
es: clínica
ja: クリニック

# error_Firestore更新の検証に失敗しました
source: Firestore update validation failed
es: Error en la validación de la actualización de Firestore
ja: Firestore更新の検証に失敗しました

# profile_トレーニングについて自由に書いてください
source: Feel free to write about your training
es: Siéntete libre de escribir sobre tu formación.
ja: トレーニングについて自由に書いてください

# profile_サービス内容
source: Service details
es: Detalles del servicio
ja: サービス内容

# general_認証する
source: Authenticate
es: Autenticar
ja: 認証する

# general_警告_セット数が一致しません
source: ⚠️ WARNING: Set count mismatch!
es: ⚠️ ADVERTENCIA: ¡El recuento de conjuntos no coincide!
ja: ⚠️ 警告: セット数が一致しません！

# general_筋肥大依存の安定成長期
source: Stable growth period dependent on muscle hypertrophy
es: Periodo de crecimiento estable dependiente de la hipertrofia muscular
ja: 筋肥大依存の安定成長期

# general_さあ最初の記録を始めましょう
source: Now it's time to start your first recording!
es: ¡Ahora es el momento de comenzar tu primera grabación!
ja: さあ、最初の記録を始めましょう！

# workout_統計ダッシュボード_匿名認証エラー_e
source: ❌ Statistics Dashboard: Anonymous authentication error: $e
es: ❌ Panel de estadísticas: Error de autenticación anónima: $e
ja: ❌ 統計ダッシュボード: 匿名認証エラー: $e

# workout_所要時間_widgetworkoutduration分
source: Duration: ${widget.workout.duration} minutes
es: Duración: ${widget.workout.duration} minutos
ja: 所要時間: ${widget.workout.duration}分

# general_previousAppName_から_GYM_MATCH_に乗り換えました_AIが過去のトレーニング
source: I switched from $previousAppName to GYM MATCH! AI analyzes your past training data and identifies your weaknesses.
es: ¡Cambié de $previousAppName a GYM MATCH! La IA analiza tus datos de entrenamiento anteriores e identifica tus debilidades.
ja: $previousAppName から GYM MATCH に乗り換えました！ AIが過去のトレーニングデータを分析して、自分の弱点を

# workout_ユーザーがOKボタンを押下_ダイアログ閉じる
source: ✅ User presses OK button - dialog closes
es: ✅ El usuario presiona el botón Aceptar: el cuadro de diálogo se cierra
ja: ✅ ユーザーがOKボタンを押下 - ダイアログ閉じる

# general_AI追加パック_addonUsage回
source: AI Add-on Pack: $addonUsage times
es: Paquete complementario de IA: $addonTiempos de uso
ja: AI追加パック: $addonUsage回

# general_最適な回復期間とアドバイスを提供します
source: We will provide you with optimal recovery time and advice.
es: Le brindaremos el tiempo de recuperación óptimo y asesoramiento.
ja: 最適な回復期間とアドバイスを提供します。

# workout_セット数検出_setsMatchgroup1セット
source: 📊 Set count detection: ${setsMatch.group(1)} sets
es: 📊 Detección de recuento de conjuntos: ${setsMatch.group(1)} conjuntos
ja: 📊 セット数検出: ${setsMatch.group(1)}セット

# error_レート制限チェックエラー_e
source: ❌ Rate limit check error: $e
es: ❌ Error de comprobación del límite de velocidad: $e
ja: ❌ レート制限チェックエラー: $e

# workout_2秒後に再試行
source: Try again in 2 seconds...
es: Inténtalo de nuevo en 2 segundos...
ja: 2秒後に再試行...

# workout_不足部位
source: Missing part
es: Pieza faltante
ja: 不足部位

# error_マジックナンバー達成チェックエラー_e
source: ❌ Magic number achievement check error: $e
es: ❌ Error en la verificación de logro del número mágico: $e
ja: ❌ マジックナンバー達成チェックエラー: $e
