Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

source: barbell
de: Langhantel
es: barra con pesas
ja: バーベル
ko: 바벨
zh: 杠铃
zh_tw: 槓鈴

# dumbbell
source: dumbbells
de: Kurzhantel
es: mancuernas
ja: ダンベル
ko: 덤벨
zh: 哑铃
zh_tw: 啞鈴

source: Machine
de: Maschine
es: Máquina
ja: マシン
ko: 머신
zh: 机器
zh_tw: 機器

source: cable
de: [DE] ケーブル
ja: ケーブル
ko: [KO] ケーブル
zh: [ZH] ケーブル
zh_tw: [ZH_TW] ケーブル

# bodyweight
source: own weight
de: [DE] 自重
es: propio peso
ja: 自重
ko: [KO] 自重
zh: [ZH] 自重
zh_tw: [ZH_TW] 自重

source: inch
de: [DE] インチ
es: pulgada
ja: インチ
ko: [KO] インチ
zh: [ZH] インチ
zh_tw: [ZH_TW] インチ

# mile
source: Miles
de: [DE] マイル
es: Millas
ja: マイル
ko: [KO] マイル
zh: [ZH] マイル
zh_tw: [ZH_TW] マイル

# improved
source: improvement
de: [DE] 改善
es: mejora
ja: 改善
ko: [KO] 改善
zh: [ZH] 改善
zh_tw: [ZH_TW] 改善

# declined
source: Decline
de: [DE] 低下
es: Rechazar
ja: 低下
ko: [KO] 低下
zh: [ZH] 低下
zh_tw: [ZH_TW] 低下

# maintained
source: maintain
de: [DE] 維持
es: mantener
ja: 維持
ko: [KO] 維持
zh: [ZH] 維持
zh_tw: [ZH_TW] 維持

source: New record
de: [DE] 新記録
es: Nuevo récord
ja: 新記録
ko: [KO] 新記録
zh: [ZH] 新記録
zh_tw: [ZH_TW] 新記録

# failed
source: failure
de: [DE] 失敗
es: falla
ja: 失敗
ko: [KO] 失敗
zh: [ZH] 失敗
zh_tw: [ZH_TW] 失敗

# warning
source: caveat
de: [DE] 警告
es: advertencia
ja: 警告
ko: [KO] 警告
zh: [ZH] 警告
zh_tw: [ZH_TW] 警告

# info
source: information
de: [DE] 情報
es: información
ja: 情報
ko: [KO] 情報
zh: [ZH] 情報
zh_tw: [ZH_TW] 情報

source: Tip
de: [DE] ヒント
es: Consejo
ja: ヒント
ko: [KO] ヒント
zh: [ZH] ヒント
zh_tw: [ZH_TW] ヒント

source: recommendation
de: [DE] おすすめ
es: recomendación
ja: おすすめ
ko: [KO] おすすめ
zh: [ZH] おすすめ
zh_tw: [ZH_TW] おすすめ

source: community
es: comunidad
ja: コミュニティ
ko: 커뮤니티
zh: 社区
zh_tw: 社群

source: forum
es: foro
ja: フォーラム
ko: 포럼
zh: 论坛
zh_tw: 論壇

source: discussion
de: [DE] ディスカッション
es: discusión
ja: ディスカッション
ko: [KO] ディスカッション
zh: [ZH] ディスカッション
zh_tw: [ZH_TW] ディスカッション

source: comment
de: [DE] コメント
es: comentario
ja: コメント
ko: [KO] コメント
zh: [ZH] コメント
zh_tw: [ZH_TW] コメント

# like
source: nice
de: Gefällt mir
es: lindo
ja: いいね
ko: 좋아요
zh: 点赞
zh_tw: 按讚

source: Follow
de: Folgen
es: Seguir
ja: フォロー
ko: 팔로우
zh: 关注
zh_tw: 追蹤

source: Unfollow
de: Folgen解除
es: Dejar de seguir
ja: フォロー解除
ko: 팔로우解除
zh: 关注解除
zh_tw: 追蹤解除

source: badge
de: Abzeichen
es: insignia
ja: バッジ
ko: 배지
zh: 徽章
zh_tw: 徽章

# reward
source: Rewards
de: [DE] 報酬
es: Recompensas
ja: 報酬
ko: [KO] 報酬
zh: [ZH] 報酬
zh_tw: [ZH_TW] 報酬

source: milestone
de: [DE] マイルストーン
es: hito
ja: マイルストーン
ko: [KO] マイルストーン
zh: [ZH] マイルストーン
zh_tw: [ZH_TW] マイルストーン

source: Challenge
de: [DE] チャレンジ
es: Desafío
ja: チャレンジ
ko: [KO] チャレンジ
zh: [ZH] チャレンジ
zh_tw: [ZH_TW] チャレンジ

source: level
de: Stufe
es: nivel
ja: レベル
ko: 레벨
zh: 等级
zh_tw: 等級

# points
source: point
de: Punkte
es: punto
ja: ポイント
ko: 포인트
zh: 积分
zh_tw: 積分

source: Developer Menu
de: [DE] 開発者メニュー
es: Menú del desarrollador
ja: 開発者メニュー
ko: [KO] 開発者メニュー
zh: [ZH] 開発者メニュー
zh_tw: [ZH_TW] 開発者メニュー

# debugInfo
source: Debugging Information
de: [DE] デバッグ情報
es: Información de depuración
ja: デバッグ情報
ko: [KO] デバッグ情報
zh: [ZH] デバッグ情報
zh_tw: [ZH_TW] デバッグ情報

source: Stack trace
de: [DE] スタックトレース
es: Rastreo de pila
ja: スタックトレース
ko: [KO] スタックトレース
zh: [ZH] スタックトレース
zh_tw: [ZH_TW] スタックトレース

source: Document ID
de: [DE] ドキュメントID
es: ID del documento
ja: ドキュメントID
ko: [KO] ドキュメントID
zh: [ZH] ドキュメントID
zh_tw: [ZH_TW] ドキュメントID

# totalDocuments
source: Total number of documents
de: [DE] 全ドキュメント数
es: Número total de documentos
ja: 全ドキュメント数
ko: [KO] 全ドキュメント数
zh: [ZH] 全ドキュメント数
zh_tw: [ZH_TW] 全ドキュメント数

# workoutDetail
source: Training Details
de: Trainingsdetails
es: Detalles de la formación
ja: トレーニング詳細
zh: 训练详情

# addNote
source: Add a note
de: Notiz hinzufügen
es: Añadir una nota
ja: メモを追加
zh: 添加备忘录

# editNote
source: Edit a note
de: Notiz bearbeiten
es: Editar una nota
ja: メモを編集
zh: 编辑备忘录

# noteHint
source: Record your thoughts and impressions about training...
de: Eindrücke und Erkenntnisse vom Training aufzeichnen...
es: Registra tus pensamientos e impresiones sobre el entrenamiento...
ja: トレーニングの感想や気づきを記録...
zh: 记录训练的感想和发现...

source: Note saved
de: Notiz gespeichert
es: Nota guardada
ja: メモを保存しました
zh: 备忘录已保存

# noteUpdated
source: Updated the note
de: Notiz aktualisiert
es: Se actualizó la nota
ja: メモを更新しました
zh: 备忘录已更新

source: Note deleted
de: Notiz gelöscht
es: Nota eliminada
ja: メモを削除しました
zh: 备忘录已删除

# noteSaveFailed
source: Failed to save note: {error}
de: Notiz speichern fehlgeschlagen: {error}
es: No se pudo guardar la nota: {error}
ja: メモの保存に失敗しました: {error}
zh: 保存备忘录失败: {error}

# noteDeleteFailed
source: Failed to delete note: {error}
de: Notiz löschen fehlgeschlagen: {error}
es: No se pudo eliminar la nota: {error}
ja: メモの削除に失敗しました: {error}
zh: 删除备忘录失败: {error}

# workoutNotes
source: Workout Memo
de: Trainingsnotizen
es: Memo de entrenamiento
ja: ワークアウトメモ
zh: 训练备忘录

# exerciseList
source: List of events
de: Übungsliste
es: Lista de eventos
ja: 種目一覧
zh: 动作列表

source: Crunch
es: Crujido
ja: クランチ
zh: 卷腹

# legRaise
source: Leg raises
de: Beinheben
es: Elevaciones de piernas
ja: レッグレイズ
zh: 举腿

source: Plank
es: Tablón
ja: プランク
zh: 平板支撑

source: Ab roller
es: Rodillo para abdominales
ja: アブローラー
zh: 健腹轮

# hangingLegRaise
source: Hanging Leg Raises
de: Hängendes Beinheben
es: Elevaciones de piernas colgado
ja: ハンギングレッグレイズ
zh: 悬垂举腿

source: Side Plank
de: Seitliche Plank
es: Plancha lateral
ja: サイドプランク
zh: 侧平板支撑

source: Bicycle Crunch
de: Fahrrad-Crunch
es: Crujido de bicicleta
ja: バイシクルクランチ
zh: 单车卷腹

source: Cable Crunch
de: Kabel-Crunch
es: Crujido de cable
ja: ケーブルクランチ
zh: 绳索卷腹

# bodyPartBalance30Days
source: Balance for the last 30 days
es: Saldo de los últimos 30 días
ja: 過去30日間のバランス

# bodyPartBalanceDays
source: Balance for the past {days} days
es: Saldo de los últimos {days} días
ja: 過去{days}日間のバランス

# aiMenuParseFailed
source: Menu parsing failed
es: Error al analizar el menú
ja: メニューの解析に失敗しました

# aiMenuRetryPrompt
source: Generate the menu again.
es: Generar el menú nuevamente.
ja: もう一度メニューを生成してください。

# aiMenuRetryButton
source: Regenerate
es: Regenerado
ja: 再生成する

# aiDebugShowText
source: Debugging: Viewing the generated text
es: Depuración: visualización del texto generado
ja: デバッグ: 生成されたテキストを見る

# profileBodyWeight
source: Weight/body fat percentage
es: Peso/porcentaje de grasa corporal
ja: 体重・体脂肪率

# profileBodyMeasurement
source: Physical Recording and Management
es: Registro y gestión física
ja: 身体の記録と管理

# profileInviteFriends
source: Invite friends
es: Invitar amigos
ja: 友達を招待

# profileNotifications
source: Push notifications and alerts
es: Notificaciones push y alertas
ja: プッシュ通知・アラート

# profileVisitHistory
source: History of visits
es: Historial de visitas
ja: Historial de visitas

# profileGymDetails
source: Details of the game
es: Detalles del juego
ja: Detalles del gimnasio

# profileMessages
source: Message
es: Mensaje
ja: mensaje

# subscriptionPopularBadge
source: No.1 in popularity
es: Número 1 en popularidad
ja: 人気No.1

# subscriptionMonthlyEquivalent
source: Monthly price ¥{price}
es: Precio mensual ¥{price}
ja: 月換算 ¥{price}

# subscriptionSavings
source: ¥{amount}Great deal!
es: ¥{amount}¡Gran oferta!
ja: ¥{amount}お得！

# subscriptionFreeFeatures
source: All features in the free plan
es: Todas las funciones del plan gratuito
ja: 無料プランの全機能

# subscriptionUnlimitedFavorites
source: Unlimited Favorites
es: Favoritos ilimitados
ja: お気に入り無制限

# subscriptionDetailedStats
source: Detailed congestion statistics
es: Estadísticas detalladas de congestión
ja: 詳細な混雑度統計

# subscriptionGymReviews
source: Gym review submission
es: Envío de reseñas de gimnasios
ja: ジムレビュー投稿

# subscriptionGrowthPrediction
source: Growth forecast and impact analysis
es: Previsión de crecimiento y análisis de impacto
ja: 成長予測と効果分析

# subscriptionNoAds
source: No ads
es: Sin anuncios
ja: 広告表示なし

# subscriptionFreeTrialDays
source: {days} day free trial
es: {days} día de prueba gratuita
ja: {days}日間無料トライアル

# subscriptionStartFreeTrial
source: Start your free trial
es: Comience su prueba gratuita
ja: 無料トライアルを始める

# workoutSetsLabel
source: set
es: colocar
ja: セット

# workoutRepsLabel
source: times
es: veces
ja: 回

# workoutWeightLabel
source: weight
es: peso
ja: 重量

# workoutTotalVolume
source: Total Load
es: Carga total
ja: 総負荷量

# workoutTotalSets
source: Total number of sets
es: Número total de conjuntos
ja: 総セット数

# buttonSave
source: keep
es: mantener
ja: 保存

# buttonCancel
source: cancel
es: Cancelar
ja: キャンセル

# buttonDelete
source: delete
es: borrar
ja: 削除

# buttonEdit
source: edit
es: editar
ja: 編集

# buttonAdd
source: addition
es: suma
ja: 追加

# buttonConfirm
source: confirmation
es: confirmación
ja: 確認

# buttonClose
source: close
es: cerca
ja: 閉じる

# errorLoadFailed
source: Loading failed
es: Error en la carga
ja: 読み込みに失敗しました

# errorSaveFailed
source: Save failed
es: Error al guardar
ja: 保存に失敗しました

# bodyPart_腹筋
source: abdominal muscles
es: músculos abdominales
ja: 腹筋

# gym_筋トレマシン
source: muscle training machine
es: máquina de entrenamiento muscular
ja: 筋トレマシン

# gym_フリーウェイト
source: Free weights
es: Pesas libres
ja: フリーウェイト

# gym_プール
source: Pool
es: Piscina
ja: プール

# gym_空いています
source: Available
es: Disponible
ja: 空いています

# general_エリート
source: elite
es: élite
ja: エリート

# gym_スタジオ
source: studio
es: estudio
ja: スタジオ

# workout_水泳
source: swimming
es: nadar
ja: 水泳

# workout_ステッパー
source: Stepper
es: Paso a paso
ja: ステッパー

# workout_サイクリング
source: cycling
es: ciclismo
ja: サイクリング

# workout_ウォーキング
source: walking
es: caminando
ja: ウォーキング

# workout_ローイングマシン
source: rowing machine
es: máquina de remo
ja: ローイングマシン

# gym_データの取得に失敗しました
source: Failed to retrieve data
es: No se pudieron recuperar los datos
ja: データの取得に失敗しました

# gym_ランニングマシン
source: Treadmill
es: Rueda de andar
ja: ランニングマシン

# workout_ダンベルフライ
source: Dumbbell Fly
es: Vuelo con mancuernas
ja: ダンベルフライ

# workout_スタックトレース_stackTrace
source: Stack trace: $stackTrace
es: Rastreo de pila: $stackTrace
ja: スタックトレース: $stackTrace

# gym_24時間営業
source: Open 24 hours
es: Abierto las 24 horas
ja: 24時間営業

# workout_重量_kg
source: Weight (kg)
es: Peso (kg)
ja: 重量 (kg)

# gym_シャワー
source: shower
es: ducha
ja: シャワー

# workout_リアレイズ
source: Real Raise
es: Aumento real
ja: リアレイズ

# gym_超混雑
source: Extremely crowded
es: Muy concurrido
ja: 超混雑

# workout_ケーブルプッシュダウン
source: Cable Push Down
es: Empuje hacia abajo con cable
ja: ケーブルプッシュダウン

# subscription_ユーザーがログインしていません
source: ❌ User not logged in
es: ❌ Usuario no conectado
ja: ❌ ユーザーがログインしていません

# general_未経験初期
source: Inexperienced/Early
es: Inexperto/Temprano
ja: 未経験・初期

# gym_ストレッチエリア
source: Stretching Area
es: Área de estiramiento
ja: ストレッチエリア

# workout_インターバルラン
source: Interval running
es: Carrera a intervalos
ja: インターバルラン

# workout_三角筋
source: Deltoid
es: Deltoides
ja: 三角筋

# workout_ランジ
source: Lunge
es: Estocada
ja: ランジ

# gym_スパ
source: spa
ja: スパ

# gym_サウナ
source: sauna
ja: サウナ

# workout_スタックトレース_stackTrace_1
source: Stack trace: $stackTrace
es: Rastreo de pila: $stackTrace
ja: スタックトレース: $stackTrace

# workout_クロストレーナー
source: Cross trainer
es: Bicicleta elíptica
ja: クロストレーナー

# workout_プルアップ
source: pull-up
es: dominadas
ja: プルアップ

# general_初月無料
source: First month free
es: Primer mes gratis
ja: 初月無料

# workout_マウンテンクライマー
source: Mountain Climber
es: Escalador de montaña
ja: マウンテンクライマー

# workout_ケーブルクロスオーバー
source: Cable Crossover
es: Cruce de cables
ja: ケーブルクロスオーバー

# workout_Tバーロウ
source: T Barlow
ja: Tバーロウ

# general_推奨回復時間
source: Recommended Recovery Time
es: Tiempo de recuperación recomendado
ja: 推奨回復時間

# general_ベンチ
source: bench
es: banco
ja: ベンチ

# general_軽度
source: Mild
es: Leve
ja: 軽度

# workout_3ヶ月
source: 3 months
es: 3 meses
ja: 3ヶ月

# workout_トレーナー記録取得エラー_e
source: Error getting trainer record: $e
es: Error al obtener el registro del entrenador: $e
ja: トレーナー記録取得エラー: $e

# exercise_トライセプスプレスダウン
source: Tricep Press Down
es: Press de tríceps hacia abajo
ja: トライセプスプレスダウン

# workout_exercisesetsセット
source: ${exercise.sets}Sets
es: ${exercise.sets}Conjuntos
ja: ${exercise.sets}セット

# error_削除エラー_e
source: ❌ Deletion Error: $e
es: ❌ Error de eliminación: $e
ja: ❌ 削除エラー: $e

# subscription_エラー_e
source: ❌ Error: $e
ja: ❌ エラー: $e

# workout_回数_1012回
source: - Number of repetitions: 10-12
es: - Número de repeticiones: 10-12
ja: - 回数: 10-12回

# bodyPart_上腕二頭筋
source: biceps
es: bíceps
ja: 上腕二頭筋

# error_メッセージの読み込みに失敗しました
source: Failed to load message
es: No se pudo cargar el mensaje
ja: メッセージの読み込みに失敗しました

# workout_コンセントレーションカール
source: Concentration Curl
es: Curl de concentración
ja: コンセントレーションカール

# general_高め
source: High
es: Alto
ja: 高め

# workout_ケーブルロウ
source: Cable Row
es: Remo con cable
ja: ケーブルロウ

# general_メッセージを入力
source: Type your message...
es: Escribe tu mensaje...
ja: メッセージを入力...

# workout_9ヶ月
source: 9 months
es: 9 meses
ja: 9ヶ月

# workout_ジョギング屋外
source: Jogging (outdoors)
es: Correr (al aire libre)
ja: ジョギング（屋外）

# workout_ジョギング
source: jogging
es: correr
ja: ジョギング

# profile_北海道
source: Hokkaido
es: Hokkaidō
ja: 北海道

# workout_1ヶ月
source: 1 month
es: 1 mes
ja: 1ヶ月

# workout_ライイングトライセプスエクステンション
source: Lying Tricep Extension
es: Extensión de tríceps acostado
ja: ライイングトライセプスエクステンション

# profile_保存に失敗しました_e
source: ❌ Save failed: $e
es: ❌ Error al guardar: $e
ja: ❌ 保存に失敗しました: $e

# exercise_クローズグリップベンチプレス
source: Close Grip Bench Press
es: Press de banca con agarre cerrado
ja: クローズグリップベンチプレス

# general_極めて高い
source: Extremely high
es: Extremadamente alto
ja: 極めて高い

# error_AdMob初期化エラー_e
source: ❌ AdMob initialization error: $e
es: ❌ Error de inicialización de AdMob: $e
ja: ❌ AdMob初期化エラー: $e

# workout_6ヶ月
source: 6 months
es: 6 meses
ja: 6ヶ月

# exercise_ブルガリアンスクワット
source: Bulgarian Squat
es: Sentadilla búlgara
ja: ブルガリアンスクワット

# exercise_ダンベルショルダープレス
source: Dumbbell Shoulder Press
es: Press de hombros con mancuernas
ja: ダンベルショルダープレス

# general_営業時間不明
source: Business hours unknown
es: Horario comercial desconocido
ja: 営業時間不明

# general_疲労度レベル
source: Fatigue level
es: Nivel de fatiga
ja: 疲労度レベル

# general_Web環境のためAdMob初期化をスキップ
source: 🌐 Skip AdMob initialization for web environment
es: 🌐 Omitir la inicialización de AdMob para el entorno web
ja: 🌐 Web環境のためAdMob初期化をスキップ

# subscription_確定
source: Confirmed
es: Confirmado
ja: 確定

# workout_パーソナルトレーニング
source: (Personal Training)
es: (Entrenamiento personal)
ja: (パーソナルトレーニング)

# general_ありがとう
source: thank you!
es: ¡gracias!
ja: ありがとう！

# workout_2ヶ月
source: 2 months
es: 2 meses
ja: 2ヶ月

# general_中程度
source: moderate
es: moderado
ja: 中程度

# workout_広背筋
source: latissimus dorsi
es: dorsal ancho
ja: 広背筋

# general_アドバイス
source: advice
es: consejo
ja: アドバイス

# workout_1年
source: 1 year
es: 1 año
ja: 1年

# gym_基本情報
source: basic information
es: información básica
ja: 基本情報

# workout_シェアに失敗しました_e
source: Share failed: $e
es: Error al compartir: $e
ja: シェアに失敗しました: $e

# general_営業時間外
source: Outside business hours
es: Fuera del horario comercial
ja: 営業時間外

# error_リセット失敗_e
source: ❌ Reset failed: $e
es: ❌ Error al reiniciar: $e
ja: ❌ リセット失敗: $e

# workout_ランニングトレッドミル
source: Running (treadmill)
es: Correr (cinta de correr)
ja: ランニング（トレッドミル）

# general_休眠中
source: dormant
es: latente
ja: 休眠中

# workout_重さ
source: Weight
es: Peso
ja: 重さ

# general_2ヶ月無料
source: 2 months free
es: 2 meses gratis
ja: 2ヶ月無料

# workout_セット数_3セット
source: - Number of sets: 3 sets
es: - Número de juegos: 3 juegos
ja: - セット数: 3セット

# gym_テニスコート
source: tennis court
es: pista de tenis
ja: テニスコート

# workout_ウォーキングトレッドミル
source: Walking (treadmill)
es: Caminar (cinta de correr)
ja: ウォーキング（トレッドミル）

# workout_下半身
source: lower body
es: parte inferior del cuerpo
ja: 下半身

# profile_最終更新日_2025年11月20日
source: Last updated: November 20, 2025
es: Última actualización: 20 de noviembre de 2025
ja: 最終更新日: 2025年11月20日

# workout_ドラゴンフラッグ
source: Dragon Flag
es: Bandera del dragón
ja: ドラゴンフラッグ

# workout_バイク
source: Bike
es: Bicicleta
ja: バイク

# general_期間限定キャンペーン
source: Limited-time campaign
es: Campaña por tiempo limitado
ja: 期間限定キャンペーン

# gym_女性専用
source: Women only
es: Sólo mujeres
ja: 女性専用

# workout_ワイドグリッププルアップ
source: Wide Grip Pull-Ups
es: Dominadas con agarre ancho
ja: ワイドグリッププルアップ

# general_RevenueCat初期化成功
source: ✅ RevenueCat initialization successful
es: ✅ Inicialización exitosa de RevenueCat
ja: ✅ RevenueCat初期化成功

# workout_ロシアンツイスト
source: Russian Twist
es: Giro ruso
ja: ロシアンツイスト

# exercise_2_ベンチプレス
source: ### 2. Bench Press
es: ### 2. Press de banca
ja: ### 2. ベンチプレス

# general_ℹ_ユーザーが購入をキャンセルしました
source: ℹ️ User canceled the purchase
es: ℹ️ El usuario canceló la compra
ja: ℹ️ ユーザーが購入をキャンセルしました

# bodyPart_上腕
source: upper arm
es: parte superior del brazo
ja: 上腕

# general_ダンベルロウ
source: Dumbbell Row
es: Remo con mancuernas
ja: ダンベルロウ

# workout_種目を追加してください
source: Please add a category
es: Por favor, añade una categoría
ja: 種目を追加してください

# workout_continue_2_箇条書き処理_if_linetrimstartsWith
source: )); continue; } / 2. Bullet processing (* → ・) if (line.trim().startsWith(
es: )); continuar; } / 2. Procesamiento de viñetas (* → ・) if (line.trim().startsWith(
ja: )); continue; } // 2. 箇条書き処理（* → ・） if (line.trim().startsWith(

# general_データ再読み込み開始
source: 🔄 Data reloading started...
es: 🔄 Se inició la recarga de datos...
ja: 🔄 データ再読み込み開始...

# workout_ヒップスラスト
source: Hip Thrust
es: Empuje de cadera
ja: ヒップスラスト

# subscription_復元エラー_e
source: ❌ Restore Error: $e
es: ❌ Error de restauración: $e
ja: ❌ 復元エラー: $e

# workout_メニュー保存エラー_e
source: ❌ Menu save error: $e
es: ❌ Error al guardar el menú: $e
ja: ❌ メニュー保存エラー: $e

# workout_final_ListInlineSpan_spans_for_int_i_0_i_linesleng
source: ); final List<InlineSpan> spans = []; for (int i = 0; i < lines.length; i++) { String line = lines[i]; / 1. Heading (## Text → Bold Text) if (line.trim().startsWith(
es: ); final List<InlineSpan> spans = []; for (int i = 0; i < lines.length; i++) { String line = lines[i]; / 1. Encabezado (## Texto → Texto en negrita) if (line.trim().startsWith(
ja: ); final List<InlineSpan> spans = []; for (int i = 0; i < lines.length; i++) { String line = lines[i]; // 1. 見出し処理（## Text → 太字テキスト） if (line.trim().startsWith(

# workout_今日のトレーニングについてメモを残しましょう
source: Take notes about today's training
es: Toma notas sobre el entrenamiento de hoy
ja: 今日のトレーニングについてメモを残しましょう

# workout_マウンテンクライマー高強度
source: Mountain climber (high intensity)
es: Escalador de montaña (alta intensidad)
ja: マウンテンクライマー（高強度）

# subscription_メッセージング機能
source: 💬 Messaging features
es: 💬 Funciones de mensajería
ja: 💬 メッセージング機能

# workout_count回
source: $count times
es: $count veces
ja: $count回

# workout_記録履歴
source: Record History
es: Historial de registros
ja: 記録履歴

# general_データ再読み込み完了
source: ✅ Data reload completed
es: ✅ Recarga de datos completada
ja: ✅ データ再読み込み完了

# general_reps_回
source: $reps times
es: $reps veces
ja: $reps 回

# general_プッシュアップ
source: Push-ups
es: Lagartijas
ja: プッシュアップ

# workout_オーバーヘッドトライセプスエクステンション
source: Overhead Tricep Extension
es: Extensión de tríceps por encima de la cabeza
ja: オーバーヘッドトライセプスエクステンション

# subscription_500月
source: ¥500/month
es: ¥500/mes
ja: ¥500/月

# workout_ケーブルサイドレイズ
source: Cable Side Raise
es: Elevación lateral con cable
ja: ケーブルサイドレイズ

# workout_月間上限に達しました
source: Monthly limit reached
es: Límite mensual alcanzado
ja: 月間上限に達しました

# general_GymMatch乗り換え割
source: #GymMatch transfer discount
es: Descuento por transferencia #GymMatch
ja: #GymMatch乗り換え割

# workout_時間_分
source: Time (minutes)
es: Tiempo (minutos)
ja: 時間 (分)

# general_疲労管理システムを有効にしました
source: ✅ Fatigue Management System enabled
es: ✅ Sistema de gestión de fatiga habilitado
ja: ✅ 疲労管理システムを有効にしました

# general_招待コードを使用
source: Use an invitation code
es: Utilice un código de invitación
ja: 招待コードを使用

# workout_true_Step_5_AI生成成功_クレジット消費_final_consumeSuccess_aw
source: ] == true) { // ========================================= // ✅ Step 5: AI generation successful → Credit consumption // =========================================== final consumeSuccess = await creditService.consumeAICredit(); debugPrint(
es: ] == true) { // =========================================== // ✅ Paso 5: Generación de IA exitosa → Consumo de crédito // ============================================== final consumeSuccess = await creditService.consumeAICredit(); debugPrint(
ja: ] == true) { // ======================================== // ✅ Step 5: AI生成成功 → クレジット消費 // ======================================== final consumeSuccess = await creditService.consumeAICredit(); debugPrint(

# workout_回数_610回
source: - Number of repetitions: 6-10
es: - Número de repeticiones: 6-10
ja: - 回数: 6-10回

# exercise_1_スクワット
source: ### 1. Squats
es: ### 1. Sentadillas
ja: ### 1. スクワット

# general_セットrecommendedVolume
source: ]}set(${recommendedVolume[
es: ]}set(${volumen recomendado[
ja: ]}セット（${recommendedVolume[

# workout_休憩時間を設定
source: Set a break time
es: Establezca un tiempo de descanso
ja: 休憩時間を設定

# workout_連続トレーニング記録
source: Continuous training record
es: Registro de formación continua
ja: 連続トレーニング記録

# error_削除失敗_workoutId_is_null
source: ❌ Deletion failed: workoutId is null
es: ❌ Eliminación fallida: workoutId es nulo
ja: ❌ 削除失敗: workoutId is null

# workout_ペックフライマシン
source: Peck Fry Machine
es: Máquina para freír Peck
ja: ペックフライマシン

# subscription_使用頻度が低い
source: Infrequently used
es: De uso poco frecuente
ja: 使用頻度が低い

# general_週間トレーニング回数
source: Number of weekly training sessions
es: Número de sesiones de entrenamiento semanales
ja: 週間トレーニング回数

# workout_ドラッグカール
source: Drag Curl
es: Arrastre Curl
ja: ドラッグカール

# error_エラーコード_errorcode
source: Error code: ${error.code}
es: Código de error: ${error.code}
ja: エラーコード: ${error.code}

# workout_まだ履歴がありません
source: No history yet
es: Aún no hay historia
ja: まだ履歴がありません

# general_アクティブ会員
source: Active Members
es: Miembros activos
ja: アクティブ会員

# workout_EZバーカール
source: EZ Bar Curl
es: Curl con barra EZ
ja: EZバーカール

# workout_補助
source: auxiliary
es: auxiliar
ja: 補助

# workout_チンアップ逆手懸垂
source: Chin-ups (reverse pull-ups)
es: Dominadas (dominadas inversas)
ja: チンアップ（逆手懸垂）

# error_RevenueCat初期化エラー_e
source: ❌ RevenueCat initialization error: $e
es: ❌ Error de inicialización de RevenueCat: $e
ja: ❌ RevenueCat初期化エラー: $e

# workout_インクラインフライ
source: Incline Fly
es: Vuelo inclinado
ja: インクラインフライ

# workout_まだ記録がありません
source: No records yet
es: No hay registros todavía
ja: まだ記録がありません

# workout_筋トレ種目保存_currentExerciseName_weightfinalWeight_reps
source: 💾 Save exercise: $currentExerciseName - weight=$finalWeight, reps=$finalReps, sets=$finalSets
es: 💾 Guardar ejercicio: $currentExerciseName - peso=$finalWeight, repeticiones=$finalReps, series=$finalSets
ja: 💾 筋トレ種目保存: $currentExerciseName - weight=$finalWeight, reps=$finalReps, sets=$finalSets

# general_広告ID_rewardAdUnitId
source: Ad ID: $_rewardAdUnitId
es: ID del anuncio: $_rewardAdUnitId
ja: 広告ID: $_rewardAdUnitId

# workout_フェイスプル
source: Face Pull
es: tirón de cara
ja: フェイスプル

# workout_種目名を入力
source: Enter the event name
es: Introduzca el nombre del evento
ja: 種目名を入力

# workout_提案されたメニュー
source: Suggested menu
es: Menú sugerido
ja: 提案されたメニュー

# profile_支払方法
source: payment method
es: método de pago
ja: 支払方法

# profile_有料プラン
source: Paid Plans
es: Planes de pago
ja: 有料プラン

# exercise_ルーマニアンデッドリフト
source: Romanian Deadlift
es: Peso muerto rumano
ja: ルーマニアンデッドリフト

# error_検索エラー_e
source: ❌ Search Error: $e
es: ❌ Error de búsqueda: $e
ja: ❌ 検索エラー: $e

# workout_バトルロープ
source: Battle Ropes
es: Cuerdas de batalla
ja: バトルロープ

# general_全会員
source: All members
es: Todos los miembros
ja: 全会員

# gym_gymreviewCount件
source: (${gym.reviewCount})
ja: (${gym.reviewCount}件)

# general_フォールバック_サンプルデータを使用します
source: Fallback: Use sample data
es: Respaldo: utilizar datos de muestra
ja: フォールバック: サンプルデータを使用します

# exercise_JMプレス
source: JM Press
es: Prensa JM
ja: JMプレス

# workout_21カール
source: 21 curls
es: 21 rizos
ja: 21カール

# workout_使い方
source: How to use
es: Cómo utilizar
ja: 使い方

# profile_体力向上
source: Improve physical strength
es: Mejorar la fuerza física
ja: 体力向上
