Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# general_あとmagicNumberRecords_count記録_残りdaysRemaining日で達成でき
source: Just ${magicNumberRecords - count} records away! Only ${daysRemaining} days left to reach it 💪
es: ¡Solo faltan ${magicNumberRecords - count} registros! ¡Solo faltan ${daysRemaining} días para alcanzarlo! 💪
ja: あと${magicNumberRecords - count}記録！ 残り${daysRemaining}日で達成できます💪

# general_混雑度監視開始_favoriteslength件のジム
source: ✅ Crowd monitoring started: ${favorites.length} gyms
es: ✅ Se inició el monitoreo de multitudes: ${favorites.length} gimnasios
ja: ✅ 混雑度監視開始: ${favorites.length}件のジム

# workout_Phase_7_データが0件です体重記録画面で保存してください
source: ⚠️ [Phase 7] There is 0 data. Please save on the weight recording screen.
es: ⚠️ [Fase 7] No hay datos. Por favor, guarde el peso en la pantalla de registro.
ja: ⚠️ [Phase 7] データが0件です。体重記録画面で保存してください。

# general_奈良
source: Nara
ja: 奈良

# subscription_1_プロフィール設定を完了
source: 1. Complete your profile settings
es: 1. Completa la configuración de tu perfil
ja: 1. プロフィール設定を完了

# profile_重要事項
source: 📌 Important information
es: 📌 Información importante
ja: 📌 重要事項

# general_totalSessions回
source: $totalSessions
es: $totalSesiones
ja: $totalSessions回

# workout_Phase_7_体重取得クエリ開始_userIduserId
source: 🔍 [Phase 7] Start weight query: userId=$userId
es: 🔍 [Fase 7] Consulta de peso inicial: userId=$userId
ja: 🔍 [Phase 7] 体重取得クエリ開始: userId=$userId

# general_週2回
source: Twice a week
es: Dos veces por semana
ja: 週2回

# general_店舗設備の写真をアップロード
source: Upload photos of your store and facilities
es: Sube fotos de tu tienda e instalaciones
ja: 店舗・設備の写真をアップロード

# general_ボリュームが成長の鍵頻度は手段
source: Volume is the key to growth, frequency is the means
es: El volumen es la clave del crecimiento, la frecuencia es el medio.
ja: ボリュームが成長の鍵、頻度は手段

# workout_週間統計期間_weekStart_now
source: 📅 Weekly period: $weekStart ~ $now
es: 📅 Periodo semanal: $weekStart ~ $now
ja: 📅 週間統計期間: $weekStart 〜 $now

# workout_exname_exbodyPart_exduration分_exdistance_0km_exset
source: ✅ ${ex.name} (${ex.bodyPart}): ${ex.duration} minutes, ${ex.distance ?? 0}km, ${ex.sets} sets [Aerobic]
es: ✅ ${ex.name} (${ex.bodyPart}): ${ex.duration} minutos, ${ex.distance ?? 0} km, ${ex.sets} series [Aeróbico]
ja: ✅ ${ex.name} (${ex.bodyPart}): ${ex.duration}分, ${ex.distance ?? 0}km, ${ex.sets}セット [有酸素]

# subscription_1_iPhoneの設定アプリを開く
source: 1. Open the "Settings" app on your iPhone
es: 1. Abre la aplicación "Ajustes" en tu iPhone.
ja: 1. iPhoneの「設定」アプリを開く

# general_パートナー特典
source: Partner Benefits
es: Beneficios para socios
ja: パートナー特典

# general_2_Firestoreセキュリティルールで読み込みが拒否されている
source: 2. Firestore security rules deny loading
es: 2. Las reglas de seguridad de Firestore deniegan la carga
ja: 2. Firestoreセキュリティルールで読み込みが拒否されている

# general_きつい運動
source: Strenuous exercise
es: Ejercicio extenuante
ja: きつい運動

# workout_既存記録追加_自重モード反映_setexerciseName_userBodyweightkg_se
source: ✅ Add existing record - Reflect bodyweight mode: ${set.exerciseName} = ${_userBodyweight}kg + ${set.weight}kg = ${effectiveWeight}kg
es: ✅ Agregar registro existente - Modo de peso corporal reflejado: ${set.exerciseName} = ${_userBodyweight}kg + ${set.weight}kg = ${effectiveWeight}kg
ja: ✅ 既存記録追加 - 自重モード反映: ${set.exerciseName} = ${_userBodyweight}kg + ${set.weight}kg = ${effectiveWeight}kg

# general_あなたの成長予測を見逃さないために
source: Don't miss your growth forecast
es: No te pierdas tu pronóstico de crecimiento
ja: あなたの成長予測を見逃さないために

# workout_種目を1つ以上追加してください
source: Please add one or more events
es: Por favor agregue uno o más eventos
ja: 種目を1つ以上追加してください

# general_編集機能は次のアップデートで実装予定です
source: Editing functionality will be implemented in the next update.
es: La funcionalidad de edición se implementará en la próxima actualización.
ja: 編集機能は次のアップデートで実装予定です

# workout_resultをカスタム種目として保存しました
source: "$result" saved as a custom event
es: "$result" guardado como un evento personalizado
ja: 「$result」をカスタム種目として保存しました

# error_プロフィール削除エラー_e
source: Profile deletion error: $e
es: Error de eliminación de perfil: $e
ja: プロフィール削除エラー: $e

# general_このUIDを使ってFirestoreで開発者権限を設定できます
source: 💡 You can use this UID to set developer permissions in Firestore.
es: 💡Puedes usar este UID para establecer permisos de desarrollador en Firestore.
ja: 💡 このUIDを使ってFirestoreで開発者権限を設定できます

# general_位置情報を使用しますか
source: Do you use location information?
es: ¿Utiliza información de ubicación?
ja: 位置情報を使用しますか？

# workout_AIメニュー
source: AI Menu
es: Menú de IA
ja: AIメニュー

# general_削除確認OK_exerciseName_ID_workoutId
source: ✅ Delete confirmation OK: $exerciseName (ID: $workoutId)
es: ✅ Confirmación de eliminación OK: $exerciseName (ID: $workoutId)
ja: ✅ 削除確認OK: $exerciseName (ID: $workoutId)

# general_今すぐアップグレード
source: Upgrade now
es: Actualice ahora
ja: 今すぐアップグレード

# general_残りgoaldaysRemaining日_現在のペースを維持しよう
source: ${goal.daysRemaining} days remaining | Maintain current pace
es: ${goal.daysRemaining} días restantes | Mantener el ritmo actual
ja: 残り${goal.daysRemaining}日 | 現在のペースを維持しよう

# personalFactor_トレーニング終了後最新の動的要因で自動計算されます
source: After training, it will be automatically calculated with the latest dynamic factors.
es: Después del entrenamiento, se calculará automáticamente con los últimos factores dinámicos.
ja: トレーニング終了後、最新の動的要因で自動計算されます

# subscription_Firestore_timeout_キャッシュ使用
source: ⏱️ Firestore timeout - cache usage
es: ⏱️ Tiempo de espera de Firestore: uso de caché
ja: ⏱️ Firestore timeout - キャッシュ使用

# workout_成長予測_AI使用可能_canUseAIResultallowed
source: 🔍 [Growth Prediction] AI enabled: ${canUseAIResult.allowed}
es: 🔍 [Predicción de crecimiento] IA habilitada: ${canUseAIResult.allowed}
ja: 🔍 [成長予測] AI使用可能: ${canUseAIResult.allowed}

# general_validUntilmonth_validUntildayまで
source: Until ${_validUntil!.month}/${_validUntil!.day}
es: Hasta ${_validUntil!.month}/${_validUntil!.day}
ja: ${_validUntil!.month}/${_validUntil!.day}まで

# general_AI分析_API呼び出し中
source: ⏳ AI Analysis: API call...
es: ⏳ Análisis de IA: Llamada API...
ja: ⏳ AI分析: API呼び出し中...

# error_シェアに失敗しました_etoString
source: Share failed: ${e.toString()}
es: Error al compartir: ${e.toString()}
ja: シェアに失敗しました: ${e.toString()}

# general_パートナージム統合完了_partnerCount件のPOジム検出
source: ✅ Partner gym integration completed: ${partnerCount} PO gyms detected
es: ✅ Integración de gimnasios asociados completada: ${partnerCount} gimnasios PO detectados
ja: ✅ パートナージム統合完了: ${partnerCount}件のPOジム検出

# general_トレーナー記録がありません
source: No trainer records
es: No hay registros de entrenador
ja: トレーナー記録がありません

# general_セット
source: ]}set)
es: ]}colocar)
ja: ]}セット）

# workout_AIクレジット残高_await_creditServicegetAICredits
source: AI Credit Balance: ${await _creditService.getAICredits()}
es: Saldo de crédito de IA: ${await _creditService.getAICredits()}
ja: AIクレジット残高: ${await _creditService.getAICredits()}

# general_十分な休息bodyPartは最低48時間空ける
source: * Get plenty of rest ($bodyPart must be at least 48 hours apart)
es: * Descanse mucho (las partes del cuerpo deben estar separadas al menos 48 horas)
ja: * 十分な休息（$bodyPartは最低48時間空ける）

# gym_クーポンコード_announcementcouponCode
source: Coupon Code: ${announcement.couponCode}
es: Código de cupón: ${announcement.couponCode}
ja: クーポンコード: ${announcement.couponCode}

# workout_心肺
source: cardiopulmonary
es: cardiopulmonar
ja: 心肺

# general_追加セット準備ボタンから_exerciseName
source: 📋 Prepare additional set (via the + button): $exerciseName
es: 📋 Preparar conjunto adicional (mediante el botón +): $exerciseName
ja: 📋 追加セット準備（＋ボタンから）: $exerciseName

# error_バナー広告読み込み失敗_error
source: Banner ad loading failed: $error
es: Error al cargar el banner publicitario: $error
ja: バナー広告読み込み失敗: $error

# general_querySnapshotdocslength件の既存目標を無効化
source: ✅ Disable ${querySnapshot.docs.length} existing goals
es: ✅ Deshabilitar ${querySnapshot.docs.length} objetivos existentes
ja: ✅ ${querySnapshot.docs.length}件の既存目標を無効化

# general_紹介した側_AI_referrerAiBonus回
source: Referrer: AI x ${_referrerAiBonus} times
es: Referente: IA x ${_referrerAiBonus} veces
ja: 紹介した側: AI×${_referrerAiBonus}回

# subscription_プラン読み込みエラー_e
source: ❌ Plan load error: $e
es: ❌ Error de carga del plan: $e
ja: ❌ プラン読み込みエラー: $e

# subscription_終了日_設定なし
source: End date: Not set
es: Fecha de finalización: No establecida
ja: 終了日: 設定なし

# profile_トレーニング記録をどの形式で取り込みますか
source: In what format do you want to import your training records?
es: ¿En qué formato desea importar sus registros de entrenamiento?
ja: トレーニング記録をどの形式で取り込みますか？

# workout_スタックトレース_stackTrace_2
source: 📍 Stack trace: $stackTrace
es: 📍 Rastreo de pila: $stackTrace
ja: 📍 スタックトレース: $stackTrace

# workout_formatdocDate_セット数_setslength
source: ).format(docDate)}, Number of sets: ${sets.length}
es: ).format(docDate)}, Número de conjuntos: ${sets.length}
ja: ).format(docDate)}, セット数: ${sets.length}

# general_名前を入力してください
source: Enter your name
es: Introduce tu nombre
ja: 名前を入力してください

# general_今週のトレーニング
source: This week's training
es: Entrenamiento de esta semana
ja: 今週のトレーニング

# subscription_無料プランへの変更はApp_Store設定でサブスクリプションをキャンセルしてください
source: To change to the free plan, cancel your subscription in the App Store settings.
es: Para cambiar al plan gratuito, cancele su suscripción en la configuración de la App Store.
ja: 無料プランへの変更は、App Store設定でサブスクリプションをキャンセルしてください

# error_セット削除エラー_e
source: ❌ Set deletion error: $e
es: ❌ Error de eliminación de conjunto: $e
ja: ❌ セット削除エラー: $e

# subscription_トレーニング記録1回以上
source: Training record 1 or more times
es: Registro de entrenamiento 1 o más veces
ja: トレーニング記録1回以上

# subscription_レビュー投稿
source: Write a review
es: Escribe una reseña
ja: レビュー投稿

# workout_フルボディ_初心者向け
source: Full Body - Beginner
es: Cuerpo completo - Principiante
ja: フルボディ - 初心者向け

# workout_試してみる
source: try out
es: probar
ja: 試してみる

# error_アクセスコード認証エラー_e
source: ❌ Access code authentication error: $e
es: ❌ Error de autenticación del código de acceso: $e
ja: ❌ アクセスコード認証エラー: $e

# general_理想的なトレーニング負荷です_現在のペースを維持しましょう怪我リスクは最小です
source: This is your ideal training load! Maintain your current pace. Injury risk is minimal.
es: ¡Esta es tu carga de entrenamiento ideal! Mantén tu ritmo actual. El riesgo de lesiones es mínimo.
ja: 理想的なトレーニング負荷です！ 現在のペースを維持しましょう。怪我リスクは最小です。

# workout_IMPORT_Firestore保存完了_docRefid
source: ✅ [IMPORT] Firestore saved: ${docRef.id}
es: ✅ [IMPORTACIÓN] Firestore guardado: ${docRef.id}
ja: ✅ [IMPORT] Firestore保存完了: ${docRef.id}

# general_canUseAI_AI追加パック残回数_addonUsage
source: 🔍 [canUseAI] AI add-on pack remaining: $addonUsage
es: 🔍 [canUseAI] Paquete de complementos de IA restante: $addonUsage
ja: 🔍 [canUseAI] AI追加パック残回数: $addonUsage

# error_バージョン管理情報の更新エラー_e
source: ❌ Error updating version control information: $e
es: ❌ Error al actualizar la información de control de versión: $e
ja: ❌ バージョン管理情報の更新エラー: $e

# general_ℹ_ユーザー_userId_ジムデータなし更新スキップ
source: ℹ️ User $userId: No gym data, skipping update
es: ℹ️ Usuario $userId: No hay datos del gimnasio, se omite la actualización
ja: ℹ️ ユーザー $userId: ジムデータなし、更新スキップ

# subscription_AI追加パック消費エラー_e
source: ❌ AI additional pack consumption error: $e
es: ❌ Error de consumo de paquete adicional de IA: $e
ja: ❌ AI追加パック消費エラー: $e

# general_今週の実績
source: This week's results
es: Resultados de esta semana
ja: 今週の実績

# general_紹介コードをお持ちですか
source: Do you have a referral code?
es: ¿Tienes un código de referencia?
ja: 紹介コードをお持ちですか？

# general_アブドミナル
source: Abdominal
ja: アブドミナル

# general_あなたのBIG3平均1RMの15範囲内のユーザーのみ表示
source: Show only users within ±15% of your BIG3 average 1RM
es: Mostrar solo usuarios dentro del ±15 % de su promedio de 1RM de BIG3
ja: あなたのBIG3平均1RMの±15%範囲内のユーザーのみ表示

# general_トレーニング記録を保存しました
source: ✅ Training records saved
es: ✅ Registros de entrenamiento guardados
ja: ✅ トレーニング記録を保存しました

# error_メッセージの送信に失敗しました_e
source: Failed to send message: $e
es: No se pudo enviar el mensaje: $e
ja: メッセージの送信に失敗しました: $e

# workout_成長を加速
source: Accelerate growth
es: Acelerar el crecimiento
ja: 成長を加速

# general_女性が有意に優位
source: Significantly more women
es: Significativamente más mujeres
ja: 女性が有意に優位

# general_本日のトレーニング
source: Today's Training
es: Entrenamiento de hoy
ja: 本日のトレーニング

# workout_Firebase確認エラー_e2
source: Firebase verification error: $e2
es: Error de verificación de Firebase: $e2
ja: Firebase確認エラー: $e2

# workout_画像形式が正しくありません別の画像でお試しください
source: Invalid image format. Please try a different image.
es: Formato de imagen no válido. Pruebe con otra imagen.
ja: 画像形式が正しくありません。別の画像でお試しください。

# general_72時間以上
source: More than 72 hours
es: Más de 72 horas
ja: 72時間以上

# general_RM計算
source: RM calculation
es: Cálculo de RM
ja: RM計算

# workout_restSeconds秒
source: $_restSeconds seconds
es: $_restSeconds segundos
ja: $_restSeconds秒

# general_検索結果が見つかりません
source: No results found
es: No se encontraron resultados
ja: 検索結果が見つかりません

# profile_特別オファーやキャンペーン
source: Special offers and promotions
es: Ofertas especiales y promociones
ja: 特別オファーやキャンペーン

# general_最小バージョン_minVersion_Build_minBuildNumber
source: 🔍 Minimum Version: $minVersion (Build: $minBuildNumber)
es: 🔍 Versión mínima: $minVersion (Compilación: $minBuildNumber)
ja: 🔍 最小バージョン: $minVersion (Build: $minBuildNumber)

# profile_運動を始める前に医師に相談することを推奨します
source: • We recommend consulting your doctor before starting any exercise program
es: • Recomendamos consultar a su médico antes de comenzar cualquier programa de ejercicios.
ja: • 運動を始める前に医師に相談することを推奨します

# general_移行ガイドライン
source: Migration Guidelines
es: Directrices de migración
ja: 移行ガイドライン

# subscription_広告表示なし
source: 🚫 No ads
es: 🚫 Sin anuncios
ja: 🚫 広告表示なし

# general_伝説バッジ_AI_50回分
source: 👑 Legendary Badge + AI 50 times
es: 👑 Insignia legendaria + IA 50 veces
ja: 👑 伝説バッジ + AI 50回分

# general_東京
source: Tokyo
es: Tokio
ja: 東京

# general_新規予約
source: New Reservation
es: Nueva reserva
ja: 新規予約

# workout_A1_EZバーカール
source: **A1. EZ Bar Curl**
es: **A1. Curl con barra fácil**
ja: **A1. EZバーカール**

# workout_あなたはプロのパーソナルトレーナーです以下の部位をトレーニングするための最適なメニューを提案してくだ
source: You are a professional personal trainer. Please suggest the best exercise routine for the following body parts: [Training Body Parts] ${bodyParts.join(
es: Eres entrenador personal profesional. Sugiere la mejor rutina de entrenamiento para las siguientes partes del cuerpo. [Entrenamiento de partes del cuerpo] ${bodyParts.join(
ja: あなたはプロのパーソナルトレーナーです。以下の部位をトレーニングするための最適なメニューを提案してください。 【トレーニング部位】 ${bodyParts.join(

# general_検索結果_合計_mergedGymslength件_Google_Places_API
source: 🎯 Search results: Total ${mergedGyms.length} (Google Places API)
es: Resultados de la búsqueda: Total ${mergedGyms.length} (API de Google Places)
ja: 🎯 検索結果: 合計 ${mergedGyms.length}件 (Google Places API)

# general_850月
source: \$850/month
es: $850/mes
ja: \$850/月

# subscription_トライアル条件チェックエラー_e
source: ❌ Trial condition check error: $e
es: ❌ Error de verificación de condición de prueba: $e
ja: ❌ トライアル条件チェックエラー: $e

# workout_style_TextStyle_fontSize_11_color_Colorsgreyshade6_2
source: , style: TextStyle( fontSize: 11, color: Colors.grey.shade600, fontStyle: FontStyle.italic, ), ), ), ], ), const SizedBox(height: 16), / Training Level _buildDropdownField( label:
es: , style: TextStyle( fontSize: 11, color: Colors.grey.shade600, fontStyle: FontStyle.italic, ), ), ), ], ), const SizedBox(height: 16), / Nivel de entrenamiento _buildDropdownField( label:
ja: , style: TextStyle( fontSize: 11, color: Colors.grey.shade600, fontStyle: FontStyle.italic, ), ), ), ], ), const SizedBox(height: 16), // トレーニングレベル _buildDropdownField( label:

# workout_プリセットから選択すると素早く設定できます
source: • Select from presets for quick setup.
es: • Seleccione entre los ajustes preestablecidos para una configuración rápida.
ja: • プリセットから選択すると素早く設定できます

# general_上半身の押す動作
source: Upper body pushing movement
es: Movimiento de empuje de la parte superior del cuerpo
ja: 上半身の押す動作

# error_訪問回数取得失敗_e
source: ❌ Failed to get visit count: $e
es: ❌ No se pudo obtener el recuento de visitas: $e
ja: ❌ 訪問回数取得失敗: $e

# profile_バイト配列読み込み中
source: 💾 Loading byte array...
es: 💾 Cargando matriz de bytes...
ja: 💾 バイト配列読み込み中...

# general_ACWR比
source: ACWR ratio
es: Relación ACWR
ja: ACWR比

# general_時間_data
source: ]}, time ${data[
es: ]}, tiempo ${data[
ja: ]}, 時間 ${data[

# general_canEarnCreditFromAd_今月の広告視聴回数_earnedThisMonth3
source: 🔍 [canEarnCreditFromAd] Ad views this month: $earnedThisMonth/3
es: 🔍 [canEarnCreditFromAd] Vistas de anuncios este mes: $earnedThisMonth/3
ja: 🔍 [canEarnCreditFromAd] 今月の広告視聴回数: $earnedThisMonth/3

# general_AI追加パック購入開始_aiAdditionalPackProductId
source: 🛒 Start purchasing the AI additional pack: $aiAdditionalPackProductId
es: 🛒 Comienza a comprar el paquete adicional de IA: $aiAdditionalPackProductId
ja: 🛒 AI追加パック購入開始: $aiAdditionalPackProductId

# general_福岡市
source: Fukuoka City
es: Ciudad de Fukuoka
ja: 福岡市

# subscription_キャッシュクリアエラー_e
source: ⚠️ Cache clearing error: $e
es: ⚠️ Error al borrar caché: $e
ja: ⚠️ キャッシュクリアエラー: $e

# workout_monthlyWorkoutDays日
source: $_monthlyWorkoutDays
es: $_Días de entrenamiento mensuales
ja: $_monthlyWorkoutDays日

# general_最終_daysSince日前
source: Last: $daysSince days ago
es: Último: $daysDesde hace días
ja: 最終: $daysSince日前

# general_有効な重量と回数を入力してください
source: Please enter a valid weight and number of repetitions
es: Por favor, introduzca un peso válido y un número de repeticiones.
ja: 有効な重量と回数を入力してください

# workout_無料プランでは動画広告を視聴することでAI機能を1回利用できます
source: With the free plan, you can use the AI feature once by watching a video ad.
es: Con el plan gratuito, puedes usar la función de IA una vez viendo un anuncio de video.
ja: 無料プランでは、動画広告を視聴することでAI機能を1回利用できます。

# error_Gemini_API_エラー_成長予測_responsestatusCode_responsebod
source: ❌ Gemini API Error (Growth Forecast): ${response.statusCode} - ${response.body}
es: ❌ Error de API de Gemini (pronóstico de crecimiento): ${response.statusCode} - ${response.body}
ja: ❌ Gemini API エラー (成長予測): ${response.statusCode} - ${response.body}

# workout_行i_1のパースエラースキップ_e
source: ⚠️ Parse error (skipped) on line ${i + 1}: $e
es: ⚠️ Error de análisis (omitido) en la línea ${i + 1}: $e
ja: ⚠️ 行${i + 1}のパースエラー（スキップ）: $e

# workout_月間統計読み込み完了_monthlyWorkoutDays日_monthlyTotalSetsセット
source: ✅ Monthly statistics loaded: $_monthlyWorkoutDays days, $_monthlyTotalSets sets
es: ✅ Estadísticas mensuales cargadas: $_monthlyWorkoutDays días, $_monthlyTotalSets conjuntos
ja: ✅ 月間統計読み込み完了: $_monthlyWorkoutDays日, $_monthlyTotalSetsセット

# workout_プレートを計算
source: Calculate the plate
es: Calcular la placa
ja: プレートを計算

# subscription_トライアル有効期限チェックエラー_e
source: ❌ Trial expiration check error: $e
es: ❌ Error de verificación de vencimiento de prueba: $e
ja: ❌ トライアル有効期限チェックエラー: $e

# workout_ダイアログ既に表示中_スキップ
source: ⚠️ Dialog already showing - Skip
es: ⚠️ El cuadro de diálogo ya se muestra - Omitir
ja: ⚠️ ダイアログ既に表示中 - スキップ

# general_Network_接続検出_connectivityResults
source: 🔍 [Network] Connectivity detection: $connectivityResults
es: 🔍 [Red] Detección de conectividad: $connectivityResults
ja: 🔍 [Network] 接続検出: $connectivityResults

# workout_推奨_weightkg_reps回_setsセット
source: ✅ Recommended: ${weight}kg × ${reps} × ${sets}
es: ✅ Recomendado: ${peso}kg × ${repeticiones} × ${series}
ja: ✅ 推奨: ${weight}kg × ${reps}回 × ${sets}セット

# workout_1_種目名_1
source: 1. Event name
es: 1. Nombre del evento
ja: 1. 種目名

# general_ブロック
source: block
es: bloquear
ja: ブロック

# workout_タイマー
source: timer
es: minutero
ja: タイマー

# general_次のトレーニングに最適なタイミングです
source: It's the perfect time for your next workout
es: Es el momento perfecto para tu próximo entrenamiento.
ja: 次のトレーニングに最適なタイミングです

# general_プラトー検出plateauDetected
source: ]} - Plateau detection: ${plateauDetected ?
es: ]} - Detección de meseta: ${plateauDetected ?
ja: ]} ・プラトー検出：${plateauDetected ?

# workout_回_今日の記録が次回の目標になります
source: Today's record will be my next goal.
es: El récord de hoy será mi próximo objetivo.
ja: ]}回 今日の記録が次回の目標になります。

# general_AIクレジット消費_1_残り_newTotal
source: ✅ AI Credits Consumption: -1 (Remaining: $newTotal)
es: ✅ Consumo de créditos de IA: -1 (Restante: $newTotal)
ja: ✅ AIクレジット消費: -1 (残り: $newTotal)

# general_Phase_1機能をすべてリセット
source: Reset all Phase 1 functions
es: Restablecer todas las funciones de la Fase 1
ja: Phase 1機能をすべてリセット

# general_紹介コードを適用しましたAI無料利用3回を獲得
source: 🎉 The referral code has been applied! Get 3 free AI trials!
es: ¡El código de referencia se ha aplicado! ¡Consigue 3 pruebas de IA gratis!
ja: 🎉 紹介コードを適用しました！AI無料利用×3回を獲得！

# profile_利用可能な時間帯
source: Available times
es: Horarios disponibles
ja: 利用可能な時間帯
