Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# personalFactor_PFM値が高いほど同じトレーニングでも疲労度が高くなります
source: The higher the PFM value, the more fatigue you will experience from the same training.
es: Cuanto mayor sea el valor de PFM, más fatiga experimentarás con el mismo entrenamiento.
ja: PFM値が高いほど、同じトレーニングでも疲労度が高くなります。

# general_あなた専用のトレーニングメニューを_AIが科学的に分析します
source: Your personalized training menu will be scientifically analyzed by AI.
es: Tu menú de entrenamiento personalizado será analizado científicamente por IA.
ja: あなた専用のトレーニングメニューを AIが科学的に分析します

# general_バッジ混雑レポーター
source: 🎖️ "Crowd Reporter" badge
es: Insignia de "Reportero de multitudes"
ja: 🎖️ バッジ「混雑レポーター」

# workout_月3回まで広告視聴可能
source: • You can watch ads up to three times a month.
es: • Puedes ver anuncios hasta tres veces al mes.
ja: • 月3回まで広告視聴可能

# workout_トレーニング記録画面への遷移エラー_e
source: ❌ Error transitioning to training record screen: $e
es: ❌ Error al pasar a la pantalla de registro de entrenamiento: $e
ja: ❌ トレーニング記録画面への遷移エラー: $e

# workout_トレーニングを開始_selectedExerciseIndiceslength種目
source: Start training (${_selectedExerciseIndices.length} exercises)
es: Iniciar entrenamiento (${_selectedExerciseIndices.length} ejercicios)
ja: トレーニングを開始 (${_selectedExerciseIndices.length}種目)

# workout_currentStreak日連続
source: $_currentStreak consecutive days
es: $_currentStreak días consecutivos
ja: $_currentStreak日連続

# general_RPEスケール参考
source: RPE scale reference
es: Referencia de la escala RPE
ja: RPEスケール参考

# general_ステップマシン
source: Step Machine
es: Máquina de paso
ja: ステップマシン

# profile_App内課金Apple_App_Storeを通じて支払いが行われます
source: Payment is made via in-app purchase (Apple App Store).
es: El pago se realiza mediante compra dentro de la aplicación (Apple App Store).
ja: App内課金（Apple App Store）を通じて支払いが行われます。

# general_全ジムでリアルタイムデータ提供
source: Real-time data provided at all gyms
es: Datos en tiempo real proporcionados en todos los gimnasios
ja: 全ジムでリアルタイムデータ提供

# profile_Web_画像選択を開始
source: 🖼️ [Web] Start image selection
es: 🖼️ [Web] Iniciar selección de imágenes
ja: 🖼️ [Web] 画像選択を開始

# subscription_キャッシュからプラン取得_cachedPlan
source: 📦 Get a plan from the cache: $cachedPlan
es: 📦 Obtenga un plan del caché: $cachedPlan
ja: 📦 キャッシュからプラン取得: $cachedPlan

# general_統計画像を生成中
source: Generating statistics image...
es: Generando imagen de estadísticas...
ja: 統計画像を生成中...

# general_アンダートレーニング
source: Undertraining
es: Subentrenamiento
ja: アンダートレーニング

# workout_オフ日の保存に失敗しました_e
source: Failed to save off days: $e
es: No se pudieron guardar los días: $e
ja: オフ日の保存に失敗しました: $e

# workout_レスポンスの解析に失敗しました_e
source: Failed to parse response: $e
es: No se pudo analizar la respuesta: $e
ja: レスポンスの解析に失敗しました: $e

# general_membertotalSessions回
source: ${member.totalSessions} times
es: ${member.totalSessions} veces
ja: ${member.totalSessions}回

# error_お気に入り追加エラー_e
source: ❌ Error adding to favorites: $e
es: ❌ Error al agregar a favoritos: $e
ja: ❌ お気に入り追加エラー: $e

# profile_画像選択成功_pickedFilename
source: 📸 Image selected successfully: ${pickedFile.name}
es: 📸 Imagen seleccionada exitosamente: ${pickedFile.name}
ja: 📸 画像選択成功: ${pickedFile.name}

# general_回_効果量ESrecommendedFreq
source: ]} times ・Effect size: ES=${recommendedFreq[
es: ]} veces ・Tamaño del efecto: ES=${recommendedFreq[
ja: ]}回 ・効果量：ES=${recommendedFreq[

# personalFactor_10100の範囲で入力してください
source: Please enter a value between 10 and 100
es: Por favor, introduzca un valor entre 10 y 100
ja: 10〜100の範囲で入力してください

# subscription_トライアル開始エラー_e
source: ❌ Trial start error: $e
es: ❌ Error al iniciar la prueba: $e
ja: ❌ トライアル開始エラー: $e

# workout_30日
source: 30th
es: 30º
ja: 30日

# gym_エニタイムフィットネス_新宿店
source: Anytime Fitness Shinjuku
es: Fitness en cualquier momento Shinjuku
ja: エニタイムフィットネス 新宿店

# profile_CSV形式のファイル
source: CSV format file
es: Archivo en formato CSV
ja: CSV形式のファイル

# profile_予約ボタンは非表示になります
source: The reservation button will be hidden
es: El botón de reserva quedará oculto.
ja: 予約ボタンは非表示になります

# profile_紹介コード_referralCode
source: Referral code: $referralCode
es: Código de referencia: $referralCode
ja: 紹介コード: $referralCode

# workout_WorkoutLogScreen_自動ログイン開始
source: 🔐 [WorkoutLogScreen] Automatic login started...
es: 🔐 [WorkoutLogScreen] Se inició el inicio de sesión automático...
ja: 🔐 [WorkoutLogScreen] 自動ログイン開始...

# general_初PR
source: First PR
es: Primer PR
ja: 初PR

# workout_オフライン保存エラー_e
source: Save Offline Error: $e
es: Error al guardar sin conexión: $e
ja: オフライン保存エラー: $e

# general_今日のトレーニング全体の主観的強度は
source: What was your overall perceived intensity of today's training?
es: ¿Cuál fue la intensidad general percibida del entrenamiento de hoy?
ja: 今日のトレーニング全体の主観的強度は？

# subscription_しますか
source: }Do you want to?
es: }¿Quieres?
ja: }しますか？

# workout_exname_exbodyPart_exweightkg_exreps回_exsetsセット_筋トレ
source: ✅ ${ex.name} (${ex.bodyPart}): ${ex.weight}kg, ${ex.reps}, ${ex.sets} [Strength training]
es: ✅ ${ex.name} (${ex.bodyPart}): ${ex.weight}kg, ${ex.reps}, ${ex.sets} [Entrenamiento de fuerza]
ja: ✅ ${ex.name} (${ex.bodyPart}): ${ex.weight}kg, ${ex.reps}回, ${ex.sets}セット [筋トレ]

# profile_サービス提供時期
source: Service availability
es: Disponibilidad del servicio
ja: サービス提供時期

# general_連続_currentStreak_日
source: $_currentStreak consecutive days
es: $_currentStreak días consecutivos
ja: 連続 $_currentStreak 日

# general_成長停滞プログラム変更を推奨
source: Growth stagnation: Program change recommended
es: Estancamiento del crecimiento: se recomienda un cambio de programa
ja: 成長停滞：プログラム変更を推奨

# workout_d4年d12月d12日
source: (\d{4})Year(\d{1,2})Month(\d{1,2})Day
es: (\d{4})Año(\d{1,2})Mes(\d{1,2})Día
ja: (\d{4})年(\d{1,2})月(\d{1,2})日

# workout_実施メニュー
source: Implementation menu
es: Menú de implementación
ja: 実施メニュー

# general_検索クエリ
source: Search query:
es: Consulta de búsqueda:
ja: 検索クエリ:

# general_ユーザー_userId_の時空間データ更新_ジム_data
source: ✅ Spatiotemporal data update for user $userId: gym ${data[
es: ✅ Actualización de datos espaciotemporales para el usuario $userId: gimnasio ${data[
ja: ✅ ユーザー $userId の時空間データ更新: ジム ${data[

# general_適度に人がいます
source: There are a moderate number of people
es: Hay un número moderado de personas
ja: 適度に人がいます

# workout_統計読み込み完了UI更新
source: ✅ Statistics loading completed (UI updated)
es: ✅ Carga de estadísticas completada (IU actualizada)
ja: ✅ 統計読み込み完了（UI更新）

# general_キャンペーン詳細
source: Campaign details
es: Detalles de la campaña
ja: キャンペーン詳細

# general_達成おめでとう
source: Congratulations on your achievement!
es: ¡Felicitaciones por tu logro!
ja: 達成おめでとう！

# general_300で5回分追加
source: ¥300 for an additional 5 sessions
es: ¥300 por 5 sesiones adicionales
ja: ¥300で5回分追加

# general_ユーザー報告率の安定性確認
source: ✅ Check the stability of user reporting rates
es: ✅ Verificar la estabilidad de las tasas de denuncia de los usuarios.
ja: ✅ ユーザー報告率の安定性確認

# workout_if_canUseAIResultallowed_無料プランでAIクレジットがない場合_if_cur
source: ); if (!canUseAIResult.allowed) { // No AI credits on the free plan if (currentPlan == SubscriptionType.free) { // Check if rewarded ads can earn credits final canEarnFromAd = await creditService.canEarnCreditFromAd(); debugPrint(
es: ); if (!canUseAIResult.allowed) { // No hay créditos de IA en el plan gratuito if (currentPlan == SubscriptionType.free) { // Verificar si los anuncios con recompensa pueden generar créditos final canEarnFromAd = await creditService.canEarnCreditFromAd(); debugPrint(
ja: ); if (!canUseAIResult.allowed) { // 無料プランでAIクレジットがない場合 if (currentPlan == SubscriptionType.free) { // リワード広告で獲得可能かチェック final canEarnFromAd = await creditService.canEarnCreditFromAd(); debugPrint(

# profile_Proプラン_広告非表示AI機能月30回利用可能
source: • Pro plan: No ads, AI features available 30 times per month
es: • Plan Pro: Sin anuncios, funciones de IA disponibles 30 veces al mes
ja: • Proプラン: 広告非表示、AI機能月30回利用可能

# general_不明なジム
source: Unknown Gym
es: Gimnasio desconocido
ja: 不明なジム

# workout_推奨曜日とメニュー提案を表示
source: View recommended days and menu suggestions
es: Ver días recomendados y sugerencias de menú
ja: 推奨曜日とメニュー提案を表示

# subscription_プレミアムトライアル中残りremainingDays日
source: 🎁 Premium trial in progress (${remainingDays} days remaining)
es: Prueba premium en curso (${remainingDays} días restantes)
ja: 🎁 プレミアムトライアル中（残り${remainingDays}日）

# workout_IMPORT_既にインポート処理中です
source: ⚠️ [IMPORT] Importing is already in progress
es: ⚠️ [IMPORTACIÓN] La importación ya está en curso
ja: ⚠️ [IMPORT] 既にインポート処理中です

# general_ROI計算と経営判断
source: ✅ ROI calculation and business decisions
es: ✅ Cálculo del ROI y decisiones de negocio
ja: ✅ ROI計算と経営判断

# general_ビルドモード_kReleaseMode_1
source: 🎬 Build mode: ${kReleaseMode ?
es: 🎬 Modo de compilación: ${kReleaseMode ?
ja: 🎬 ビルドモード: ${kReleaseMode ?

# general_バー重量
source: Bar Weight
es: Peso de la barra
ja: バー重量

# gym_entrykey_entryvalue台
source: ${entry.key} × ${entry.value} level
es: ${entry.key} × ${entry.value} nivel
ja: ${entry.key} × ${entry.value}台

# general_背
source: back
es: atrás
ja: 背

# error_ログインエラー_e
source: ❌ Login Error: $e
es: ❌ Error de inicio de sesión: $e
ja: ❌ ログインエラー: $e

# error_GPS取得失敗_デフォルト位置東京駅で検索
source: ⚠️ GPS acquisition failed → Search at default location (Tokyo Station)
es: ⚠️ Error en la adquisición de GPS → Buscar en la ubicación predeterminada (estación de Tokio)
ja: ⚠️ GPS取得失敗 → デフォルト位置（東京駅）で検索

# subscription_トレーニング記録
source: 📝 Training Record
es: 📝 Registro de entrenamiento
ja: 📝 トレーニング記録

# general_App_Storeを開けませんでした
source: Could not open App Store
es: No se pudo abrir la App Store
ja: App Storeを開けませんでした

# gym_施設設備
source: Facilities
es: Instalaciones
ja: 施設・設備

# workout_広告を読み込んでいます
source: Loading ads...
es: Cargando anuncios...
ja: 広告を読み込んでいます...

# general_あとで
source: later
es: más tarde
ja: あとで

# workout_使用回数_templateusageCount回
source: Usage count: ${template.usageCount} times
es: Recuento de uso: ${template.usageCount} veces
ja: 使用回数: ${template.usageCount}回

# general_最大努力
source: maximum effort
es: esfuerzo supremo
ja: 最大努力

# error_購入処理エラー_e
source: ❌ Purchase processing error: $e
es: ❌ Error al procesar la compra: $e
ja: ❌ 購入処理エラー: $e

# general_ビギナーリフター
source: Beginner Lifter
es: Levantador principiante
ja: ビギナーリフター

# workout_AI生成_広告視聴可能_canEarnFromAd
source: 🔍 [AI-generated] Can Earn From Ads: $canEarnFromAd
es: 🔍 [Generado por IA] Puede ganar dinero con anuncios: $canEarnFromAd
ja: 🔍 [AI生成] 広告視聴可能: $canEarnFromAd

# workout_月間統計クエリ開始
source: 📊 Monthly statistics query started...
es: 📊 Consulta de estadísticas mensuales iniciada...
ja: 📊 月間統計クエリ開始...

# workout_IMPORT_データ取り込み処理開始
source: 🔄 [IMPORT] Data import process started...
es: 🔄 [IMPORTACIÓN] Proceso de importación de datos iniciado...
ja: 🔄 [IMPORT] データ取り込み処理開始...

# general_担当トレーナー
source: Trainer in charge
es: Entrenador a cargo
ja: 担当トレーナー

# general_パワー向上
source: Power Increase
es: Aumento de potencia
ja: パワー向上

# general_App_Store_を開きました
source: ✅ Opened the App Store
es: ✅ Abrió la App Store
ja: ✅ App Store を開きました

# general_同期待ちデータ_pendingCount件
source: 📤 Data waiting to be synchronized: $pendingCount
es: 📤 Datos en espera de ser sincronizados: $pendingCount
ja: 📤 同期待ちデータ: $pendingCount件

# subscription_13ヶ月の一時停止で料金を抑えられます
source: Pause for 1-3 months to reduce costs
es: Pausa de 1 a 3 meses para ahorrar dinero
ja: 1-3ヶ月の一時停止で料金を抑えられます

# general_gymname_をお気に入りから削除しました
source: ${gym.name} has been removed from your favorites
es: ${gym.name} ha sido eliminado de tus favoritos
ja: ${gym.name} をお気に入りから削除しました

# workout_トレーニング記録完了_匿名認証成功
source: ✅ Training recording completed: Anonymous authentication successful
es: ✅ Grabación de entrenamiento completada: Autenticación anónima exitosa
ja: ✅ トレーニング記録完了: 匿名認証成功

# general_全ジムでリアルタイム更新
source: ✅ Real-time updates for all gyms
es: ✅ Actualizaciones en tiempo real para todos los gimnasios
ja: ✅ 全ジムでリアルタイム更新

# profile_画像の読み込みに失敗しました_e
source: Image loading failed $e
es: Error al cargar la imagen $e
ja: 画像の読み込みに失敗しました $e

# general_初めての自己記録更新
source: First personal record
es: Primer récord personal
ja: 初めての自己記録更新

# general_後ほど再度お試しください
source: Please try again later.
es: Por favor, inténtelo de nuevo más tarde.
ja: 後ほど再度お試しください。

# subscription_プロプラン
source: Pro Plan
es: Plan Pro
ja: プロプラン

# gym_平日_7002330_土日_10002000
source: Weekdays 7:00-23:30, Saturdays and Sundays 10:00-20:00
es: Días laborables 7:00-23:30, sábados y domingos 10:00-20:00
ja: 平日 7:00-23:30, 土日 10:00-20:00

# workout_前回_dateStr_weightkg_reps秒
source: Last time $dateStr: ${weight}kg × ${reps} seconds
es: Última vez $dateStr: ${weight}kg × ${reps} segundos
ja: 前回 $dateStr: ${weight}kg × ${reps}秒

# general_クイックスタート作成成功_templateName
source: ✅ Quickstart created successfully: $templateName
es: ✅ Inicio rápido creado exitosamente: $templateName
ja: ✅ クイックスタート作成成功: $templateName

# workout_履歴表示
source: 📜 View History
es: 📜 Ver historial
ja: 📜 履歴表示

# workout_時間HIIT形式sds分
source: (?:hours|HIIT format)[::]?\s*(\d+)\s*minutes
es: (?:horas|formato HIIT)[::]?\s*(\d+)\s*minutos
ja: (?:時間|HIIT形式)[:：]?\s*(\d+)\s*分

# workout_更新_DateFormat
source: Update: ${DateFormat(
es: Actualización: ${DateFormat(
ja: 更新: ${DateFormat(

# general_as_Listlength_0セット
source: ] as List?)?.length ?? 0} set
es: ] como Lista?)?.length ?? 0} conjunto
ja: ] as List?)?.length ?? 0}セット

# error_Network_チェックエラー_e
source: 📴 [Network] Check error: $e
es: 📴 [Red] Error de comprobación: $e
ja: 📴 [Network] チェックエラー: $e

# general_実際の総重量
source: Actual Total Weight
es: Peso total real
ja: 実際の総重量

# subscription_無料プラン_AI追加パック3005回なら必要な機能だけ使えます
source: Free plan + AI add-on pack (¥300/5 times) allows you to use only the functions you need
es: El plan gratuito + paquete complementario de IA (¥300/5 veces) le permite usar solo las funciones que necesita
ja: 無料プラン + AI追加パック（¥300/5回）なら必要な機能だけ使えます

# subscription_復元可能な購入履歴がありませんでした
source: No purchase history available to restore
es: No hay historial de compras disponible para restaurar
ja: 復元可能な購入履歴がありませんでした

# general_ケーブルマシン
source: Cable machine
es: Máquina de cable
ja: ケーブルマシン

# general_7日連続達成
source: Achieved for 7 consecutive days!
es: ¡Logrado durante 7 días consecutivos!
ja: 7日連続達成！

# general_週suggestedChangeセット追加でsuggestedChange_037toStringA
source: Expected growth of +${(suggestedChange * 0.37).toStringAsFixed(1)}% for every ${suggestedChange} set added per week (Schoenfeld 2017)
es: Crecimiento esperado de +${(suggestedChange * 0.37).toStringAsFixed(1)}% por cada ${suggestedChange} conjunto agregado por semana (Schoenfeld 2017)
ja: 週${suggestedChange}セット追加で、+${(suggestedChange * 0.37).toStringAsFixed(1)}%の成長期待（Schoenfeld 2017）

# workout_style_TextStyle_fontSize_11_color_Colorsgreyshade6
source: , style: TextStyle( fontSize: 11, color: Colors.grey.shade600, fontStyle: FontStyle.italic, ), ), ), ], ), const SizedBox(height: 16), // 🆕 v1.0.230: RPE (Perceived Perception of Exercise) Slider Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ _buildSliderField( label:
es: , style: TextStyle( fontSize: 11, color: Colors.grey.shade600, fontStyle: FontStyle.italic, ), ), ), ], ), const SizedBox(height: 16), // 🆕 v1.0.230: Control deslizante de RPE (Percepción del Ejercicio) Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ _buildSliderField( label:
ja: , style: TextStyle( fontSize: 11, color: Colors.grey.shade600, fontStyle: FontStyle.italic, ), ), ), ], ), const SizedBox(height: 16), // 🆕 v1.0.230: RPE（自覚的強度）スライダー Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ _buildSliderField( label:

# general_習慣の達人
source: Master of Habits
es: Maestro de hábitos
ja: 習慣の達人

# workout_weeklyTotalSetsセット
source: $_weeklyTotalSets set
es: $_weeklyTotalSets conjunto
ja: $_weeklyTotalSetsセット

# error_バッジ統計の読み込みエラー_e
source: ❌ Error loading badge statistics: $e
es: ❌ Error al cargar las estadísticas de la insignia: $e
ja: ❌ バッジ統計の読み込みエラー: $e

# general_recoveryHours時間以上
source: More than ${recoveryHours} hours
es: Más de ${recoveryHours} horas
ja: ${recoveryHours}時間以上

# general_混雑度アラート送信_gymName_レベル_crowdLevel
source: ✅ Send crowd alert: $gymName (Level: $crowdLevel)
es: ✅ Enviar alerta de multitud: $gymName (Nivel: $crowdLevel)
ja: ✅ 混雑度アラート送信: $gymName (レベル: $crowdLevel)

# general_部位別トレーニング
source: Body Part Training
es: Entrenamiento de partes del cuerpo
ja: 部位別トレーニング

# workout_週間統計読み込み完了_weeklyWorkoutDays日_weeklyTotalSetsセット_w
source: ✅ Weekly statistics loaded: $_weeklyWorkoutDays days, $_weeklyTotalSets sets, $_weeklyTotalMinutes minutes
es: ✅ Estadísticas semanales cargadas: $_weeklyWorkoutDays días, $_weeklyTotalSets series, $_weeklyTotalMinutes minutos
ja: ✅ 週間統計読み込み完了: $_weeklyWorkoutDays日, $_weeklyTotalSetsセット, $_weeklyTotalMinutes分

# subscription_AI機能月3回
source: 🤖 AI function 3 times a month
es: 🤖 Función de IA 3 veces al mes
ja: 🤖 AI機能月3回

# profile_お気に入りジムの更新通知
source: Favorite gym update notifications
es: Notificaciones de actualizaciones de gimnasios favoritos
ja: お気に入りジムの更新通知

# general_投稿しましたbenefit獲得
source: ✅ Posted (earned $benefit)
es: ✅ Publicado (ganó $beneficio)
ja: ✅ 投稿しました（$benefit獲得）

# general_リワード広告リトライ_retryAttempt_maxRetryAttempt
source: 🔄 Rewarded Ad Retry: $_retryAttempt/$_maxRetryAttempt
es: 🔄 Reintento de anuncio recompensado: $_retryAttempt/$_maxRetryAttempt
ja: 🔄 リワード広告リトライ: $_retryAttempt/$_maxRetryAttempt

# gym_本文を入力してください
source: Please enter the text
es: Por favor, introduzca el texto
ja: 本文を入力してください

# general_旅館
source: Inn
es: Posada
ja: 旅館

# subscription_プレミアムプラン_7日間無料
source: ✨ Premium plan 7 days free
es: ✨ Plan Premium 7 días gratis
ja: ✨ プレミアムプラン 7日間無料

# general_基礎分析_baseAdvice
source: [Basic analysis] $baseAdvice
es: [Análisis básico] $baseAdvice
ja: 【基礎分析】 $baseAdvice

# general_パートナーリクエスト機能
source: Partner Request Feature
es: Función de solicitud de socio
ja: パートナーリクエスト機能

# personalFactor_タンパク質摂取量を入力してください
source: Enter your protein intake
es: Ingrese su ingesta de proteínas
ja: タンパク質摂取量を入力してください

# general_ℹ_お気に入りジムなし
source: ℹ️ No favorite gym
es: ℹ️ No tengo gimnasio favorito
ja: ℹ️ お気に入りジムなし

# workout_日付_date
source: Date: $date
es: Fecha: $date
ja: 日付: $date

# general_初回ワークアウト_firstWorkoutDateyearfirstWorkoutDatemonth
source: 📅 First Workout: ${firstWorkoutDate.year}/${firstWorkoutDate.month}/${firstWorkoutDate.day}
es: 📅 Primer entrenamiento: ${firstWorkoutDate.year}/${firstWorkoutDate.month}/${firstWorkoutDate.day}
ja: 📅 初回ワークアウト: ${firstWorkoutDate.year}/${firstWorkoutDate.month}/${firstWorkoutDate.day}

# profile_返金申請方法
source: How to request a refund:
es: Cómo solicitar un reembolso:
ja: 返金申請方法：

# general_会話が見つかりません
source: Conversation not found
es: Conversación no encontrada
ja: 会話が見つかりません

# subscription_targetPlanName_に変更
source: Change to $targetPlanName
es: Cambiar a $targetPlanName
ja: $targetPlanName に変更

# general_recoveryHours時間
source: ${recoveryHours} hours
es: ${recoveryHours} horas
ja: ${recoveryHours}時間

# general_大分
source: Oita
ja: 大分

# general_AI機能1回分を獲得しました残りremaining回
source: 🎁 You've earned 1 AI feature! (${remaining} remaining)
es: ¡Has ganado 1 función de IA! (${remaining} restantes)
ja: 🎁 AI機能1回分を獲得しました！(残り${remaining}回)

# general_統計推定とユーザー報告でコストゼロ運用
source: Zero-cost operation with statistical estimation and user reports
es: Operación de costo cero con estimación estadística e informes de usuario
ja: 統計推定とユーザー報告でコストゼロ運用

# general_Proユーザーのみ表示中
source: Displayed only for Pro users
es: Se muestra solo para usuarios Pro
ja: Proユーザーのみ表示中

# profile_自動更新を停止しない限り毎月自動的に課金されます
source: • You will be automatically charged every month unless you turn off auto-renewal.
es: • Se le cobrará automáticamente cada mes a menos que desactive la renovación automática.
ja: • 自動更新を停止しない限り、毎月自動的に課金されます

# subscription_プランを選択
source: Choose a plan
es: Elige un plan
ja: プランを選択

# general_本日の利用上限MAX_AI_CALLS_PER_DAY回に達しました_明日またご利用ください
source: You have reached today's usage limit (${MAX_AI_CALLS_PER_DAY}). Please try again tomorrow.
es: Has alcanzado el límite de uso de hoy (${MAX_AI_CALLS_PER_DAY}). Inténtalo de nuevo mañana.
ja: 本日の利用上限（${MAX_AI_CALLS_PER_DAY}回）に達しました。 明日またご利用ください。

# gym_本格マシン
source: Full-scale machine
es: Máquina a escala real
ja: 本格マシン

# general_weight_分
source: $weight minutes
es: $peso minutos
ja: $weight 分

# general_重要_週recommendedFreq
source: ]} 【important】 "Week${recommendedFreq[
es: ]} 【Importante】 "Semana${FrecuenciaRecomendada[
ja: ]} 【重要】 「週${recommendedFreq[

# general_データマッピング開始
source: 🔄 Data mapping begins...
es: 🔄 Comienza el mapeo de datos...
ja: 🔄 データマッピング開始...

# error_クーポン発行エラー_e
source: ❌ Coupon issuance error: $e
es: ❌ Error de emisión de cupón: $e
ja: ❌ クーポン発行エラー: $e

# workout_ダイアログ閉じる_フラグクリア
source: ✅ Close dialog - Clear flag
es: ✅ Cerrar diálogo - Borrar bandera
ja: ✅ ダイアログ閉じる - フラグクリア

# general_あなたのlevel_レベルでは月monthlyRate_100roundの成長が期待できます
source: At your $level level, you can expect growth of +${(monthlyRate * 100).round()}% per month.
es: En su nivel $level, puede esperar un crecimiento de +${(monthlyRate * 100).round()}% por mes.
ja: あなたの$level レベルでは、月+${(monthlyRate * 100).round()}%の成長が期待できます。

# gym_駐車場
source: parking
es: aparcamiento
ja: 駐車場

# workout_weeklyWorkoutDays日
source: $_weeklyWorkoutDays
es: $_díasdeentrenamientosemanales
ja: $_weeklyWorkoutDays日

# profile_グローバル展開中
source: Global expansion in progress
es: Expansión global en curso
ja: グローバル展開中

# general_100_300万円月
source: 1-3 million yen/month
es: 1-3 millones de yenes al mes
ja: 100 - 300万円/月

# general_entryvalue枚
source: × ${entry.value}
es: × ${entrada.valor}
ja: × ${entry.value}枚

# workout_種目キー_lastWorkoutDatakeystoList
source: 🔑 Exercise Key: ${_lastWorkoutData.keys.toList()}
es: 🔑 Clave de ejercicio: ${_lastWorkoutData.keys.toList()}
ja: 🔑 種目キー: ${_lastWorkoutData.keys.toList()}

# general_SNSアプリで投稿
source: Posting via SNS app
es: Publicación a través de la aplicación SNS
ja: SNSアプリで投稿

# workout_WorkoutLogScreen_Firebase確認中
source: 📱 [WorkoutLogScreen] Checking Firebase...
es: 📱 [WorkoutLogScreen] Comprobando Firebase...
ja: 📱 [WorkoutLogScreen] Firebase確認中...

# workout_自重_reps_reps
source: Dead weight × $reps reps
es: Peso muerto × $ repeticiones repeticiones
ja: 自重 × $reps reps

# workout_if_canEarnFromAd_Step_3_リワード広告ダイアログ表示_final_should
source: ); if (canEarnFromAd) { // ========================================= // 📺 Step 3: Display the rewarded ad dialog // ========================================== final shouldShowAd = await _showRewardAdDialog(); if (shouldShowAd == true) { // Show the ad and earn credits final adSuccess = await _showRewardAdAndEarn(); if (!adSuccess) { // Ad display failed if (mounted) { ScaffoldMessenger.of(context).showSnackBar( SnackBar( content: Text(
es: ); if (canEarnFromAd) { // =========================================== // 📺 Paso 3: Mostrar el cuadro de diálogo del anuncio con recompensa // ============================================= final shouldShowAd = await _showRewardAdDialog(); if (shouldShowAd == true) { // Mostrar el anuncio y ganar créditos final adSuccess = await _showRewardAdAndEarn(); if (!adSuccess) { // Error en la visualización del anuncio if (mounted) { ScaffoldMessenger.of(context).showSnackBar( SnackBar( content: Text(
ja: ); if (canEarnFromAd) { // ======================================== // 📺 Step 3: リワード広告ダイアログ表示 // ======================================== final shouldShowAd = await _showRewardAdDialog(); if (shouldShowAd == true) { // 広告を表示してクレジット獲得 final adSuccess = await _showRewardAdAndEarn(); if (!adSuccess) { // 広告表示失敗 if (mounted) { ScaffoldMessenger.of(context).showSnackBar( SnackBar( content: Text(

# workout_AI生成完了_statusMessage
source: AI generation complete! ($statusMessage)
es: ¡Generación de IA completada! ($statusMessage)
ja: AI生成完了! ($statusMessage)

# workout_ワークアウトメモ_匿名認証成功
source: ✅ Workout Memo: Anonymous authentication successful
es: ✅ Memo de entrenamiento: Autenticación anónima exitosa
ja: ✅ ワークアウトメモ: 匿名認証成功

# workout_この計算はEpley式を使用しています
source: • This calculation uses the Epley formula.
es: • Este cálculo utiliza la fórmula de Epley.
ja: • この計算はEpley式を使用しています
