Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# subscription_解約前に1ヶ月の一時停止を試してみませんか
source: Why not try pausing for a month before cancelling?
es: ¿Por qué no intentar hacer una pausa de un mes antes de cancelar?
ja: 解約前に1ヶ月の一時停止を試してみませんか？

# workout_as_List_return_Column_crossAxisAlignment_CrossAxis
source: ] as List; return Column( crossAxisAlignment: CrossAxisAlignment.stretch, children: [ // Prediction result summary Card( color: Colors.green.shade50, child: Padding( padding: const EdgeInsets.all(20.0), child: Column( children: [ Icon( Icons.trending_up, size: 48, color: Colors.green.shade700, ), SizedBox(height: 16), Text(AppLocalizations.of(context)!.fourMonthPrediction, style: TextStyle( fontSize: 16, color: Colors.grey, ), ), const SizedBox(height: 8), Text(
es: ] como Lista; devuelve Columna( crossAxisAlignment: CrossAxisAlignment.stretch, hijos: [ // Resumen del resultado de la predicción Card( color: Colors.green.shade50, hijo: Padding( padding: const EdgeInsets.all(20.0), hijo: Columna( hijos: [ Icono( Iconos.trending_up, tamaño: 48, color: Colors.green.shade700, ), SizedBox(altura: 16), Texto(AppLocalizations.of(context)!.fourMonthPrediction, estilo: TextStyle( fontSize: 16, color: Colors.grey, ), ), const SizedBox(altura: 8), Texto(
ja: ] as List; return Column( crossAxisAlignment: CrossAxisAlignment.stretch, children: [ // 予測結果サマリー Card( color: Colors.green.shade50, child: Padding( padding: const EdgeInsets.all(20.0), child: Column( children: [ Icon( Icons.trending_up, size: 48, color: Colors.green.shade700, ), SizedBox(height: 16), Text(AppLocalizations.of(context)!.fourMonthPrediction, style: TextStyle( fontSize: 16, color: Colors.grey, ), ), const SizedBox(height: 8), Text(

# error_POデータの取得に失敗しました
source: Failed to get PO data
es: No se pudieron obtener los datos del pedido
ja: POデータの取得に失敗しました

# gym_テニス
source: tennis
es: tenis
ja: テニス

# general_急性負荷_7日
source: Acute load (7 days)
es: Carga aguda (7 días)
ja: 急性負荷 (7日)

# general_体重記録読み込み完了_measurementslength件
source: ✅ Weight records loaded: ${_measurements.length}
es: ✅ Registros de peso cargados: ${_measurements.length}
ja: ✅ 体重記録読み込み完了: ${_measurements.length}件

# general_不明なユーザー
source: Unknown user
es: Usuario desconocido
ja: 不明なユーザー

# subscription_トレーニングパートナー検索
source: Find a training partner
es: Encuentra un compañero de entrenamiento
ja: トレーニングパートナー検索

# profile_Apple_App_Store決済App内課金
source: Apple App Store Payments (In-App Purchases)
es: Pagos en la App Store de Apple (Compras dentro de la aplicación)
ja: Apple App Store決済（App内課金）

# workout_PR達成チェックエラー_e
source: ❌ PR achievement check error: $e
es: ❌ Error en la verificación de logro de relaciones públicas: $e
ja: ❌ PR達成チェックエラー: $e

# general_お気に入り読み込み完了_gymslength件
source: ✅ Loaded favorites: ${gyms.length}
es: ✅ Favoritos cargados: ${gyms.length}
ja: ✅ お気に入り読み込み完了: ${gyms.length}件

# workout_パフォーマンスを最大化し怪我のリスクを最小化します
source: Maximize performance and minimize risk of injury.
es: Maximice el rendimiento y minimice el riesgo de lesiones.
ja: パフォーマンスを最大化し、怪我のリスクを最小化します。

# general_3648時間
source: 36-48 hours
es: 36-48 horas
ja: 36-48時間

# workout_承認して取り込む
source: Approve and import
es: Aprobar e importar
ja: 承認して取り込む

# workout_パーサー開始_全lineslength行を処理
source: 🔍 Parser Start: Process all ${lines.length} lines
es: Inicio del analizador: procesa todas las ${lines.length} líneas
ja: 🔍 パーサー開始: 全${lines.length}行を処理

# general_メッセージを送信しましょう
source: Send a message
es: Enviar un mensaje
ja: メッセージを送信しましょう

# general_残りgoaldaysRemaining日
source: ${goal.daysRemaining} days remaining
es: ${goal.daysRemaining} días restantes
ja: 残り${goal.daysRemaining}日

# subscription_永年プランチェックエラー_e
source: ⚠️ Permanent plan check error: $e
es: ⚠️ Error de verificación de plan permanente: $e
ja: ⚠️ 永年プランチェックエラー: $e

# general_緑小路
source: Midori Alley
es: Callejón Midori
ja: 緑小路

# general_最終セッションから2週間以上経過
source: More than two weeks have passed since the last session
es: Han pasado más de dos semanas desde la última sesión
ja: 最終セッションから2週間以上経過

# profile_本規約に関するお問い合わせは以下の連絡先までお願いいたします
source: For inquiries regarding these Terms and Conditions, please contact us at the following address:
es: Para consultas sobre estos Términos y Condiciones, contáctenos a la siguiente dirección:
ja: 本規約に関するお問い合わせは、以下の連絡先までお願いいたします。

# general_1RM計算機
source: 1RM calculator
es: Calculadora de 1RM
ja: 1RM計算機

# workout_期間開始_weekStart
source: Period start: $weekStart
es: Inicio del período: $weekStart
ja: 期間開始: $weekStart

# workout_reporttotalWorkouts回
source: ${report.totalWorkouts} times
es: ${report.totalWorkouts} veces
ja: ${report.totalWorkouts}回

# error_PR保存エラー_e
source: ❌ PR save error: $e
es: ❌ Error al guardar PR: $e
ja: ❌ PR保存エラー: $e

# general_ページ_currentPage_totalPages
source: Pages $_currentPage / $_totalPages
es: Páginas $_currentPage / $_totalPages
ja: ページ $_currentPage / $_totalPages

# subscription_メモリキャッシュ期限切れ_再取得
source: ⏰ Memory cache expired - re-fetch
es: ⏰ La memoria caché ha expirado: vuelva a buscarla
ja: ⏰ メモリキャッシュ期限切れ - 再取得

# subscription_トライアル自動アクティベートエラー_e
source: ❌ Trial auto-activation error: $e
es: ❌ Error de activación automática de prueba: $e
ja: ❌ トライアル自動アクティベートエラー: $e

# workout_より詳細な提案が必要な場合は後ほど再度お試しください
source: 💡 If you need more detailed suggestions, please try again later.
es: 💡 Si necesita sugerencias más detalladas, inténtelo de nuevo más tarde.
ja: 💡 より詳細な提案が必要な場合は、後ほど再度お試しください。

# general_目標値を更新しました
source: Target values have been updated
es: Se han actualizado los valores objetivo
ja: 目標値を更新しました

# workout_reporttotalWorkouts回_reporttotalMinutes分
source: ${report.totalWorkouts} times • ${report.totalMinutes} minutes
es: ${report.totalWorkouts} veces • ${report.totalMinutes} minutos
ja: ${report.totalWorkouts}回 • ${report.totalMinutes}分

# workout_履歴データ_exerciseHistorykeyslength種目
source: 📊 History data: ${exerciseHistory.keys.length} exercises
es: 📊 Datos del historial: ${exerciseHistory.keys.length} ejercicios
ja: 📊 履歴データ: ${exerciseHistory.keys.length}種目

# general_紹介ボーナスAIクレジット消費_1_残り_referralBonusCredits_1
source: ✅ Referral Bonus AI Credits consumed: -1 (Remaining: ${referralBonusCredits - 1})
es: ✅ Créditos de IA de bonificación por recomendación consumidos: -1 (Restantes: ${referralBonusCredits - 1})
ja: ✅ 紹介ボーナスAIクレジット消費: -1 (残り: ${referralBonusCredits - 1})

# general_あなたの招待コード
source: Your invitation code
es: Tu código de invitación
ja: あなたの招待コード

# gym_ラウンジ
source: Lounge
es: Salón
ja: ラウンジ

# workout_ハード
source: hard
es: duro
ja: ハード

# general_トレーニングを記録して_AIがあなた専用のメニューを提案します
source: Record your training and let AI suggest a personalized workout plan.
es: Registra tu entrenamiento y deja que la IA te sugiera un plan de entrenamiento personalizado.
ja: トレーニングを記録して、 AIがあなた専用のメニューを提案します

# workout_トレーナー記録取得完了_recordslength件
source: ✅ Trainer records acquired: ${records.length}
es: ✅ Registros de entrenador adquiridos: ${records.length}
ja: ✅ トレーナー記録取得完了: ${records.length}件

# subscription_無料プランでも基本機能は使えます
source: Basic features are available even with the free plan
es: Las funciones básicas están disponibles incluso con el plan gratuito
ja: 無料プランでも基本機能は使えます

# error_目標の読み込みに失敗しました_e
source: Failed to load goal: $e
es: No se pudo cargar el objetivo: $e
ja: 目標の読み込みに失敗しました: $e

# error_広告の表示に失敗しましたしばらく待ってからお試しください
source: Ad display failed. Please wait a while and try again.
es: Error al mostrar el anuncio. Espere un momento y vuelva a intentarlo.
ja: 広告の表示に失敗しました。しばらく待ってからお試しください。

# error_画像読み込みエラー_e
source: ❌ Image loading error: $e
es: ❌ Error al cargar la imagen: $e
ja: ❌ 画像読み込みエラー: $e

# general_少し人がいますが余裕があります
source: There are a few people, but there is plenty of room.
es: Hay poca gente, pero hay mucho espacio.
ja: 少し人がいますが、余裕があります

# general_申請中
source: Currently applying
es: Actualmente aplicando
ja: 申請中

# general_上級者には有効
source: Effective for advanced users
es: Eficaz para usuarios avanzados
ja: 上級者には有効

# general_福井
source: Fukui
ja: 福井

# gym_混雑度情報
source: Congestion information
es: Información sobre congestión
ja: 混雑度情報

# general_1_まだトレーニングを記録していない
source: 1. You haven't logged a workout yet
es: 1. Aún no has registrado un entrenamiento
ja: 1. まだトレーニングを記録していない

# workout_style_TextStyle_fontSize_16_fontWeight_FontWeightb_1
source: , style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, ), ), const SizedBox(height: 16), / 🆕 Phase 7.5: Age Display (Automatically Obtained) _buildAgeDisplay(), const SizedBox(height: 16), / Target Body Part _buildDropdownField( label:
es: , style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, ), ), const SizedBox(height: 16), / 🆕 Fase 7.5: Visualización de la edad (Obtenida automáticamente) _buildAgeDisplay(), const SizedBox(height: 16), / Parte del cuerpo objetivo _buildDropdownField( label:
ja: , style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, ), ), const SizedBox(height: 16), // 🆕 Phase 7.5: 年齢表示（自動取得） _buildAgeDisplay(), const SizedBox(height: 16), // 対象部位 _buildDropdownField( label:

# workout_Gemini_APIでメニュー生成開始_bodyPartsjoin
source: 🤖 Start generating menus with Gemini API: ${bodyParts.join(
es: 🤖 Comienza a generar menús con la API de Gemini: ${bodyParts.join(
ja: 🤖 Gemini APIでメニュー生成開始: ${bodyParts.join(

# general_鍋島
source: Nabeshima
ja: 鍋島

# general_ボット的な利用パターンが検出されました
source: Bot-like usage patterns detected.
es: Se detectaron patrones de uso similares a bots.
ja: ボット的な利用パターンが検出されました。

# general_データ構造サンプル
source: 📋 Data structure example:
es: Ejemplo de estructura de datos:
ja: 📋 データ構造サンプル:

# general_すごいマイルストーン達成です_この調子で続けていきましょう
source: Wow! A milestone achieved! Let's keep it up! 💪
es: ¡Guau! ¡Un logro alcanzado! ¡Sigamos así! 💪
ja: すごい！マイルストーン達成です！ この調子で続けていきましょう！💪

# general_相手からあなたのプロフィールが見られなくなります
source: • They will no longer be able to see your profile
es: • Ya no podrán ver tu perfil
ja: • 相手からあなたのプロフィールが見られなくなります

# general_このアカウントは無効化されています
source: This account has been deactivated
es: Esta cuenta ha sido desactivada
ja: このアカウントは無効化されています

# workout_periodの成長
source: Growth of ${period}
es: Crecimiento de ${periodo}
ja: ${period}の成長

# workout_現在_label
source: Current ($label)
es: Actual ($label)
ja: 現在 ($label)

# error_混雑度アラート監視開始エラー_e
source: ❌ Error starting congestion alert monitoring: $e
es: ❌ Error al iniciar el monitoreo de alertas de congestión: $e
ja: ❌ 混雑度アラート監視開始エラー: $e

# workout_6090分で完了_languageInstruction_重要_各種目に具体的な重量と回数を必ず記載
source: } - Complete in 60-90 minutes - $languageInstruction **Important: Be sure to enter the specific weight and repetitions for each exercise. For aerobic exercise, enter the weight as 0kg and the time as XX minutes.** ${targetParts.contains(AppLocalizations.of(context)!.exerciseCardio) ?
es: } - Completar en 60-90 minutos - $languageInstruction **Importante: Asegúrate de introducir el peso y las repeticiones específicas para cada ejercicio. Para ejercicios aeróbicos, introduce el peso como 0 kg y el tiempo como XX minutos.** ${targetParts.contains(AppLocalizations.of(context)!.exerciseCardio) ?
ja: } - 60-90分で完了 - $languageInstruction **重要: 各種目に具体的な重量と回数を必ず記載してください。有酸素運動の場合は重量0kg、時間をXX分形式で記載してください。** ${targetParts.contains(AppLocalizations.of(context)!.exerciseCardio) ?

# subscription_残り_remaininginDays日
source: ✅ Remaining: ${remaining.inDays} days
es: ✅ Restante: ${remaining.inDays} días
ja: ✅ 残り: ${remaining.inDays}日

# subscription_subscriptionServicegetPlanNamenewPlanに変更しました
source: Changed to ${_subscriptionService.getPlanName(newPlan)}!
es: ¡Cambiado a ${_subscriptionService.getPlanName(newPlan)}!
ja: ${_subscriptionService.getPlanName(newPlan)}に変更しました！

# general_リワード広告読み込み成功
source: ✅ Rewarded ads loaded successfully
es: ✅ Anuncios recompensados cargados exitosamente
ja: ✅ リワード広告読み込み成功

# profile_GYM_MATCHへようこそ
source: WELCOME TO GYM MATCH
es: BIENVENIDO A GYM MATCH
ja: GYM MATCHへようこそ

# general_デバッグログ
source: Debug Log
es: Registro de depuración
ja: デバッグログ

# general_しばらくトレーニングを記録していませんね_また始めませんか
source: It's been a while since you last logged your workouts. Why not start again?
es: Ha pasado tiempo desde la última vez que registraste tus entrenamientos. ¿Por qué no empiezas de nuevo?
ja: しばらくトレーニングを記録していませんね。 また始めませんか？

# general_2_プロプランに変更すると全機能が使用可能になります
source: 2. Upgrading to the Pro plan will unlock all features.
es: 2. Al actualizar al plan Pro, se desbloquearán todas las funciones.
ja: 2. プロプランに変更すると全機能が使用可能になります

# workout_テンプレートから合計_setslengthセットを追加
source: ✅ Add a total of ${_sets.length} sets from the template
es: ✅ Agregue un total de ${_sets.length} conjuntos de la plantilla
ja: ✅ テンプレートから合計${_sets.length}セットを追加

# general_ℹ_ユーザー_userId_BIG3記録なし
source: ℹ️ User $userId: No BIG3 record
es: ℹ️ Usuario $userId: Sin registro BIG3
ja: ℹ️ ユーザー $userId: BIG3記録なし

# general_警告メッセージ
source: Warning message
es: Mensaje de advertencia
ja: 警告メッセージ

# subscription_2_一番上のApple_IDをタップ
source: 2. Tap [Apple ID] at the top
es: 2. Toca [ID de Apple] en la parte superior
ja: 2. 一番上の[Apple ID]をタップ

# general_この人から友達申請が届いています
source: This person has sent you a friend request
es: Esta persona te ha enviado una solicitud de amistad.
ja: この人から友達申請が届いています

# workout_请用简体中文提供详细说明
source: Detailed explanation provided in Chinese
es: Explicación detallada proporcionada en chino.
ja: 请用简体中文提供详细说明

# gym_24時間利用可能な格安フィットネスジム
source: Affordable fitness gym available 24 hours a day.
es: Gimnasio asequible disponible las 24 horas del día.
ja: 24時間利用可能な格安フィットネスジム。

# general_オフラインサービス初期化成功
source: ✅ Offline service initialization successful
es: ✅ Inicialización exitosa del servicio fuera de línea
ja: ✅ オフラインサービス初期化成功

# general_SNSで体験をシェアテンプレート提供
source: Share your experience on social media (template provided)
es: Comparte tu experiencia en las redes sociales (plantilla proporcionada)
ja: SNSで体験をシェア（テンプレート提供）

# workout_Step_2_AI利用可能性チェック_final_canUseAIResult_await_cred
source: ); // ======================================== // 🎯 Step 2: Check AI availability // ========================================== final canUseAIResult = await creditService.canUseAI(); debugPrint(
es: ); // ========================================== // 🎯 Paso 2: Verificar la disponibilidad de la IA // ============================================= final canUseAIResult = await creditService.canUseAI(); debugPrint(
ja: ); // ======================================== // 🎯 Step 2: AI利用可能性チェック // ======================================== final canUseAIResult = await creditService.canUseAI(); debugPrint(

# workout_行パースエラー_e
source: ⚠️ Line parse error: $e
es: ⚠️ Error de análisis de línea: $e
ja: ⚠️ 行パースエラー: $e

# profile_不正アクセスをしまたはこれを試みる行為
source: • Unauthorized access or attempted access
es: • Acceso no autorizado o intento de acceso
ja: • 不正アクセスをし、またはこれを試みる行為

# workout_エラー_1つも種目が抽出できませんでした
source: ❌ Error: No events were extracted!
es: ❌Error: ¡No se extrajeron eventos!
ja: ❌ エラー: 1つも種目が抽出できませんでした！

# general_秋田
source: Akita
ja: 秋田

# workout_ワークアウト保存エラー
source: ❌ Workout save error
es: ❌ Error al guardar el entrenamiento
ja: ❌ ワークアウト保存エラー

# general_ブロックすると
source: When you block:
es: Cuando bloqueas:
ja: ブロックすると:

# subscription_ダウングレード申請_currentPlan_targetPlan理由_reason
source: ✅ Downgrade request: $currentPlan → $targetPlan (reason: $reason)
es: ✅ Solicitud de degradación: $currentPlan → $targetPlan (motivo: $reason)
ja: ✅ ダウングレード申請: $currentPlan → $targetPlan（理由: $reason）

# profile_第2条サービス内容
source: Article 2 (Service Contents)
es: Artículo 2 (Contenido del servicio)
ja: 第2条（サービス内容）

# general_匿名認証を開始
source: 👤 Anonymous authentication started...
es: 👤La autenticación anónima comenzó...
ja: 👤 匿名認証を開始...

# profile_自己紹介はありません
source: There is no self-introduction
es: No hay autopresentación
ja: 自己紹介はありません

# general_ターゲット回数別の推奨重量
source: Recommended weight for each target repetition
es: Peso recomendado para cada repetición objetivo
ja: ターゲット回数別の推奨重量

# subscription_キャッシュ期限切れcacheAgeMinutestoStringAsFixed1分経過
source: ⚠️ Cache expired (${cacheAgeMinutes.toStringAsFixed(1)} minutes ago)
es: ⚠️ Caché expirado (hace ${cacheAgeMinutes.toStringAsFixed(1)} minutos)
ja: ⚠️ キャッシュ期限切れ（${cacheAgeMinutes.toStringAsFixed(1)}分経過）

# general_店舗画像がまだありません
source: There are no store images yet
es: Aún no hay imágenes de la tienda.
ja: 店舗画像がまだありません

# general_スタートダッシュ
source: Starting dash
es: Guión inicial
ja: スタートダッシュ

# workout_無料プランの制限
source: Free plan limitations
es: Limitaciones del plan gratuito
ja: 無料プランの制限

# subscription_購入に失敗しました_etoString
source: Purchase failed: ${e.toString()}
es: Compra fallida: ${e.toString()}
ja: 購入に失敗しました: ${e.toString()}

# error_異常検出エラー_e
source: ❌ Anomaly detection error: $e
es: ❌ Error de detección de anomalías: $e
ja: ❌ 異常検出エラー: $e

# workout_8_重要_日付は必ず_YYYYMMDD_形式で返してください_自重トレーニング懸垂チンニング等の重量
source: : 8} ] } ] } Important: - Please return the date in YYYY-MM-DD format. - Please enter 0 for weight training (pull-ups, chin-ups, etc.). - Please extract only the numeric value for kg units (
es: : 8} ] } ] } Importante: - Por favor, devuelva la fecha en formato AAAA-MM-DD. - Por favor, introduzca 0 para entrenamiento con pesas (dominadas, flexiones, etc.). - Por favor, extraiga solo el valor numérico de las unidades en kg (
ja: : 8} ] } ] } 重要: - 日付は必ず YYYY-MM-DD 形式で返してください - 自重トレーニング（懸垂、チンニング等）の重量は0としてください - kg表記は数値のみ抽出してください（

# general_メッセージの送受信ができなくなります
source: • You will not be able to send or receive messages.
es: • No podrás enviar ni recibir mensajes.
ja: • メッセージの送受信ができなくなります

# general_東京駅周辺のジムを表示しています
source: Showing gyms around Tokyo Station
es: Mostrando gimnasios alrededor de la estación de Tokio
ja: 東京駅周辺のジムを表示しています

# general_言語設定を保存_localelanguageCode
source: ✅ Save language setting: ${locale.languageCode}
es: ✅ Guardar configuración de idioma: ${locale.languageCode}
ja: ✅ 言語設定を保存: ${locale.languageCode}

# subscription_プラン変更に失敗しました
source: Plan change failed
es: El cambio de plan falló
ja: プラン変更に失敗しました

# general_週volumeAnalysis
source: Week ${volumeAnalysis[
es: Semana ${volumeAnalysis[
ja: 週${volumeAnalysis[

# general_GPS位置をクリア
source: 🗑️ Clear GPS location
es: 🗑️ Borrar ubicación GPS
ja: 🗑️ GPS位置をクリア

# gym_エニタイムフィットネス_秋葉原店
source: Anytime Fitness Akihabara
es: Fitness en cualquier momento Akihabara
ja: エニタイムフィットネス 秋葉原店

# subscription_AI機能は有料プランで利用可能です
source: AI features are available with paid plans
es: Las funciones de IA están disponibles con planes pagos
ja: AI機能は有料プランで利用可能です

# general_フェーズ2_ハイブリッド
source: Phase 2: Hybrid
es: Fase 2: Híbrido
ja: フェーズ2: ハイブリッド

# personalFactor_この画面ではあなたの個人特性に基づいて疲労度計算を補正します
source: This screen will adjust your fatigue calculation based on your personal characteristics.
es: Esta pantalla ajustará su cálculo de fatiga en función de sus características personales.
ja: この画面では、あなたの個人特性に基づいて疲労度計算を補正します。

# profile_本サービスは継続課金型のサブスクリプションサービスです
source: • This service is a subscription service with recurring charges.
es: • Este servicio es de suscripción recurrente.
ja: • 本サービスは継続課金型のサブスクリプションサービスです

# profile_警告_画面が既に破棄されています
source: ⚠️ WARNING: Screen has already been destroyed
es: ⚠️ ADVERTENCIA: La pantalla ya ha sido destruida
ja: ⚠️ 警告: 画面が既に破棄されています

# gym_メンテナンス
source: maintenance
es: mantenimiento
ja: メンテナンス

# general_Epley式を使用して推定1RMを計算します
source: Calculate your estimated 1RM using the Epley formula.
es: Calcula tu 1RM estimado utilizando la fórmula de Epley.
ja: Epley式を使用して推定1RMを計算します。

# workout_return_RichText_text_TextSpan_style_const_TextStyl
source: )); } } return RichText( text: TextSpan( style: const TextStyle( fontSize: 14, height: 1.6, color: Colors.black87, ), children: spans, ), ); } //🆕 v1.0.230: Get the RPE label String _getRPELabel(int rpe) { switch (rpe) { case 6: case 7: return
es: )); } } return RichText( texto: TextSpan( estilo: const TextStyle( tamaño de fuente: 14, altura: 1.6, color: Colors.black87, ), hijos: spans, ), ); } //🆕 v1.0.230: Obtener la etiqueta RPE String _getRPELabel(int rpe) { switch (rpe) { caso 6: caso 7: return
ja: )); } } return RichText( text: TextSpan( style: const TextStyle( fontSize: 14, height: 1.6, color: Colors.black87, ), children: spans, ), ); } /// 🆕 v1.0.230: RPEラベルを取得 String _getRPELabel(int rpe) { switch (rpe) { case 6: case 7: return

# general_疲労度分析結果
source: Fatigue analysis results
es: Resultados del análisis de fatiga
ja: 疲労度分析結果

# workout_CSVファイルが空ですデータが含まれているか確認してください
source: Your CSV file is empty. Please make sure it contains data.
es: Su archivo CSV está vacío. Asegúrese de que contenga datos.
ja: CSVファイルが空です。データが含まれているか確認してください。

# subscription_現在のプラン期間が終了後に新プランが適用されます
source: * The new plan will be applied after the current plan period ends.
es: *El nuevo plan se aplicará una vez finalizado el período del plan actual.
ja: ※ 現在のプラン期間が終了後に新プランが適用されます

# general_バッチ書き込み完了_operationslength件
source: ✅ Batch write completed: ${operations.length} operations
es: ✅ Escritura por lotes completada: ${operations.length} operaciones
ja: ✅ バッチ書き込み完了: ${operations.length}件

# subscription_AI使用回数取得エラー_e
source: ❌ Error getting AI usage count: $e
es: ❌ Error al obtener el recuento de uso de IA: $e
ja: ❌ AI使用回数取得エラー: $e

# error_ダッシュボードデータ読み込みエラー_e
source: ❌ Dashboard data loading error: $e
es: ❌ Error al cargar datos del panel: $e
ja: ❌ ダッシュボードデータ読み込みエラー: $e

# general_検索キャッシュサービス初期化成功Google_Maps_API_コスト削減
source: ✅ Search cache service initialization successful (Google Maps API cost reduction)
es: ✅ Inicialización exitosa del servicio de caché de búsqueda (reducción de costos de la API de Google Maps)
ja: ✅ 検索キャッシュサービス初期化成功（Google Maps API コスト削減）

# profile_好きな部位
source: Favorite part
es: Parte favorita
ja: 好きな部位

# general_膝がつま先より前に出ないように
source: Don't let your knees go out in front of your toes
es: No dejes que tus rodillas queden delante de los dedos de los pies.
ja: 膝がつま先より前に出ないように

# error_言語設定の保存に失敗_e
source: ❌ Failed to save language settings: $e
es: ❌ No se pudo guardar la configuración de idioma: $e
ja: ❌ 言語設定の保存に失敗: $e

# general_折り返し地点その調子
source: The halfway point! Keep it up!
es: ¡A mitad de camino! ¡Sigue así!
ja: 折り返し地点！その調子！

# gym_グループレッスン
source: Group lessons
es: Clases grupales
ja: グループレッスン

# workout_IMPORT_ユーザー確認_useruid
source: ✅ [IMPORT] User verification: ${user.uid}
es: ✅ [IMPORTAR] Verificación de usuario: ${user.uid}
ja: ✅ [IMPORT] ユーザー確認: ${user.uid}

# general_例_RFAKA2024
source: Example: RF-AKA-2024
es: Ejemplo: RF-AKA-2024
ja: 例: RF-AKA-2024

# profile_widgetprofilematchCountマッチ
source: (${widget.profile.matchCount} matches)
es: (${widget.profile.matchCount} coincidencias)
ja: (${widget.profile.matchCount}マッチ)

# general_プラットフォーム_kIsWeb
source: Platform: ${kIsWeb ?
es: Plataforma: ${kIsWeb ?
ja: プラットフォーム: ${kIsWeb ?

# gym_アップロード中
source: Uploading...
es: Subiendo...
ja: アップロード中...

# general_してくれた今までなんとなくやってたトレーニングが確信に変わった感覚_乗り換え割でbenefitは嬉し
source: It really helped me. My training routine, which I'd been doing "just casually," has now become a feeling of confidence. I'm happy to receive the $benefit from the switchover discount! $uniqueCode #GymMatchSwitchoverDiscount #AIMuscleTrainingAnalysis
es: Me ayudó mucho. Mi rutina de entrenamiento, que antes hacía de forma casual, ahora me da confianza. ¡Me alegra recibir el descuento por cambio! $uniqueCode #GymMatchSwitchoverDiscount #AIMuscleTrainingAnalysis
ja: してくれた。今まで「なんとなく」やってたトレーニングが、「確信」に変わった感覚。 乗り換え割で$benefitは嬉しい！ $uniqueCode #GymMatch乗り換え割 #AI筋トレ分析

# profile_ファイルデータが取得できませんでした
source: File data could not be obtained
es: No se pudieron obtener los datos del archivo
ja: ファイルデータが取得できませんでした

# workout_画像解析APIの権限エラーですしばらく待ってから再度お試しください
source: Image analysis API permission error. Please wait a while and try again.
es: Error de permiso de la API de análisis de imágenes. Espere un momento y vuelva a intentarlo.
ja: 画像解析APIの権限エラーです。しばらく待ってから再度お試しください。

# general_条件に一致するジムが見つかりません
source: No gyms matching your criteria found
es: No se encontraron gimnasios que coincidan con tus criterios
ja: 条件に一致するジムが見つかりません
