Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# workout_as_String_return_Column_crossAxisAlignment_CrossAx
source: ] as String; return Column( crossAxisAlignment: CrossAxisAlignment.stretch, children: [ // Status summary (ignores plateaus if toggled off) _buildStatusSummary(volumeAnalysis, frequencyAnalysis, _enablePlateauDetection && plateauDetected, growthTrend), const SizedBox(height: 16), // Volume analysis _buildVolumeAnalysis(volumeAnalysis), const SizedBox(height: 16), // Frequency analysis _buildFrequencyAnalysis(frequencyAnalysis), const SizedBox(height: 16), // Plateau warning (displays only if toggled on and detected) if (_enablePlateauDetection && plateauDetected) ...[ _buildPlateauWarning(), const SizedBox(height: 16), ], // Recommended action _buildRecommendations(recommendations), const SizedBox(height: 16), // AI analysis Card( child: Padding( padding: const EdgeInsets.all(16.0), child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Row( children: [ Icon(Icons.psychology, color: Colors.purple.shade700), SizedBox(width: 8), Text(AppLocalizations.of(context)!.aiDetailedAnalysis, style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, ), ), ], ), const SizedBox(height: 12), _buildFormattedText(aiAnalysis), ], ), ), ), const SizedBox(height: 16), // Scientific Basis ScientificBasisSection( basis:scientificBasis.cast<Map<String, String>>(), ), const SizedBox(height: 8), // Confidence Indicator Center( child: ConfidenceIndicator(paperCount:scientificBasis.length), ), ], ); } /// Status Summary Widget _buildStatusSummary( Map<String, dynamic> volume, Map<String, dynamic> frequency, bool plateau, Map<String, dynamic> trend, ) { Color statusColor; IconData statusIcon; String statusMessage; if (plateau) { statusColor = Colors.orange; statusIcon = Icons.warning; statusMessage =
es: ] como cadena; return Column( crossAxisAlignment: CrossAxisAlignment.stretch, children: [ // Resumen de estado (ignora mesetas si está desactivado) _buildStatusSummary(volumeAnalysis, frequencyAnalysis, _enablePlateauDetection && plateauDetected, growthTrend), const SizedBox(height: 16), // Análisis de volumen _buildVolumeAnalysis(volumeAnalysis), const SizedBox(height: 16), // Análisis de frecuencia _buildFrequencyAnalysis(frequencyAnalysis), const SizedBox(height: 16), // Advertencia de meseta (solo se muestra si está activado y se detecta) if (_enablePlateauDetection && plateauDetected) ...[ _buildPlateauWarning(), const SizedBox(height: 16), ], // Recomendado acción _buildRecommendations(recomendaciones), const SizedBox(altura: 16), // Análisis de IA Card( child: Padding( padding: const EdgeInsets.all(16.0), child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Row( children: [ Icon(Icons.psychology, color: Colors.purple.shade700), SizedBox(ancho: 8), Text(AppLocalizations.of(context)!.aiDetailedAnalysis, style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, ), ), ], ), const SizedBox(altura: 12), _buildFormattedText(aiAnalysis), ], ), ), ), const SizedBox(altura: 16), // Base científica ScientificBasisSection( basis:scientificBasis.cast<Map<String, String>>(), ), const SizedBox(height: 8), // Indicador de confianza Center( child: ConfidenceIndicator(paperCount:scientificBasis.length), ), ], ); } /// Resumen de estado Widget _buildStatusSummary( Map<String, dynamic> volumen, Map<String, dynamic> frecuencia, bool meseta, Map<String, dynamic> tendencia, ) { Color statusColor; IconData statusIcon; String statusMessage; if (plateau) { statusColor = Colors.orange; statusIcon = Icons.warning; statusMessage =
ja: ] as String; return Column( crossAxisAlignment: CrossAxisAlignment.stretch, children: [ // ステータスサマリー（トグルOFFの場合はプラトー無視） _buildStatusSummary(volumeAnalysis, frequencyAnalysis, _enablePlateauDetection && plateauDetected, growthTrend), const SizedBox(height: 16), // ボリューム分析 _buildVolumeAnalysis(volumeAnalysis), const SizedBox(height: 16), // 頻度分析 _buildFrequencyAnalysis(frequencyAnalysis), const SizedBox(height: 16), // プラトー警告（トグルON かつ 検出された場合のみ表示） if (_enablePlateauDetection && plateauDetected) ...[ _buildPlateauWarning(), const SizedBox(height: 16), ], // 推奨アクション _buildRecommendations(recommendations), const SizedBox(height: 16), // AI分析 Card( child: Padding( padding: const EdgeInsets.all(16.0), child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Row( children: [ Icon(Icons.psychology, color: Colors.purple.shade700), SizedBox(width: 8), Text(AppLocalizations.of(context)!.aiDetailedAnalysis, style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, ), ), ], ), const SizedBox(height: 12), _buildFormattedText(aiAnalysis), ], ), ), ), const SizedBox(height: 16), // 科学的根拠 ScientificBasisSection( basis: scientificBasis.cast<Map<String, String>>(), ), const SizedBox(height: 8), // 信頼度インジケーター Center( child: ConfidenceIndicator(paperCount: scientificBasis.length), ), ], ); } /// ステータスサマリー Widget _buildStatusSummary( Map<String, dynamic> volume, Map<String, dynamic> frequency, bool plateau, Map<String, dynamic> trend, ) { Color statusColor; IconData statusIcon; String statusMessage; if (plateau) { statusColor = Colors.orange; statusIcon = Icons.warning; statusMessage =

# personalFactor_タンパク質摂取_筋肉回復の材料
source: • Protein intake: building blocks for muscle recovery
es: • Ingesta de proteínas: elementos fundamentales para la recuperación muscular
ja: • タンパク質摂取: 筋肉回復の材料

# subscription_プロフィール設定完了
source: Profile setup complete
es: Configuración del perfil completada
ja: プロフィール設定完了

# general_累計5000kg達成
source: Achieved a cumulative total of 5,000kg
es: Se logró un total acumulado de 5.000 kg.
ja: 累計5,000kg達成

# general_この管理画面から店舗情報キャンペーンを即座に更新できます変更は自動的にユーザーアプリに反映されます
source: You can instantly update store information and campaigns from this management screen, and changes are automatically reflected in the user app.
es: Puede actualizar instantáneamente la información de la tienda y las campañas desde esta pantalla de administración, y los cambios se reflejan automáticamente en la aplicación del usuario.
ja: この管理画面から店舗情報・キャンペーンを即座に更新できます。変更は自動的にユーザーアプリに反映されます。

# general_例_平日の夕方は結構混んでます
source: Example: It's quite crowded on weekday evenings.
es: Ejemplo: Hay bastante gente los días laborables por la noche.
ja: 例: 平日の夕方は結構混んでます

# general_空データ削除_docid_作成_createdAttoString
source: 🗑️ Delete empty data: ${doc.id} (Created: ${createdAt?.toString() ??
es: 🗑️ Eliminar datos vacíos: ${doc.id} (Creado: ${createdAt?.toString() ??
ja: 🗑️ 空データ削除: ${doc.id} (作成: ${createdAt?.toString() ??

# workout_有効なトレーニングデータが見つかりませんでしたCSVフォーマットを確認してください
source: No valid training data found. Please check your CSV format.
es: No se encontraron datos de entrenamiento válidos. Por favor, revise el formato CSV.
ja: 有効なトレーニングデータが見つかりませんでした。CSVフォーマットを確認してください。

# workout_月間統計期間_monthStart_now
source: 📅 Monthly statistics period: $monthStart ~ $now
es: 📅 Periodo de estadísticas mensuales: $monthStart ~ $now
ja: 📅 月間統計期間: $monthStart 〜 $now

# workout_Gemini_API_タイムアウト_フォールバックを使用
source: Gemini API timeout - use fallback
es: Tiempo de espera de la API de Gemini: usar reserva
ja: Gemini API タイムアウト - フォールバックを使用

# general_1回あたり_300_aiCountround
source: Per use: ¥${(300 / aiCount).round()}
es: Por uso: ¥${(300 / aiCount).round()}
ja: 1回あたり: ¥${(300 / aiCount).round()}

# general_streakDays日間連続達成
source: Achieved ${streakDays} days in a row! 🔥
es: ¡Conseguiste ${streakDays} días seguidos! 🔥
ja: ${streakDays}日間連続達成！🔥

# general_ホーム画面から素早くアクセス
source: Quick access from the home screen
es: Acceso rápido desde la pantalla de inicio
ja: ホーム画面から素早くアクセス

# profile_500月広告なしAI機能月10回
source: ¥500/month (no ads, 10 AI functions per month)
es: ¥500/mes (sin anuncios, 10 funciones de IA por mes)
ja: ¥500/月（広告なし、AI機能月10回）

# error_プラン状態チェックエラー_e
source: ⚠️ Plan status check error: $e
es: ⚠️ Error de verificación del estado del plan: $e
ja: ⚠️ プラン状態チェックエラー: $e

# bodyPart_中上級者向けトレーニング種目一覧以下から選択してください_胸大胸筋_ベンチプレスバーベルインクライン
source: [List of Training Exercises for Intermediate and Advanced Exercisers] Please choose from the following. ■ Chest (Pectoral Muscles): Bench Press (Barbell), Incline Bench Press, Decline Bench Press, Dumbbell Bench Press, Incline Dumbbell Press, Dumbbell Fly, Incline Fly, Cable Crossover, Dips (Chest-Emphasis), Chest Press Machine, Pec Fly Machine ■ Back (Latissimus Dorsi, Trapezius, Erector Spinae): Deadlift (Barbell), Lat Pulldown (Wide), Lat Pulldown (Narrow), Chin-Ups (Chin-Ups), Bent-Over Row, One-Hand Dumbbell Row, T-Bar Row, Seated Row, Cable Row, Back Extension, Shrug ■ Legs (Quadriceps, Hamstrings, Gluteus Maximus) : Barbell squats, front squats, Bulgarian squats, leg press machine, leg extensions, leg curls, Romanian deadlifts, front lunges, back lunges, leg abduction, leg abduction, calf raises, hip thrusts ■ Shoulders (deltoids): Shoulder press (barbell), dumbbell shoulder press, machine shoulder press, side raises (dumbbells), cable side raises, front raises, rear raises (dumbbells), cable rear raises, upright rows, face pulls ■ Biceps (biceps): Barbell curls (straight), EZ bar curls, dumbbells Alternate curls, hammer curls, preacher curls, incline dumbbell curls, concentration curls, cable curls, chin-ups (reverse pull-ups), 21 curls, drag curls, Zottman curls, machine arm curls Triceps: Triceps press-downs, cable press-downs, lying triceps extensions, skull crushers, overhead triceps extensions, dips (triceps-focused), triceps kickbacks, kickbacks, close-grip bench press, cable overhead extensions, reverse-grip press-downs, dumbbell lifts Push-up extensions, JM press, diamond push-ups, bench dips, machine dips ■Abdominal muscles (rectus abdominis, obliques, transverse abdominis): Crunches, leg raises, hanging leg raises, cable crunches, ab roller, plank, side plank, Russian twist, mountain climbers, bicycle crunches, dragon flags ■Aerobic exercise: Running (treadmill), jogging (outdoors), stationary bike, walking (treadmill), interval running, cross trainer, stepper, swimming, rowing machine, battle ropes, burpee jumps, mountain climbers (high intensity) **Important**: Please briefly list the exercise name, weight, and number of repetitions. No explanation is required.
es: [Lista de ejercicios de entrenamiento para deportistas de nivel intermedio y avanzado] Elija entre las siguientes opciones. ■ Pecho (Músculos Pectorales): Press de Banco (Barra), Press de Banco Inclinado, Press de Banco Declinado, Press de Banco con Mancuernas, Press Inclinado con Mancuernas, Aperturas con Mancuernas, Aperturas Inclinadas, Cruce de Polea, Fondos (Pectoral), Press de Pecho en Máquina, Aperturas de Pectorales en Máquina ■ Espalda (Dorsal Ancho, Trapecio, Erector de la Columna): Peso Muerto (Barra), Jalón Lateral (Ancho), Jalón Lateral (Estrecho), Dominadas (Dominadas), Remo Inclinado, Remo con Mancuernas a una Mano, Remo con Barra T, Remo Sentado, Remo con Polea, Extensión de Espalda, Encogimiento de Hombros ■ Piernas (Cuádriceps, Isquiotibiales, Glúteo Mayor): Sentadillas con barra, Sentadillas Frontales, Sentadillas Búlgaras, Prensa de Piernas en Máquina, Extensiones de Piernas, Flexiones de Piernas, Peso Muerto Rumano, Zancadas Frontales, Zancadas Traseras, Abducción de Piernas, Piernas Abducción, elevaciones de pantorrillas, empujes de cadera ■ Hombros (deltoides): Press de hombros (barra), press de hombros con mancuernas, press de hombros en máquina, elevaciones laterales (mancuernas), elevaciones laterales con polea, elevaciones frontales, elevaciones traseras (mancuernas), elevaciones traseras con polea, remos verticales, jalones faciales ■ Bíceps: Curls con barra (recto), curls con barra EZ, curls alternados con mancuernas, curls martillo, curls predicador, curls inclinados con mancuernas, curls de concentración, curls con polea, dominadas (dominadas inversas), curls 21, curls de arrastre, curls Zottman, curls de brazos en máquina Tríceps: Presiones de tríceps, presiones con polea, extensiones de tríceps acostado, quebradores de cráneo, extensiones de tríceps por encima de la cabeza, fondos (centrados en el tríceps), contragolpes de tríceps, contragolpes, press de banca con agarre cerrado Extensiones con polea por encima de la cabeza, press de banca con agarre invertido, levantamientos con mancuernas, extensiones de flexiones, press de banca japonés, flexiones diamante, fondos en banco, fondos en máquina ■Músculos abdominales (recto abdominal, oblicuos, transverso abdominal): Abdominales, elevaciones de piernas, elevaciones de piernas colgado, abdominales con polea, rodillo abdominal, plancha, plancha lateral, giro ruso, escaladores de montaña, abdominales de bicicleta, banderas de dragón ■Ejercicio aeróbico: Correr (cinta), trotar (al aire libre), bicicleta estática, caminar (cinta), carreras a intervalos, elíptica, step, natación, máquina de remo, cuerdas de batalla, burpees, escaladores de montaña (alta intensidad) **Importante**: Por favor, indique brevemente el nombre del ejercicio, el peso y el número de repeticiones. No se requiere explicación.
ja: 【中・上級者向けトレーニング種目一覧】以下から選択してください。 ■胸（大胸筋）: ベンチプレス（バーベル）、インクラインベンチプレス、デクラインベンチプレス、ダンベルベンチプレス、インクラインダンベルプレス、ダンベルフライ、インクラインフライ、ケーブルクロスオーバー、ディップス（胸重視）、チェストプレスマシン、ペックフライマシン ■背中（広背筋・僧帽筋・脊柱起立筋）: デッドリフト（バーベル）、ラットプルダウン（ワイド）、ラットプルダウン（ナロー）、チンニング（懸垂）、ベントオーバーロー、ワンハンドダンベルロー、Tバーロー、シーテッドロー、ケーブルロー、バックエクステンション、シュラッグ ■脚（大腿四頭筋・ハムストリングス・大臀筋）: バーベルスクワット、フロントスクワット、ブルガリアンスクワット、レッグプレスマシン、レッグエクステンション、レッグカール、ルーマニアンデッドリフト、ランジ（フロント）、ランジ（バック）、レッグアブダクション、レッグアダクション、カーフレイズ、ヒップスラスト ■肩（三角筋）: ショルダープレス（バーベル）、ダンベルショルダープレス、マシンショルダープレス、サイドレイズ（ダンベル）、ケーブルサイドレイズ、フロントレイズ、リアレイズ（ダンベル）、ケーブルリアレイズ、アップライトロー、フェイスプル ■二頭（上腕二頭筋）: バーベルカール（ストレート）、EZバーカール、ダンベルカール（オルタネイト）、ハンマーカール、プリチャーカール、インクラインダンベルカール、コンセントレーションカール、ケーブルカール、チンアップ（逆手懸垂）、21カール、ドラッグカール、ゾットマンカール、マシンアームカール ■三頭（上腕三頭筋）: トライセプスプレスダウン、ケーブルプレスダウン、ライイングトライセプスエクステンション、スカルクラッシャー、オーバーヘッドトライセプスエクステンション、ディップス（三頭筋重視）、トライセプスキックバック、キックバック、クローズグリップベンチプレス、ケーブルオーバーヘッドエクステンション、リバースグリッププレスダウン、ダンベルトライセプスエクステンション、JMプレス、ダイヤモンドプッシュアップ、ベンチディップス、マシンディップス ■腹筋（腹直筋・腹斜筋・腹横筋）: クランチ、レッグレイズ、ハンギングレッグレイズ、ケーブルクランチ、アブローラー、プランク、サイドプランク、ロシアンツイスト、マウンテンクライマー、バイシクルクランチ、ドラゴンフラッグ ■有酸素運動: ランニング（トレッドミル）、ジョギング（屋外）、エアロバイク、ウォーキング（トレッドミル）、インターバルラン、クロストレーナー、ステッパー、水泳、ローイングマシン、バトルロープ、バーピージャンプ、マウンテンクライマー（高強度） **重要**: 種目名・重量・回数のみ簡潔に記載。説明は不要。

# subscription_AI使用回数更新エラー_e
source: ❌ AI usage count update error: $e
es: ❌ Error de actualización del recuento de uso de IA: $e
ja: ❌ AI使用回数更新エラー: $e

# workout_認証エラーが発生しました
source: An authentication error occurred
es: Se produjo un error de autenticación
ja: 認証エラーが発生しました

# workout_ワークアウト保存成功_Document_ID_workoutDocid
source: ✅ Workout saved successfully: Document ID = ${workoutDoc.id}
es: ✅ Entrenamiento guardado exitosamente: ID del documento = ${workoutDoc.id}
ja: ✅ ワークアウト保存成功: Document ID = ${workoutDoc.id}

# general_ハラスメント
source: Harassment
es: Acoso
ja: ハラスメント

# general_AI追加パック5回分
source: AI Add-on Pack (5 uses)
es: Paquete adicional de IA (5 usos)
ja: AI追加パック（5回分）

# gym_本文
source: Main text
es: Texto principal
ja: 本文

# general_動画を見て1回分ゲット
source: Watch the video and get one
es: Mira el vídeo y consigue uno
ja: 動画を見て1回分ゲット

# gym_平日_9002300_土日_9002000
source: Weekdays 9:00-23:00, Saturdays and Sundays 9:00-20:00
es: Días laborables 9:00-23:00, sábados y domingos 9:00-20:00
ja: 平日 9:00-23:00, 土日 9:00-20:00

# general_目標達成済み次の目標を設定しましょう
source: Goal achieved! Set your next goal!
es: ¡Objetivo cumplido! ¡Establece tu próximo objetivo!
ja: 目標達成済み！次の目標を設定しましょう

# general_石川
source: Ishikawa
ja: 石川

# gym_チェックイン機能を使用するにはFirebase_Consoleで設定ファイルを取得しfirebase
source: To use the check-in feature, get your configuration file in the Firebase Console and update firebase_options.dart.
es: Para utilizar la función de check-in, obtenga su archivo de configuración en la consola Firebase y actualice firebase_options.dart.
ja: チェックイン機能を使用するには、Firebase Consoleで設定ファイルを取得し、firebase_options.dartを更新してください。

# general_1_App_Store_Connectで商品を作成してください
source: 1. Create your product in App Store Connect.
es: 1. Crea tu producto en App Store Connect.
ja: 1. App Store Connectで商品を作成してください

# general_休眠会員_dormantMembers名
source: Dormant Members: $dormantMembers name
es: Miembros inactivos: $dormantMembers nombre
ja: 休眠会員: $dormantMembers名

# workout_システムサウンド再生成功2回目
source: ✅ System sound playback successful (2nd time)
es: ✅ Reproducción de sonido del sistema exitosa (2da vez)
ja: ✅ システムサウンド再生成功（2回目）

# general_現在のプラン_currentPlan_広告表示_isPremiumUser
source: 📊 Current plan: $currentPlan (Ad display: ${!_isPremiumUser})
es: 📊 Plan actual: $currentPlan (Visualización de anuncios: ${!_isPremiumUser})
ja: 📊 現在のプラン: $currentPlan (広告表示: ${!_isPremiumUser})

# general_体幹をまっすぐに保つ
source: Keep your core straight
es: Mantén tu centro recto
ja: 体幹をまっすぐに保つ

# workout_日付フォーマット_String_formatDateDateTime_date_return
source: ), ), ], ), ); } /// Date format String _formatDate(DateTime date) { return
es: ), ), ], ), ); } /// Formato de fecha String _formatDate(DateTime date) { return
ja: ), ), ], ), ); } /// 日付フォーマット String _formatDate(DateTime date) { return

# general_次はstreakDays_7日間連続を目指そう
source: Next, aim for ${streakDays + 7} days in a row.
es: A continuación, intente conseguir ${streakDays + 7} días seguidos.
ja: 次は${streakDays + 7}日間連続を目指そう

# profile_権限チェックエラー_e
source: ⚠️ Permission check error: $e
es: ⚠️ Error de comprobación de permisos: $e
ja: ⚠️ 権限チェックエラー: $e

# general_追加購入はいつでも可能です
source: • Additional purchases are possible at any time.
es: • Es posible realizar compras adicionales en cualquier momento.
ja: • 追加購入はいつでも可能です

# workout_ドキュメント_docid_日付_DateFormat
source: 📄 Document: ${doc.id}, Date: ${DateFormat(
es: 📄 Documento: ${doc.id}, Fecha: ${DateFormat(
ja: 📄 ドキュメント: ${doc.id}, 日付: ${DateFormat(

# workout_ストリーク計算完了_currentStreak日連続
source: ✅ Streak calculation completed: $_currentStreak consecutive days
es: ✅ Cálculo de racha completado: $_currentStreak días consecutivos
ja: ✅ ストリーク計算完了: $_currentStreak日連続

# error_PR確認エラー_e
source: ❌ PR verification error: $e
es: ❌ Error de verificación de PR: $e
ja: ❌ PR確認エラー: $e

# profile_ユーザーアプリにビジター可バッジが表示されます
source: A "Visitors Allowed" badge will appear on the user app
es: Aparecerá una insignia de "Visitantes permitidos" en la aplicación del usuario.
ja: ユーザーアプリに「ビジター可」バッジが表示されます

# general_お気に入りがありません
source: No favorites
es: Sin favoritos
ja: お気に入りがありません

# general_役所
source: government office
es: oficina gubernamental
ja: 役所

# workout_1RM推定_recordcalculated1RMtoStringAsFixed1kg
source: 1RM estimate: ${record.calculated1RM.toStringAsFixed(1)}kg
es: Estimación de 1RM: ${record.calculated1RM.toStringAsFixed(1)}kg
ja: 1RM推定: ${record.calculated1RM.toStringAsFixed(1)}kg

# general_トレーニングパートナーを_見つけよう
source: Find a training partner
es: Encuentra un compañero de entrenamiento
ja: トレーニングパートナーを 見つけよう

# error_削除に失敗しました_updateError
source: Delete failed: $updateError
es: Error de eliminación: $updateError
ja: 削除に失敗しました: $updateError

# profile_X旧Twitter_MatchGym71830
source: X (old Twitter): @MatchGym71830
es: X (antiguo Twitter): @MatchGym71830
ja: X（旧Twitter）: @MatchGym71830

# subscription_subscriptionServicegetPlanNameplanの購入が完了しました
source: Your purchase of ${_subscriptionService.getPlanName(plan)} has been completed!
es: ¡Su compra de ${_subscriptionService.getPlanName(plan)} se ha completado!
ja: ${_subscriptionService.getPlanName(plan)}の購入が完了しました！

# general_フェーズ2_ハイブリッド戦略コスト170月
source: Phase 2: Hybrid Strategy (cost: $170/month)
es: Fase 2: Estrategia híbrida (costo: $170/mes)
ja: フェーズ2: ハイブリッド戦略（コスト\$170/月）

# gym_愛知県名古屋市港区明正1丁目200_県番地
source: Address: 200 Meisei 1-chome, Minato-ku, Nagoya City, Aichi Prefecture
es: Dirección: 200 Meisei 1-chome, Minato-ku, ciudad de Nagoya, prefectura de Aichi
ja: 愛知県名古屋市港区明正1丁目200 県番地

# subscription_詳細な混雑度統計
source: 📊 Detailed congestion statistics
es: 📊 Estadísticas detalladas de congestión
ja: 📊 詳細な混雑度統計

# general_totalMembers名
source: $totalMembers name
es: $nombreTotalDeMiembros
ja: $totalMembers名

# general_Firebase初期化開始
source: Firebase initialization starts
es: Se inició la inicialización de Firebase
ja: Firebase初期化開始

# workout_推定1RM_oneRMtoStringAsFixed1kg
source: Estimated 1RM: ${oneRM.toStringAsFixed(1)}kg
es: 1RM estimado: ${oneRM.toStringAsFixed(1)}kg
ja: 推定1RM: ${oneRM.toStringAsFixed(1)}kg

# general_フィルタリング結果_一致matchCount件_除外excludeCount件
source: 📊 Filtering results: matches=${matchCount}, excludes=${excludeCount}
es: 📊 Filtrando resultados: coincidencias=${matchCount}, exclusiones=${excludeCount}
ja: 📊 フィルタリング結果: 一致=${matchCount}件, 除外=${excludeCount}件

# error_トレーニング記録日付の取得エラー_e
source: ❌ Error getting training record date: $e
es: ❌ Error al obtener la fecha del registro de entrenamiento: $e
ja: ❌ トレーニング記録日付の取得エラー: $e

# workout_月間部位別総負荷量
source: 📊 === Total monthly load by body part ===
es: 📊 === Carga mensual total por parte del cuerpo ===
ja: 📊 === 月間部位別総負荷量 ===

# workout_style_TextStyle_fontSize_13_color_Colorsgreyshade7_2
source: , style: TextStyle( fontSize: 13, color: Colors.grey.shade700, ), ), ], ), ), ], ), ), ), const SizedBox(height: 16), // growth rate card Card( child: Padding( padding: const EdgeInsets.all(16.0), child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Row( children: [ Icon(Icons.show_chart, color: Colors.blue.shade700), const SizedBox(width: 8), const Text(
es: , estilo: TextStyle( fontSize: 13, color: Colors.grey.shade700, ), ), ], ), ), ], ), ), ), const SizedBox(altura: 16), // tarjeta de tasa de crecimiento Card( child: Padding( padding: const EdgeInsets.all(16.0), child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Row( children: [ Icon(Icons.show_chart, color: Colors.blue.shade700), const SizedBox(ancho: 8), const Text(
ja: , style: TextStyle( fontSize: 13, color: Colors.grey.shade700, ), ), ], ), ), ], ), ), ), const SizedBox(height: 16), // 成長率カード Card( child: Padding( padding: const EdgeInsets.all(16.0), child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Row( children: [ Icon(Icons.show_chart, color: Colors.blue.shade700), const SizedBox(width: 8), const Text(

# workout_主要部位
source: Main parts
es: Partes principales
ja: 主要部位

# personalFactor_年齢を入力してください
source: Enter your age
es: Introduce tu edad
ja: 年齢を入力してください

# general_背中とハムストリングス
source: Back and hamstrings
es: Espalda y isquiotibiales
ja: 背中とハムストリングス

# general_探している商品ID_aiAdditionalPackProductId
source: Searching for product ID: $aiAdditionalPackProductId
es: Buscando el ID del producto: $aiAdditionalPackProductId
ja: 探している商品ID: $aiAdditionalPackProductId

# workout_AIが一時的に利用できないため科学的研究に基づいた推奨メニューを提案します
source: 💡 AI is temporarily unavailable, so we'll provide you with menu recommendations based on scientific research.
es: 💡 La IA no está disponible temporalmente, por lo que te brindaremos recomendaciones de menú basadas en investigaciones científicas.
ja: 💡 AIが一時的に利用できないため、科学的研究に基づいた推奨メニューを提案します。

# general_624ヶ月
source: 6-24 months
es: 6-24 meses
ja: 6-24ヶ月

# gym_東京都港区南青山101010
source: 10-10-10 Minami-Aoyama, Minato-ku, Tokyo
es: 10-10-10 Minami-Aoyama, Minato-ku, Tokio
ja: 東京都港区南青山10-10-10

# profile_シェア用メッセージをコピーしました
source: ✅ Message for sharing has been copied!
es: ✅¡El mensaje para compartir ha sido copiado!
ja: ✅ シェア用メッセージをコピーしました！

# general_デッド
source: dead
es: muerto
ja: デッド

# general_バーベルを胸につけるイメージで
source: Imagine putting a barbell on your chest
es: Imagina ponerte una barra en el pecho.
ja: バーベルを胸につけるイメージで

# general_無制限にAI機能を使いたい方はPremiumプラン月10回またはProプラン月30回へのアップグレー
source: 💡 If you want unlimited access to our AI features, consider upgrading to our Premium plan (10 calls per month) or Pro plan (30 calls per month).
es: 💡 Si desea acceso ilimitado a nuestras funciones de IA, considere actualizar a nuestro plan Premium (10 llamadas por mes) o plan Pro (30 llamadas por mes).
ja: 💡 無制限にAI機能を使いたい方は、Premiumプラン（月10回）またはProプラン（月30回）へのアップグレードをご検討ください
