Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# general_科学的根拠データベース_1_筋力向上率の基準値_初心者_06ヶ月_月1525_根拠_Effect_o
source: [Scientific Evidence Database] ## 1. Baseline Strength Improvement Rate - Beginner (0-6 months): +15-25% per month (Based on the Effect of High Intensity study - +31.2% in 6 weeks) - Intermediate (6-24 months): +5-10% per month (Based on ACSM 2009 - Estimates based on experienced exercisers and the ACSM model) - Advanced (24 months and older): +1-3% per month (Based on ACSM 2009 - Estimates based on the periodization model) - Progression Rule: Increase load by +2-10% after exceeding target repetitions by 1-2 times (Based on ACSM Position Stand 2009) ## 2. Optimal Training Frequency - Principle: Total volume is paramount. When volume is equivalent, there is no significant difference in strength improvement with frequency (p = 0.421). (Source: Grgic et al. 2018 Sports Medicine) - Volume inequivalence: 2 times per week (ES 0.82), 3 times per week (ES 0.93). Increasing frequency allows for increased volume. (Source: Grgic et al. 2018) - Muscle hypertrophy: 2 times per week is superior to 1 time per week. (Source: Schoenfeld et al. 2016 Sports Medicine) - Body part recommendation: For upper body and multi-joint exercises, a high frequency of 3 times per week or more is effective (p = 0.004). (Source: Grgic et al. 2018) ## 3. Definition and Countermeasures for the Plateau Phase - Definition: A state in which progress in a primary exercise has stagnated for 3-4 weeks. - Breakthrough Method 1 (New Stimulus): Introduce advanced techniques (drop sets, cluster sets, etc.). (Source: Krzysztofik et al. 2019, IJERPH) - Breakthrough 2 (Fatigue Management): Deload. "A period to reduce physiological and psychological fatigue and promote recovery." (Source: Bell et al. 2023, BMC Sports Sci) - Deload Optimization: Reduce volume (number of sets) by 30-50% while maintaining intensity (weight). Duration: 1 week. (Source: Bell et al. 2023) ## 4. Recommended Training Volume (Per Body Part, Per Week) - General Principle: There is a "gradual dose-response relationship" for both strength and hypertrophy. The higher the volume, the greater the effect. (Source: Schoenfeld et al. 2017, JSS; Ralston et al. 2017, Sports Med) - Hypertrophy (Effect of Additional Sets): Each additional set increases hypertrophy gain by +0.37%. (Source: Schoenfeld et al. 2017) - Beginners: 10-12 sets per week per body part (Source: Ralston et al. 2017 - 5 sets per week or less is ineffective) - Intermediate/Advanced: 12-20 sets per week per body part (Source: Baz-Valle et al. 2022 J Human Kinetics) - Overtraining threshold: 20 or more sets per week is effective for the triceps (p=0.01), but the effect may plateau for the quadriceps and biceps. (Evidence: Baz-Valle et al. 2022) ## 5. Optimal Rest Days (Same Muscle Group) - Large muscle groups (legs, back, chest): 48-72 hours (Evidence: 2024 Review - Lower body and multi-joint exercises recover more slowly) - Small muscle groups (shoulders and arms): 24-48 hours (Evidence: 2024 Review - Upper body recovers more quickly) - Physiological evidence: Muscle protein synthesis (MPS) lasts up to 48 hours. (Evidence: Davies et al. 2024 Translational Sports Medicine) - Level-Specific: Beginners have a longer MPS duration (48+ hours), while advanced players have a shorter MPS duration (<24 hours). (Evidence: Damas et al. 2016 Sports Medicine) ## 6. Recommended Training Intensity - Strength Improvement: High intensity (>60% 1RM) is essential. High intensity is significantly better than low intensity. (Source: Schoenfeld et al. 2017 JSCR) - Purpose (muscle hypertrophy): "Working to the limit" is important. Working to the limit results in the same muscle hypertrophy at high and low intensities. (Source: Schoenfeld et al. 2017) - Necessity of failure: * Strength: Not necessary (ES = -0.09, no significant difference). (Source: Grgic et al. 2022 J Sport Health Sci) * Muscle hypertrophy (experienced individuals only): Working to the limit is more effective (ES = 0.15, p < 0.05). (Source: Grgic et al. 2022) ## 7. Age, Gender, and Genetic Factors - Age: Even those over 50 can achieve significant strength gains through high-intensity training (e.g., leg press +29%). (Source: Peterson et al. 2010 MSSE) - Gender (muscle hypertrophy): There is no gender difference in relative muscle hypertrophy rates. (Source: 2024 PeerJ Meta-analysis) - Gender (muscle strength): There is no gender difference in lower body (relative) strength. For upper body (relative) strength, women show significantly higher improvement rates than men (ES = -0.60). (Source: Roberts et al. 2020 JSCR) - Genetics (individual differences): There is a high likelihood that "global non-responders" do not exist. Stagnation should be considered a "program mismatch" rather than a "genetic limitation," and changes in volume, intensity, and frequency should be suggested. (Source: Pickering & Kiely 2019 Sports Medicine)
es: [Base de datos de evidencia científica] ## 1. Tasa de mejora de la fuerza inicial - Principiante (0-6 meses): +15-25 % al mes (Basado en el estudio "Efecto de alta intensidad": +31,2 % en 6 semanas) - Intermedio (6-24 meses): +5-10 % al mes (Basado en el ACSM 2009: Estimaciones basadas en deportistas experimentados y el modelo del ACSM) - Avanzado (24 meses o más): +1-3 % al mes (Basado en el ACSM 2009: Estimaciones basadas en el modelo de periodización) - Regla de progresión: Aumentar la carga entre un 2 % y un 10 % después de superar las repeticiones objetivo entre 1 y 2 veces (Basado en la posición del ACSM 2009) ## 2. Frecuencia óptima de entrenamiento - Principio: El volumen total es fundamental. Cuando el volumen es equivalente, no hay una diferencia significativa en la mejora de la fuerza con la frecuencia (p = 0,421). (Fuente: Grgic et al. 2018 Sports Medicine) - Inequivalencia de volumen: 2 veces por semana (ES 0,82), 3 veces por semana (ES 0,93). Aumentar la frecuencia permite aumentar el volumen. (Fuente: Grgic et al. 2018) - Hipertrofia muscular: 2 veces por semana es superior a 1 vez por semana. (Fuente: Schoenfeld et al. 2016 Sports Medicine) - Recomendación por grupo muscular: Para ejercicios de tren superior y multiarticulares, una frecuencia alta de 3 veces por semana o más es efectiva (p = 0,004). (Fuente: Grgic et al. 2018) ## 3. Definición y contramedidas para la fase de meseta - Definición: Estado en el que el progreso en un ejercicio principal se ha estancado durante 3-4 semanas. - Método innovador 1 (Nuevo estímulo): Introducir técnicas avanzadas (series descendentes, series agrupadas, etc.). (Fuente: Krzysztofik et al. 2019, IJERPH) - Avance 2 (Gestión de la Fatiga): Descarga. «Un periodo para reducir la fatiga fisiológica y psicológica y promover la recuperación». (Fuente: Bell et al. 2023, BMC Sports Sci) - Optimización de la Descarga: Reducir el volumen (número de series) entre un 30 % y un 50 %, manteniendo la intensidad (peso). Duración: 1 semana. (Fuente: Bell et al. 2023) ## 4. Volumen de Entrenamiento Recomendado (Por Parte Corporal, Por Semana) - Principio General: Existe una relación dosis-respuesta gradual tanto para la fuerza como para la hipertrofia. A mayor volumen, mayor efecto. (Fuente: Schoenfeld et al. 2017, JSS; Ralston et al. 2017, Sports Med) - Hipertrofia (Efecto de Series Adicionales): Cada serie adicional aumenta la ganancia de hipertrofia en un +0,37 %. (Fuente: Schoenfeld et al. 2017) - Principiantes: 10-12 series por semana por grupo muscular (Fuente: Ralston et al. 2017 - 5 series por semana o menos son ineficaces) - Intermedio/Avanzado: 12-20 series por semana por grupo muscular (Fuente: Baz-Valle et al. 2022 J Human Kinetics) - Umbral de sobreentrenamiento: 20 o más series por semana son efectivas para el tríceps (p=0,01), pero el efecto puede estancarse para el cuádriceps y el bíceps. (Evidencia: Baz-Valle et al. 2022) ## 5. Días de descanso óptimos (mismo grupo muscular) - Grupos musculares grandes (piernas, espalda, pecho): 48-72 horas (Evidencia: Revisión de 2024 - Los ejercicios de tren inferior y multiarticulares se recuperan más lentamente) - Grupos musculares pequeños (hombros y brazos): 24-48 horas (Evidencia: Revisión de 2024 - El tren superior se recupera más rápidamente) - Evidencia fisiológica: La síntesis de proteína muscular (SPM) dura hasta 48 horas. (Evidencia: Davies et al. 2024 Medicina Deportiva Traslacional) - Nivel específico: Los principiantes tienen una SPM más larga (más de 48 horas), mientras que los jugadores avanzados tienen una más corta (menos de 24 horas). (Evidencia: Damas et al. 2016 Sports Medicine) ## 6. Intensidad de entrenamiento recomendada - Mejora de la fuerza: La alta intensidad (>60 % 1RM) es esencial. La alta intensidad es significativamente mejor que la baja intensidad. (Fuente: Schoenfeld et al. 2017 JSCR) - Propósito (hipertrofia muscular): Es importante trabajar al límite. Trabajar al límite produce la misma hipertrofia muscular a alta y baja intensidad. (Fuente: Schoenfeld et al. 2017) - Necesidad del fallo: * Fuerza: No es necesaria (ES = -0,09, sin diferencia significativa). (Fuente: Grgic et al. 2022 J Sport Health Sci) * Hipertrofia muscular (solo para personas con experiencia): Trabajar al límite es más efectivo (ES = 0,15, p < 0,05). (Fuente: Grgic et al. 2022) ## 7. Edad, género y factores genéticos - Edad: Incluso las personas mayores de 50 años pueden lograr ganancias significativas de fuerza mediante entrenamiento de alta intensidad (p. ej., prensa de piernas +29%). (Fuente: Peterson et al. 2010 MSSE) - Género (hipertrofia muscular): No existen diferencias de género en las tasas relativas de hipertrofia muscular. (Fuente: Metaanálisis de PeerJ 2024) - Género (fuerza muscular): No existen diferencias de género en la fuerza (relativa) del tren inferior. En cuanto a la fuerza (relativa) del tren superior, las mujeres muestran tasas de mejora significativamente mayores que los hombres (ES = -0,60). (Fuente: Roberts et al. 2020 JSCR) - Genética (diferencias individuales): Existe una alta probabilidad de que no existan "personas que no responden globalmente". El estancamiento debe considerarse un "desajuste del programa" más que una "limitación genética", y se deben sugerir cambios en el volumen, la intensidad y la frecuencia. (Fuente: Pickering & Kiely, Medicina Deportiva 2019)
ja: 【科学的根拠データベース】 ## 1. 筋力向上率の基準値 - 初心者 (0-6ヶ月): 月+15-25% （根拠: Effect of high intensity study - 6週間で+31.2%のデータ） - 中級者 (6-24ヶ月): 月+5-10% （根拠: ACSM 2009 - 経験者データとACSMモデルからの推定） - 上級者 (24ヶ月以上): 月+1-3% （根拠: ACSM 2009 - ピリオダイゼーションモデルに基づく推定） - 進捗ルール: 目標レップを1-2回超過達成で、負荷を +2-10% 増加 （根拠: ACSM Position Stand 2009） ## 2. 最適トレーニング頻度 - 原則: 総ボリュームが最重要。ボリューム等価の場合、頻度による筋力向上の有意差なし (p = 0.421)。（根拠: Grgic et al. 2018 Sports Medicine） - ボリューム非等価の場合: 週2回 (ES 0.82), 週3回 (ES 0.93)。頻度増がボリューム増を可能にする。（根拠: Grgic et al. 2018） - 筋肥大: 週2回は週1回より優位。（根拠: Schoenfeld et al. 2016 Sports Medicine） - 部位別推奨: 上半身・多関節種目は週3回以上の高頻度が有効 (p = 0.004)。（根拠: Grgic et al. 2018） ## 3. プラトー期の定義と対策 - 定義: 主要種目の進捗が 3-4週間 停滞した状態。 - 打破方法1（新刺激）: 高度なテクニック導入（ドロップセット、クラスターセット等）。（根拠: Krzysztofik et al. 2019 IJERPH） - 打破方法2（疲労管理）: ディロードの実施。「生理・心理的疲労を軽減し、回復を促進する期間」。（根拠: Bell et al. 2023 BMC Sports Sci） - ディロード最適化: ボリューム（セット数）を30-50%削減し、強度（重量）は維持する。期間は1週間。（根拠: Bell et al. 2023） ## 4. 推奨トレーニングボリューム（部位別・週あたり） - 原則: 筋力・筋肥大ともに「段階的用量反応関係」あり。ボリュームが多いほど効果大。（根拠: Schoenfeld et al. 2017 JSS; Ralston et al. 2017 Sports Med） - 筋肥大（セット追加効果）: 1セット追加ごとに筋肥大ゲイン +0.37%。（根拠: Schoenfeld et al. 2017） - 初心者: 週 10-12 セット / 部位 （根拠: Ralston et al. 2017 - 週5セット以下は非効果的） - 中級・上級者: 週 12-20 セット / 部位 （根拠: Baz-Valle et al. 2022 J Human Kinetics） - 過剰トレーニング閾値: 週20セット以上は、上腕三頭筋では有効 (p=0.01) だが、大腿四頭筋・上腕二頭筋では効果が頭打ちの可能性。（根拠: Baz-Valle et al. 2022） ## 5. 最適休息日数（同一筋群） - 大筋群 (脚・背中・胸): 48-72時間 （根拠: 2024 Review - 下半身・多関節種目は回復が遅い） - 小筋群 (肩・腕): 24-48時間 （根拠: 2024 Review - 上半身は回復が速い） - 生理学的根拠: 筋タンパク質合成(MPS)が最大48時間持続。（根拠: Davies et al. 2024 Translational Sports Medicine） - レベル別: 初心者はMPS持続時間が長く（48h+）、上級者は短い（<24h）。（根拠: Damas et al. 2016 Sports Medicine） ## 6. 推奨トレーニング強度 - 目的別（筋力向上）: 高強度（>60% 1RM）が必須。低強度より有意に優れている。（根拠: Schoenfeld et al. 2017 JSCR） - 目的別（筋肥大）: 「限界までの努力」が重要。限界まで行えば、高強度でも低強度でも筋肥大は同等。（根拠: Schoenfeld et al. 2017） - 限界（Failure）の要否: * 筋力: 不要（ES = -0.09, 有意差なし）。（根拠: Grgic et al. 2022 J Sport Health Sci） * 筋肥大（経験者のみ）: 限界まで行う方が有効 (ES = 0.15, p < 0.05)。（根拠: Grgic et al. 2022） ## 7. 年齢・性別・遺伝要因 - 年齢: 50歳以上でも高強度トレーニングで大幅な筋力向上が可能（例: レッグプレス +29%）。（根拠: Peterson et al. 2010 MSSE） - 性別（筋肥大）: 相対的な筋肥大率に男女差なし。（根拠: 2024 PeerJ Meta-analysis） - 性別（筋力）: 下半身（相対）は男女差なし。上半身（相対）は、女性の方が男性より有意に向上率が高い (ES = -0.60)。（根拠: Roberts et al. 2020 JSCR） - 遺伝（個人差）: 「グローバル・ノンレスポンダー」は存在しない可能性が高い。停滞は「遺伝的限界」ではなく「プログラムのミスマッチ」と捉え、ボリューム・強度・頻度の変更を提案すべき。（根拠: Pickering & Kiely 2019 Sports Medicine）

# workout_isLoading_false_Firestoreから特定種目の直近4回のトレーニング記録を取得_F
source: , }; _isLoading = false; }); } } } /// Get the last four workout records for a specific exercise from Firestore. Future<List<Map<String, dynamic>>> _fetchRecentExerciseHistory( String userId, String exerciseName, ) async { try { // Get workout logs for the last 30 days. final thirtyDaysAgo = DateTime.now().subtract(const Duration(days: 30)); final snapshot = await FirebaseFirestore.instance .collection(
es: , }; _isLoading = false; }); } } } /// Obtener los últimos cuatro registros de entrenamiento de un ejercicio específico desde Firestore. Future<List<Map<String, dynamic>>> _fetchRecentExerciseHistory( String userId, String exerciseName, ) async { try { // Obtener los registros de entrenamiento de los últimos 30 días. final thirteenDaysAgo = DateTime.now().subtract(const Duration(days: 30)); final snapshot = await FirebaseFirestore.instance .collection(
ja: , }; _isLoading = false; }); } } } /// Firestoreから特定種目の直近4回のトレーニング記録を取得 Future<List<Map<String, dynamic>>> _fetchRecentExerciseHistory( String userId, String exerciseName, ) async { try { // 直近30日間のworkoutログを取得 final thirtyDaysAgo = DateTime.now().subtract(const Duration(days: 30)); final snapshot = await FirebaseFirestore.instance .collection(

# general_goalperiod_GoalPeriodweekly_AppLocalizationsofcont
source: Goal ${goal.period == GoalPeriod.weekly ? AppLocalizations.of(context)!.thisWeek : AppLocalizations.of(context)!.thisMonth}
es: Objetivo ${goal.period == GoalPeriod.weekly ? AppLocalizations.of(context)!.thisWeek : AppLocalizations.of(context)!.thisMonth}
ja: ${goal.period == GoalPeriod.weekly ? AppLocalizations.of(context)!.thisWeek : AppLocalizations.of(context)!.thisMonth}の目標

# workout_前回の記録
source: Previous record
es: récord anterior
ja: 前回の記録

# subscription_選択してください
source: please select
es: Por favor seleccione
ja: 選択してください

# workout_もう一度メニューを生成してください_問題が続く場合はサポートにお問い合わせください
source: Please generate the menu again. If the issue persists, please contact support.
es: Por favor, genere el menú de nuevo. Si el problema persiste, contacte con el servicio de asistencia.
ja: もう一度メニューを生成してください。 問題が続く場合は、サポートにお問い合わせください。

# workout_期間開始_monthStart
source: Period start: $monthStart
es: Inicio del período: $monthStart
ja: 期間開始: $monthStart

# personalFactor_020の範囲で入力してください
source: Please enter a value between 0 and 20
es: Por favor, introduzca un valor entre 0 y 20
ja: 0〜20の範囲で入力してください

# subscription_Premiumプランにダウングレードすれば月480節約できます
source: Downgrade to the Premium plan and save ¥480/month
es: Cambia al plan Premium y ahorra ¥480/mes
ja: Premiumプランにダウングレードすれば月¥480節約できます

# error_canUseAI_エラー_e
source: ❌ [canUseAI] Error: $e
ja: ❌ [canUseAI] エラー: $e

# general_対象収益
source: Eligible Revenue
es: Ingresos elegibles
ja: 対象収益

# general_はい使用します
source: Yes, I will
es: Sí, lo haré
ja: はい、使用します

# gym_ホットヨガ
source: Hot Yoga
es: Yoga caliente
ja: ホットヨガ

# general_すぐに使えます
source: Ready to use!
es: ¡Preparado para usar!
ja: すぐに使えます！

# general_紹介バナー表示
source: • Introduction banner display
es: • Visualización del banner de introducción
ja: • 紹介バナー表示

# general_適度な負荷のトレーニングでした_78時間の睡眠とタンパク質補給を心がけましょう
source: It was a moderate-intensity training session. Make sure to get 7-8 hours of sleep and replenish with protein.
es: Fue una sesión de entrenamiento de intensidad moderada. Asegúrate de dormir de 7 a 8 horas y reponer proteínas.
ja: 適度な負荷のトレーニングでした。 7-8時間の睡眠とタンパク質補給を心がけましょう。

# subscription_残り日数取得エラー_e
source: ❌ Error getting remaining days: $e
es: ❌ Error al obtener los días restantes: $e
ja: ❌ 残り日数取得エラー: $e

# subscription_キャッシュ保存エラー_e
source: ⚠️ Cache save error: $e
es: ⚠️ Error al guardar caché: $e
ja: ⚠️ キャッシュ保存エラー: $e

# profile_iOS_設定_Apple_ID_サブスクリプション_GYM_MATCH_サブスクリプションをキャンセ
source: iOS: Settings → Apple ID → Subscriptions → GYM MATCH → Cancel subscription
es: iOS: Ajustes → ID de Apple → Suscripciones → GYM MATCH → Cancelar suscripción
ja: iOS: 設定 → Apple ID → サブスクリプション → GYM MATCH → サブスクリプションをキャンセル

# general_entrykey回
source: ${entry.key} times
es: ${entry.key} veces
ja: ${entry.key}回

# gym_東京都渋谷区渋谷222
source: 2-2-2 Shibuya, Shibuya-ku, Tokyo
es: 2-2-2 Shibuya, Shibuya-ku, Tokio
ja: 東京都渋谷区渋谷2-2-2

# general_中級リフター
source: Intermediate Lifter
es: Levantador intermedio
ja: 中級リフター

# profile_CSVファイルを解析しています
source: Parsing CSV file...
es: Analizando archivo CSV...
ja: CSVファイルを解析しています...

# workout_マッチした種目_exerciseName_weight_set
source: ✅ Matched exercise: $exerciseName (weight: ${set[
es: ✅ Ejercicio coincidente: $exerciseName (peso: ${set[
ja: ✅ マッチした種目: $exerciseName (weight: ${set[

# general_RevenueCat初期化開始
source: 🚀 RevenueCat initialization started...
es: 🚀 Se inició la inicialización de RevenueCat...
ja: 🚀 RevenueCat初期化開始...

# workout_IMPORT_スタックトレース_stackTrace
source: 📋 [IMPORT] Stack Trace: $stackTrace
es: 📋 [IMPORTAR] Seguimiento de la pila: $stackTrace
ja: 📋 [IMPORT] スタックトレース: $stackTrace

# gym_月金_7002300_土日_9002100
source: Mon-Fri 7:00-23:00, Sat-Sun 9:00-21:00
es: Lunes a viernes de 7:00 a 23:00, sábados y domingos de 9:00 a 21:00
ja: 月-金 7:00-23:00, 土日 9:00-21:00

# error_PR更新エラー_e
source: ❌ PR update error: $e
es: ❌ Error de actualización de PR: $e
ja: ❌ PR更新エラー: $e

# workout_10MB以下の画像を使用してください
source: Please use images under 10MB.
es: Utilice imágenes menores a 10 MB.
ja: 10MB以下の画像を使用してください。

# gym_例_SPRING2024
source: Example: SPRING2024
es: Ejemplo: PRIMAVERA2024
ja: 例: SPRING2024

# general_友達申請
source: Friend request
es: Solicitud de amistad
ja: 友達申請

# workout_既存記録に追加セットを追記_existingWorkoutId
source: 🔄 Add additional sets to an existing record: $_existingWorkoutId
es: 🔄 Agregar conjuntos adicionales a un registro existente: $_existingWorkoutId
ja: 🔄 既存記録に追加セットを追記: $_existingWorkoutId

# workout_plateCount枚
source: $plateCount
es: $conteoDePlacas
ja: $plateCount枚

# general_memberslength名
source: ${members.length} names
es: ${members.length} nombres
ja: ${members.length}名

# workout_exerciseName_最大重量maxWeightkg_推定1RMmax1RMtoStringAs
source: - $exerciseName: Maximum weight = ${maxWeight}kg, Estimated 1RM = ${max1RM?.toStringAsFixed(1)}kg, Total sets = $totalSets
es: - $exerciseName: Peso máximo = ${maxWeight}kg, 1RM estimado = ${max1RM?.toStringAsFixed(1)}kg, Total de series = $totalSets
ja: - $exerciseName: 最大重量=${maxWeight}kg, 推定1RM=${max1RM?.toStringAsFixed(1)}kg, 総セット数=$totalSets

# workout_削除デバッグ
source: 🔍 Deletion Debug
es: 🔍 Depuración de eliminación
ja: 🔍 削除デバッグ

# profile_法令または公序良俗に違反する行為
source: • Acts that violate laws, regulations, or public order and morals
es: • Actos que violen las leyes, los reglamentos o el orden público y la moral.
ja: • 法令または公序良俗に違反する行為

# profile_8390817_福岡県久留米市瀬下町243
source: 〒839-0817 243 Seshitacho, Kurume City, Fukuoka Prefecture
es: 〒839-0817 243 Seshitacho, ciudad de Kurume, prefectura de Fukuoka
ja: 〒839-0817 福岡県久留米市瀬下町243

# general_アプリは最新版です
source: ✅ The app is up to date
es: ✅ La aplicación está actualizada
ja: ✅ アプリは最新版です

# profile_本サービスのトレーニング提案は参考情報であり医学的アドバイスではありません
source: • The training suggestions in this service are for reference only and do not constitute medical advice.
es: • Las sugerencias de entrenamiento de este servicio son solo de referencia y no constituyen asesoramiento médico.
ja: • 本サービスのトレーニング提案は参考情報であり、医学的アドバイスではありません

# error_Firebase初期化エラーオフラインモードで起動_e
source: ❌ Firebase initialization error (launching in offline mode): $e
es: ❌ Error de inicialización de Firebase (inicio en modo sin conexión): $e
ja: ❌ Firebase初期化エラー（オフラインモードで起動）: $e

# workout_WorkoutLogScreen_既にログイン済み_useruid
source: ✅ [WorkoutLogScreen] Already logged in: ${user.uid}
es: ✅ [WorkoutLogScreen] Ya inició sesión: ${user.uid}
ja: ✅ [WorkoutLogScreen] 既にログイン済み: ${user.uid}

# general_権限リクエスト結果_permission
source: 📋 Permission request result: $permission
es: Resultado de la solicitud de permiso: $permission
ja: 📋 権限リクエスト結果: $permission

# general_テンプレートをコピーしました
source: ✅ Template copied!
es: ✅ ¡Plantilla copiada!
ja: ✅ テンプレートをコピーしました！

# profile_メッセージ機能
source: Message function
es: Función de mensaje
ja: メッセージ機能

# general_reps秒
source: ${reps} seconds
es: ${reps} segundos
ja: ${reps}秒

# general_紹介コードを入力する
source: Enter your referral code
es: Ingrese su código de referencia
ja: 紹介コードを入力する

# profile_localeInfonativeNameに変更されました
source: Changed to ${localeInfo.nativeName}.
es: Cambiado a ${localeInfo.nativeName}.
ja: ${localeInfo.nativeName}に変更されました。

# workout_いつでも追加購入可能
source: • You can purchase more at any time
es: • Puedes comprar más en cualquier momento.
ja: • いつでも追加購入可能

# error_データマッピングエラー_i_e
source: ❌ Data mapping error [$i]: $e
es: ❌ Error de mapeo de datos [$i]: $e
ja: ❌ データマッピングエラー [$i]: $e

# general_招待した側_AI追加パック1個5回分300相当
source: Inviter: 1 AI Add-on Pack (5 times, worth ¥300)
es: Invitador: 1 paquete adicional de IA (5 veces, valor de ¥300)
ja: 招待した側: AI追加パック×1個（5回分、¥300相当）

# gym_パーソナル指導
source: Personal Guidance
es: Orientación personal
ja: パーソナル指導

# subscription_終了したトライアル期間
source: Expired trial period
es: Período de prueba vencido
ja: 終了したトライアル期間

# subscription_月換算_400
source: Monthly equivalent ¥400
es: Equivalente mensual ¥400
ja: 月換算 ¥400

# workout_メニュー
source: menu
es: menú
ja: メニュー

# general_居住地経験レベル目標で絞り込めます
source: You can filter by location, experience level, and goals.
es: Puede filtrar por ubicación, nivel de experiencia y objetivos.
ja: 居住地・経験レベル・目標で絞り込めます

# workout_トレーニングレベル
source: Training Level
es: Nivel de formación
ja: トレーニングレベル

# general_AIクレジット1回分を獲得しましたテストモード
source: ✅ Earned 1 AI credit! (Test mode)
es: ¡Obtuviste 1 crédito de IA! (Modo de prueba)
ja: ✅ AIクレジット1回分を獲得しました！（テストモード）

# general_bodyPart_のボリューム_週recommendedVolume
source: * Volume of $bodyPart: week ${recommendedVolume[
es: * Volumen de $bodyPart: semana ${recommendedVolume[
ja: * $bodyPart のボリューム: 週${recommendedVolume[

# general_野球場
source: baseball field
es: campo de béisbol
ja: 野球場

# personalFactor_動的要因
source: ⚡ Dynamic factors
es: ⚡ Factores dinámicos
ja: ⚡ 動的要因

# general_ユーザー未ログイン
source: ⚠️ User not logged in
es: ⚠️ Usuario no conectado
ja: ⚠️ ユーザー未ログイン

# workout_dsセット
source: (\d+)\s* set
es: (\d+)\s* conjunto
ja: (\d+)\s*セット

# workout_API過負荷_503retryDelayinSeconds秒後に再試行
source: ⚠️ API Overload (503). Retrying in ${retryDelay.inSeconds} seconds...
es: Sobrecarga de API (503). Reintentando en ${retryDelay.inSeconds} segundos...
ja: ⚠️ API過負荷 (503)。${retryDelay.inSeconds}秒後に再試行...

# general_累計1000kg達成
source: Achieved a cumulative total of 1,000kg
es: Se logró un total acumulado de 1.000 kg.
ja: 累計1,000kg達成

# workout_PR記録取得エラー_e
source: ❌ PR record retrieval error: $e
es: ❌ Error de recuperación de registro PR: $e
ja: ❌ PR記録取得エラー: $e

# general_セットを削除しました
source: Set deleted
es: Conjunto eliminado
ja: セットを削除しました

# profile_マッチングリクエスト送信
source: Send a matching request
es: Enviar una solicitud de coincidencia
ja: マッチングリクエスト送信

# profile_ただし以下の場合は返金申請が可能です
source: However, you can request a refund in the following cases:
es: Sin embargo, puede solicitar un reembolso en los siguientes casos:
ja: ただし、以下の場合は返金申請が可能です：

# general_レビュー済みフラグをセット
source: ✅ Set Reviewed Flag
es: ✅ Establecer bandera revisada
ja: ✅ レビュー済みフラグをセット
