Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# general_完全無料API費用なし
source: ✅ Completely free (no API fees)
es: ✅ Completamente gratis (sin tarifas de API)
ja: ✅ 完全無料（API費用なし）

# workout_トレーニング記録の取り込み
source: 📸 Importing training records
es: 📸 Importación de registros de formación
ja: 📸 トレーニング記録の取り込み

# general_組み合わせを計算します
source: Calculate the combinations.
es: Calcular la combinación.
ja: 組み合わせを計算します。

# general_ROI_43365万円月
source: 📊 ROI 433% (+65,000 yen/month)
es: 📊 ROI 433% (+65.000 yenes/mes)
ja: 📊 ROI 433%（+6.5万円/月）

# error_トレーナー記録の取得に失敗しました
source: Failed to retrieve trainer records
es: No se pudieron recuperar los registros del entrenador
ja: トレーナー記録の取得に失敗しました

# general_トレーニング記録を編集
source: Edit training records
es: Editar registros de entrenamiento
ja: トレーニング記録を編集

# workout_バーの重量_barWeightkgより大きい値を入力してください
source: Please enter a value greater than the bar weight (${_barWeight}kg)
es: Ingrese un valor mayor que el peso de la barra (${_barWeight}kg)
ja: バーの重量（${_barWeight}kg）より大きい値を入力してください

# workout_種目名
source: ・Event name:
es: ・Nombre del evento:
ja: ・ 種目名：

# general_バックグラウンド初期化完了
source: ✅ Background initialization completed
es: ✅ Inicialización en segundo plano completada
ja: ✅ バックグラウンド初期化完了

# subscription_変更する
source: Change
es: Cambiar
ja: 変更する

# profile_広告表示ありAI機能は広告視聴で月3回まで利用可能
source: (Ads are displayed, and the AI function can be used up to three times a month by watching ads)
es: (Se muestran anuncios y la función de IA se puede utilizar hasta tres veces al mes viendo anuncios)
ja: （広告表示あり、AI機能は広告視聴で月3回まで利用可能）

# workout_ドキュメントID_docid
source: Document ID: ${doc.id}
es: ID del documento: ${doc.id}
ja: ドキュメントID: ${doc.id}

# general_14日間無料_1
source: Free for 14 days 🎁
es: Gratis por 14 días 🎁
ja: 14日間無料🎁

# general_スタートダッシュ成功
source: A successful start!
es: ¡Un comienzo exitoso!
ja: スタートダッシュ成功！

# general_アカウントがブロックされています_サポートにお問い合わせください
source: Your account has been blocked. Please contact support.
es: Tu cuenta ha sido bloqueada. Contacta con el servicio de asistencia.
ja: アカウントがブロックされています。 サポートにお問い合わせください。

# profile_クレジットカードデビットカードApple_IDに登録された支払い方法による決済
source: *Payment by credit card, debit card, or payment method registered to your Apple ID
es: *Pago con tarjeta de crédito, tarjeta de débito o método de pago registrado en su ID de Apple
ja: ※クレジットカード、デビットカード、Apple IDに登録された支払い方法による決済

# workout_日付_selectedDate
source: Date: $_selectedDate
es: Fecha: $_selectedDate
ja: 日付: $_selectedDate

# general_Proプランにアップグレードで全ユーザーを検索可能
source: Upgrade to Pro plan to search all users
es: Actualice al plan Pro para buscar a todos los usuarios
ja: Proプランにアップグレードで全ユーザーを検索可能

# workout_現在の状態_currentExerciseName_weightcurrentWeight_reps
source: 📝 Current state ($currentExerciseName): weight=$currentWeight, reps=$currentReps, sets=$currentSets
es: 📝 Estado actual ($currentExerciseName): peso=$currentWeight, repeticiones=$currentReps, series=$currentSets
ja: 📝 現在の状態 ($currentExerciseName): weight=$currentWeight, reps=$currentReps, sets=$currentSets

# error_同期エラー次回リトライ_e
source: ⚠️ Sync error (retry next): $e
es: ⚠️ Error de sincronización (reintentar a continuación): $e
ja: ⚠️ 同期エラー（次回リトライ）: $e

# error_位置情報取得エラー_e
source: ❌ Location acquisition error: $e
es: ❌ Error de adquisición de ubicación: $e
ja: ❌ 位置情報取得エラー: $e

# general_背中をまっすぐに保つ
source: Keep your back straight
es: Mantén la espalda recta
ja: 背中をまっすぐに保つ

# workout_今月の無料動画視聴は上限3回に達しました
source: You have reached the limit of free video viewings this month (3 times).
es: Has alcanzado el límite de visualizaciones de vídeos gratuitas este mes (3 veces).
ja: 今月の無料動画視聴は上限（3回）に達しました。

# workout_トレーニング部位を選択
source: Select training area
es: Seleccionar área de formación
ja: トレーニング部位を選択

# general_情報メッセージ
source: Information Messages
es: Mensajes de información
ja: 情報メッセージ

# general_3日連続トレーニング達成
source: Completed training for 3 consecutive days
es: Entrenamiento completado durante 3 días consecutivos
ja: 3日連続トレーニング達成

# general_週1回
source: Once a week
es: Una vez a la semana
ja: 週1回

# profile_既に画像選択処理中です
source: ⚠️ Image selection is already in progress
es: ⚠️ La selección de imágenes ya está en proceso
ja: ⚠️ 既に画像選択処理中です

# workout_Tab_3_効果分析タブ_class_EffectAnalysisTab_extends_State
source: ; } } // ========================================= // Tab 3: Effect Analysis Tab // ========================================= class _EffectAnalysisTab extends StatefulWidget { @override State<_EffectAnalysisTab> createState() => _EffectAnalysisTabState(); } class _EffectAnalysisTabState extends State<_EffectAnalysisTab> with AutomaticKeepAliveClientMixin { @override bool get wantKeepAlive => true; // Form input values final _formKey = GlobalKey<FormState>(); late String _selectedBodyPart; String _selectedExercise =
es: ; } } // ========================================== // Pestaña 3: Pestaña Análisis de Efectos // ============================================= class _EffectAnalysisTab extends StatefulWidget { @override State<_EffectAnalysisTab> createState() => _EffectAnalysisTabState(); } class _EffectAnalysisTabState extends State<_EffectAnalysisTab> with AutomaticKeepAliveClientMixin { @override bool get wantKeepAlive => true; // Valores de entrada del formulario final _formKey = GlobalKey<FormState>(); late String _selectedBodyPart; String _selectedExercise =
ja: ; } } // ======================================== // Tab 3: 効果分析タブ // ======================================== class _EffectAnalysisTab extends StatefulWidget { @override State<_EffectAnalysisTab> createState() => _EffectAnalysisTabState(); } class _EffectAnalysisTabState extends State<_EffectAnalysisTab> with AutomaticKeepAliveClientMixin { @override bool get wantKeepAlive => true; // フォーム入力値 final _formKey = GlobalKey<FormState>(); late String _selectedBodyPart; String _selectedExercise =

# general_SNS投稿待ち
source: Waiting for SNS post
es: Esperando publicación de redes sociales
ja: SNS投稿待ち

# workout_テンプレートからexerciseslength種目を読み込み
source: 📋 Load ${exercises.length} exercises from template
es: 📋 Cargar ${exercises.length} ejercicios desde la plantilla
ja: 📋 テンプレートから${exercises.length}種目を読み込み

# general_市民センター
source: Civic Center
es: Centro Cívico
ja: 市民センター

# general_この記録をSNSでシェアしますか
source: Would you like to share this record on social media?
es: ¿Te gustaría compartir este disco en las redes sociales?
ja: この記録をSNSでシェアしますか？

# general_時空間フィルター有効_検索者のジム_userGymId_時間_userPreferredHours
source: 🕐 Temporal filter enabled - Searcher's gym: $userGymId, time: $userPreferredHours
es: 🕐 Filtro temporal habilitado - Gimnasio del buscador: $userGymId, hora: $userPreferredHours
ja: 🕐 時空間フィルター有効 - 検索者のジム: $userGymId, 時間: $userPreferredHours

# workout_回数sds回reps
source: Number of times[::]?\s*(\d+)\s*(?:times|reps?)?
es: Número de veces[::]?\s*(\d+)\s*(?:veces|repeticiones?)?
ja: 回数[:：]?\s*(\d+)\s*(?:回|reps?)?

# general_電話番号
source: telephone number *
es: número de teléfono *
ja: 電話番号 *

# general_AIクレジット追加_amount_合計_newTotal
source: ✅ AI Credits Added: +$amount (Total: $newTotal)
es: ✅ Créditos de IA añadidos: +$monto (Total: $newTotal)
ja: ✅ AIクレジット追加: +$amount (合計: $newTotal)

# general_デバッグメッセージ
source: Debug messages
es: Mensajes de depuración
ja: デバッグメッセージ

# gym_キャンペーン
source: campaign
es: campaña
ja: キャンペーン

# workout_リクエストエラー_400_responsebody
source: ❌ Request Error (400): ${response.body}
es: ❌ Error de solicitud (400): ${response.body}
ja: ❌ リクエストエラー (400): ${response.body}

# personalFactor_1年_110x_35年_095x_5年_090x
source: <1 year: 1.10x, 3-5 years: 0.95x, 5+ years: 0.90x
es: <1 año: 1,10x, 3-5 años: 0,95x, 5+ años: 0,90x
ja: <1年: 1.10x, 3-5年: 0.95x, 5+年: 0.90x

# subscription_プラン変更エラー_e
source: ❌ Plan change error: $e
es: ❌ Error de cambio de plan: $e
ja: ❌ プラン変更エラー: $e

# general_対応する
source: handle
es: manejar
ja: 対応する

# workout_style_TextStyle_fontSize_16_fontWeight_FontWeightb_2
source: , style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, ), ), ], ), const SizedBox(height: 12), Row( children: [ Container( padding: const EdgeInsets.symmetric(horizontal: 12, vertical: 6), decoration: BoxDecoration( color: statusColor.withValues(alpha: 0.2), Radius: BorderRadius.circular(16), ), child: Text( statusLabel, style: TextStyle( color: statusColor, fontWeight: FontWeight.bold, ), ), ), ], ), const SizedBox(height: 12), Text( advice, style: const TextStyle(fontSize: 14, height: 1.6), ), ], ), ), ); } /// Plateau warning Widget _buildPlateauWarning() { return Card( color: Colors.orange.shade50, child: Padding( padding: const EdgeInsets.all(16.0), child: Row( children: [ Icon(Icons.warning_amber, size: 40, color: Colors.orange.shade700), const SizedBox(width: 16), Expanded( child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Text(
es: , estilo: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, ), ), ], ), const SizedBox(altura: 12), Row( hijos: [ Container( padding: const EdgeInsets.symmetric(horizontal: 12, vertical: 6), decoration: BoxDecoration( color: statusColor.withValues(alpha: 0.2), Radius: BorderRadius.circular(16), ), hijo: Text( statusLabel, estilo: TextStyle( color: statusColor, fontWeight: FontWeight.bold, ), ), ), ], ), const SizedBox(altura: 12), Text( advertencia, estilo: const TextStyle(fontSize: 14, altura: 1.6), ), ], ), ), ); } /// Advertencia de meseta Widget _buildPlateauWarning() { return Card( color: Colors.orange.shade50, child: Padding( padding: const EdgeInsets.all(16.0), child: Row( children: [ Icon(Icons.warning_amber, size: 40, color: Colors.orange.shade700), const SizedBox(width: 16), Expanded( child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Text(
ja: , style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, ), ), ], ), const SizedBox(height: 12), Row( children: [ Container( padding: const EdgeInsets.symmetric(horizontal: 12, vertical: 6), decoration: BoxDecoration( color: statusColor.withValues(alpha: 0.2), borderRadius: BorderRadius.circular(16), ), child: Text( statusLabel, style: TextStyle( color: statusColor, fontWeight: FontWeight.bold, ), ), ), ], ), const SizedBox(height: 12), Text( advice, style: const TextStyle(fontSize: 14, height: 1.6), ), ], ), ), ); } /// プラトー警告 Widget _buildPlateauWarning() { return Card( color: Colors.orange.shade50, child: Padding( padding: const EdgeInsets.all(16.0), child: Row( children: [ Icon(Icons.warning_amber, size: 40, color: Colors.orange.shade700), const SizedBox(width: 16), Expanded( child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Text(

# subscription_トライアル条件達成
source: Trial conditions met!
es: ¡Se cumplieron las condiciones del juicio!
ja: トライアル条件達成！

# workout_style_TextStyle_fontSize_13_color_Colorsgreyshade7_1
source: , style: TextStyle( fontSize: 13, color: Colors.grey.shade700, ), ), ], ), ), ], ), ), ); } /// Input form Widget _buildInputForm() { return Card( child: Padding( padding: const EdgeInsets.all(16.0), child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ const Text(
es: , estilo: TextStyle( tamaño de fuente: 13, color: Colors.grey.shade700, ), ), ], ), ), ], ), ), ); } /// Formulario de entrada Widget _buildInputForm() { return Card( child: Padding( padding: const EdgeInsets.all(16.0), child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ const Text(
ja: , style: TextStyle( fontSize: 13, color: Colors.grey.shade700, ), ), ], ), ), ], ), ), ); } /// 入力フォーム Widget _buildInputForm() { return Card( child: Padding( padding: const EdgeInsets.all(16.0), child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ const Text(

# general_パスワードが間違っています
source: Incorrect password
es: Contraseña incorrecta
ja: パスワードが間違っています

# workout_IMPORT_プロフィール画面に戻りました
source: ✅ [IMPORT] Returned to profile screen
es: ✅ [IMPORTAR] Regresó a la pantalla de perfil
ja: ✅ [IMPORT] プロフィール画面に戻りました

# general_入会日
source: Joining date
es: Fecha de ingreso
ja: 入会日

# workout_種目を追加カスタム
source: Add an event (custom)
es: Agregar un evento (personalizado)
ja: 種目を追加（カスタム）

# profile_Premiumプラン_500月税込
source: Premium Plan: ¥500/month (tax included)
es: Plan Premium: ¥500/mes (impuestos incluidos)
ja: Premiumプラン: ¥500/月（税込）

# general_渋谷_ジム
source: Shibuya Gym
es: Gimnasio Shibuya
ja: 渋谷 ジム

# general_他社アプリから乗り換えで
source: Switch from other companies' apps
es: Cambiar de aplicaciones de otras empresas
ja: 他社アプリから乗り換えで

# general_Google_Places_APIで周辺のジムを検索中
source: 🌐 Searching for nearby gyms using Google Places API...
es: 🌐 Buscando gimnasios cercanos usando la API de Google Places...
ja: 🌐 Google Places APIで周辺のジムを検索中...

# personalFactor_ユニット
source: unit
es: unidad
ja: ユニット

# general_目標達成
source: goal achievement
es: logro de objetivos
ja: 目標達成

# workout_メモを入力してください
source: Enter your notes
es: Introduce tus notas
ja: メモを入力してください

# profile_リマインダー時刻を_formatTime_reminderTimeに設定しました
source: Reminder time set to ${_formatTime(_reminderTime)}
es: Hora de recordatorio establecida en ${_formatTime(_reminderTime)}
ja: リマインダー時刻を${_formatTime(_reminderTime)}に設定しました

# workout_説明s
source: Description[::]\s*
es: Descripción[::]\s*
ja: 説明[:：]\s*

# profile_Pro限定機能です
source: This is a Pro-only feature
es: Esta es una función exclusiva para Pro
ja: Pro限定機能です

# general_週間統計取得_weeklyStats
source: 📊 Get weekly statistics: $weeklyStats
es: 📊 Obtén estadísticas semanales: $weeklyStats
ja: 📊 週間統計取得: $weeklyStats

# general_紹介ボーナス_referralBonus回
source: 🎁Referral Bonus: $referralBonus times
es: Bono por recomendación: $referralBonus veces
ja: 🎁紹介ボーナス: $referralBonus回

# workout_休憩時間設定
source: Break time setting
es: Configuración del tiempo de descanso
ja: 休憩時間設定

# general_β版パートナー
source: 🏆 Beta Partners
es: 🏆 Socios Beta
ja: 🏆 β版パートナー

# workout_トレーニングしたい部位を選択するとAIが最適なメニューを提案します
source: Once you select the area you want to train, the AI will suggest the optimal menu.
es: Una vez que selecciones la zona que quieres entrenar, la IA te sugerirá el menú óptimo.
ja: トレーニングしたい部位を選択すると、AIが最適なメニューを提案します。

# subscription_プレミアムプランにアップグレードして機能を継続利用
source: Upgrade to a Premium plan to continue enjoying the features
es: Actualice a un plan Premium para seguir disfrutando de las funciones
ja: プレミアムプランにアップグレードして機能を継続利用

# workout_履歴の取得に失敗しました_e
source: Failed to get history: $e
es: No se pudo obtener el historial: $e
ja: 履歴の取得に失敗しました: $e

# general_ユーザーフラグ_userId_flagType_reason
source: 🚩 User flag: $userId - $flagType - $reason
es: 🚩 Bandera de usuario: $userId - $flagType - $reason
ja: 🚩 ユーザーフラグ: $userId - $flagType - $reason

# general_統計データを計算中
source: 📊 Calculating statistics...
es: 📊 Calculando estadísticas...
ja: 📊 統計データを計算中...

# gym_女性専用フィットネスジム30分のサーキットトレーニング
source: Women-only fitness gym. 30-minute circuit training.
es: Gimnasio de fitness exclusivo para mujeres. Entrenamiento en circuito de 30 minutos.
ja: 女性専用フィットネスジム。30分のサーキットトレーニング。

# gym_entryvalue台
source: ${entry.value} level
es: nivel ${entry.value}
ja: ${entry.value}台

# error_目標の読み込みエラー_e
source: ❌ Error loading goal: $e
es: ❌ Error al cargar el objetivo: $e
ja: ❌ 目標の読み込みエラー: $e

# general_AI_1回分をプレゼント報告resultreportCount回目
source: 🎁 Get 1 AI session! (Report ${result.reportCount} times)
es: ¡Consigue una sesión de IA! (Reportar ${result.reportCount} veces)
ja: 🎁 AI 1回分をプレゼント！（報告${result.reportCount}回目）

# general_レベル別最適ボリューム
source: Optimal volume by level
es: Volumen óptimo por nivel
ja: レベル別最適ボリューム

# general_広告を準備中ですしばらくお待ちください
source: Preparing your ad... Please wait
es: Preparando su anuncio... Por favor espere
ja: 広告を準備中です...しばらくお待ちください

# general_予約申込後店舗から確認のご連絡があります_この申込は仮予約です店舗の確認をもって予約確定となります
source: * After you make a reservation, the store will contact you to confirm. * This reservation is a tentative reservation. Your reservation will be confirmed once the store confirms it.
es: * Después de realizar su reserva, la tienda se pondrá en contacto con usted para confirmarla. * Esta reserva es provisional. Su reserva se confirmará una vez que la tienda la confirme.
ja: ※ 予約申込後、店舗から確認のご連絡があります。 ※ この申込は仮予約です。店舗の確認をもって予約確定となります。

# workout_一括入力
source: Bulk input
es: Entrada masiva
ja: 一括入力

# error_アラート設定取得エラー_e
source: ❌ Error getting alert settings: $e
es: ❌ Error al obtener la configuración de alertas: $e
ja: ❌ アラート設定取得エラー: $e

# subscription_メッセージング
source: Messaging
es: Mensajería
ja: メッセージング

# general_キャンペーン編集
source: 🏆 Campaign Edit
es: 🏆 Edición de campaña
ja: 🏆 キャンペーン編集

# general_AI追加パック5回分を購入しました
source: I purchased the AI add-on pack (5 times)!
es: ¡Compré el paquete adicional de IA (5 veces)!
ja: AI追加パック（5回分）を購入しました！

# general_Google_Placesデータをそのまま使用します
source: Uses Google Places data as is
es: Utiliza los datos de Google Places tal como están
ja: Google Placesデータをそのまま使用します

# general_ハックスクワット
source: Hack Squats
es: Sentadillas Hack
ja: ハックスクワット

# general_ラット
source: rat
es: rata
ja: ラット

# general_セット削除開始_Workout_IDworkoutId_Set_IndexsetIndex
source: 🗑️ Start Set Deletion: Workout ID=$workoutId, Set Index=$setIndex
es: 🗑️ Eliminación del conjunto inicial: ID de entrenamiento = $workoutId, índice del conjunto = $setIndex
ja: 🗑️ セット削除開始: Workout ID=$workoutId, Set Index=$setIndex

# general_10日連続達成
source: Achieved 10 days in a row!
es: ¡Lo conseguí durante 10 días seguidos!
ja: 10日連続達成！

# general_肘を後ろに引くイメージで
source: Imagine pulling your elbows back
es: Imagina tirar los codos hacia atrás
ja: 肘を後ろに引くイメージで

# general_予約とセッション履歴
source: Booking and Session History
es: Historial de reservas y sesiones
ja: 予約とセッション履歴

# workout_AI追加パック300
source: 💰 AI Add-on Pack (¥300):
es: Paquete adicional de IA (¥300):
ja: 💰 AI追加パック（¥300）:

# general_ネガティブ動作の負荷を意図的に高める
source: Intentionally increasing the load of negative movements
es: Aumentar intencionalmente la carga de movimientos negativos
ja: ネガティブ動作の負荷を意図的に高める

# general_100日連続達成
source: Achieved 100 consecutive days!
es: ¡Conseguiste 100 días consecutivos!
ja: 100日連続達成！

# general_Free会員は混雑度アラート非対応
source: ⚠️ Free members are not eligible for congestion alerts
es: ⚠️ Los miembros gratuitos no son elegibles para alertas de congestión
ja: ⚠️ Free会員は混雑度アラート非対応

# workout_軽め
source: Light
es: Luz
ja: 軽め

# general_残り
source: Remaining: ∞
es: Restante: ∞
ja: 残り: ∞

# workout_画像解析開始_試行_attemptmaxRetries
source: 📸 Image analysis starting... (attempts $attempt/$maxRetries)
es: Análisis de imagen iniciando... (intentos $attempt/$maxRetries)
ja: 📸 画像解析開始... (試行 $attempt/$maxRetries)

# subscription_機能比較
source: Feature Comparison
es: Comparación de características
ja: 機能比較

# general_7日間連続達成
source: Achieved 7 days in a row! 🎉
es: ¡Lo conseguí 7 días seguidos! 🎉
ja: 7日間連続達成！🎉

# personalFactor_睡眠時間_回復の質
source: • Sleep duration: quality of recovery
es: • Duración del sueño: calidad de la recuperación
ja: • 睡眠時間: 回復の質

# workout_オフライン保存成功_localId
source: ✅ Offline save successful: $localId
es: ✅ Guardado sin conexión exitoso: $localId
ja: ✅ オフライン保存成功: $localId

# workout_荷重_kg
source: Load (kg)
es: Carga (kg)
ja: 荷重 (kg)

# general_ジム詳細画面でチェックインすると_ここに履歴が表示されます
source: When you "check in" on the gym details screen, your history will be displayed here.
es: Cuando "realices el check-in" en la pantalla de detalles del gimnasio, tu historial se mostrará aquí.
ja: ジム詳細画面で「チェックイン」すると ここに履歴が表示されます

# general_段階的な品質改善
source: ✅ Gradual quality improvement
es: ✅ Mejora gradual de la calidad
ja: ✅ 段階的な品質改善
