Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# workout_既存記録にnewSetslengthセット追加しました
source: ✅ Added ${newSets.length} sets to existing record
es: ✅ Se agregaron ${newSets.length} conjuntos al registro existente
ja: ✅ 既存記録に${newSets.length}セット追加しました

# general_キャッシュ無効化_cacheKey
source: ✅ Cache invalidation: $cacheKey
es: ✅ Invalidación de caché: $cacheKey
ja: ✅ キャッシュ無効化: $cacheKey

# general_通知タップ_responsepayload
source: 📱 Notification tap: ${response.payload}
es: 📱 Toque de notificación: ${response.payload}
ja: 📱 通知タップ: ${response.payload}

# general_AI追加パック購入完了
source: ✅ AI add-on pack purchased
es: ✅ Paquete complementario de IA adquirido
ja: ✅ AI追加パック購入完了

# general_お気に入りをすべてクリア
source: ✅ Clear all favorites
es: ✅ Borrar todos los favoritos
ja: ✅ お気に入りをすべてクリア

# general_PO管理者ダッシュボード
source: PO Admin Dashboard
es: Panel de administración de PO
ja: PO管理者ダッシュボード

# subscription_メモリキャッシュ使用_memoryCache_キャッシュ年齢_cacheAgeinMinutes分
source: ⚡ Memory cache used: $_memoryCache (cache age: ${cacheAge.inMinutes} minutes)
es: ⚡ Memoria caché utilizada: $_memoryCache (antigüedad de la caché: ${cacheAge.inMinutes} minutos)
ja: ⚡ メモリキャッシュ使用: $_memoryCache (キャッシュ年齢: ${cacheAge.inMinutes}分)

# workout_レスポンスボディ最初の200文字_responsebodysubstring0_responsebo
source: 📄 Response body (first 200 characters): ${response.body.substring(0, response.body.length > 200 ? 200 : response.body.length)}
es: 📄 Cuerpo de la respuesta (primeros 200 caracteres): ${response.body.substring(0, response.body.length > 200 ? 200 : response.body.length)}
ja: 📄 レスポンスボディ（最初の200文字）: ${response.body.substring(0, response.body.length > 200 ? 200 : response.body.length)}

# subscription_トライアル達成まであと少し
source: Almost there to complete the trial
es: Ya casi estamos para completar la prueba
ja: トライアル達成まであと少し

# error_Firestore更新エラー_e
source: ❌ Firestore update error: $e
es: ❌ Error de actualización de Firestore: $e
ja: ❌ Firestore更新エラー: $e

# profile_トレーニングパートナーマッチング
source: 🤝 Training partner matching
es: 🤝 Emparejamiento de compañeros de entrenamiento
ja: 🤝 トレーニングパートナーマッチング

# workout_回数_reps
source: Reps
es: Representantes
ja: 回数 (reps)

# error_予約送信に失敗しました_e
source: ❌ Scheduled sending failed: $e
es: ❌ Envío programado fallido: $e
ja: ❌ 予約送信に失敗しました: $e

# workout_テンプレートがありません
source: No templates
es: Sin plantillas
ja: テンプレートがありません

# general_ログをクリアしました
source: Log cleared
es: Registro borrado
ja: ログをクリアしました

# workout_seconds秒
source: $seconds seconds
es: $segundos segundos
ja: $seconds秒

# general_完了
source: completion!
es: ¡terminación!
ja: 完了！

# workout_使い方のヒント
source: Usage tips
es: Consejos de uso
ja: 使い方のヒント

# general_目標進捗更新_goalname_currentValue_goaltargetValuegoalun
source: 📊 Goal progress update: ${goal.name} - $currentValue / ${goal.targetValue}${goal.unit}
es: 📊 Actualización del progreso del objetivo: ${goal.name} - $currentValue / ${goal.targetValue}${goal.unit}
ja: 📊 目標進捗更新: ${goal.name} - $currentValue / ${goal.targetValue}${goal.unit}

# general_データ精度
source: Data accuracy
es: Precisión de los datos
ja: データ精度

# general_シェアイベント記録_shareType
source: ✅ Share event record: $shareType
es: ✅ Compartir registro de evento: $shareType
ja: ✅ シェアイベント記録: $shareType

# general_保存して即反映
source: 💾 Save and reflect immediately
es: 💾 Guarda y reflexiona inmediatamente
ja: 💾 保存して即反映

# profile_利用可能な曜日
source: Available days
es: Días disponibles
ja: 利用可能な曜日

# workout_集計期間
source: Aggregation period
es: Período de agregación
ja: 集計期間

# general_メモ保存_lognotes
source: ✅ Save notes: ${log.notes}
es: ✅ Guardar notas: ${log.notes}
ja: ✅ メモ保存: ${log.notes}

# workout_オフ日として登録しました
source: I registered it as a day off
es: Lo registré como día libre.
ja: オフ日として登録しました

# general_拮抗筋または上下半身を組み合わせ
source: Combining antagonistic muscles or upper and lower body
es: Combinación de músculos antagónicos o parte superior e inferior del cuerpo.
ja: 拮抗筋または上下半身を組み合わせ

# workout_メモを削除
source: Delete a note
es: Eliminar una nota
ja: メモを削除

# general_シェアする
source: Share
es: Compartir
ja: シェアする

# error_招待コードの適用に失敗しました
source: Failed to apply invitation code
es: No se pudo aplicar el código de invitación
ja: 招待コードの適用に失敗しました

# workout_reps回_1
source: } × ${reps} times
es: } × ${reps} veces
ja: } × ${reps}回

# general_API費用の予算確保
source: ✅ Secure a budget for API costs
es: ✅ Asegurar un presupuesto para los costos de API
ja: ✅ API費用の予算確保

# general_週recommendedFrequency_currentFrequency回でボリューム増加可能G
source: Volume can be increased +${recommendedFrequency - currentFrequency} times per week (Grgic 2018)
es: El volumen se puede aumentar +${recommendedFrequency - currentFrequency} veces por semana (Grgic 2018)
ja: 週+${recommendedFrequency - currentFrequency}回でボリューム増加可能（Grgic 2018）

# general_ほとんど人がいません
source: There are hardly any people
es: Apenas hay gente
ja: ほとんど人がいません

# gym_ジムレビューの投稿
source: • Post a gym review
es: • Publica una reseña del gimnasio
ja: • ジムレビューの投稿

# general_プロのトレーナーによる_マンツーマン指導
source: One-on-one instruction by a professional trainer
es: Instrucción personalizada de un entrenador profesional
ja: プロのトレーナーによる マンツーマン指導

# error_日本語ロケール初期化失敗継続可能
source: Japanese locale initialization failed (continuable)
es: Error en la inicialización de la configuración regional japonesa (continuable)
ja: 日本語ロケール初期化失敗（継続可能）

# workout_最大試行回数に達しました
source: ❌ Maximum attempts reached
es: ❌ Máximo de intentos alcanzado
ja: ❌ 最大試行回数に達しました

# error_お気に入り取得エラー_e
source: ❌ Favorites retrieval error: $e
es: ❌ Error al recuperar favoritos: $e
ja: ❌ お気に入り取得エラー: $e

# general_お名前
source: Name *
es: Nombre *
ja: お名前 *

# profile_インターネット接続料金通信費等はお客様のご負担となります
source: Internet connection fees, communication costs, etc. are the responsibility of the customer.
es: Los costos de conexión a Internet, costos de comunicación, etc. son responsabilidad del cliente.
ja: インターネット接続料金、通信費等はお客様のご負担となります。

# workout_backgroundColor_Colorsred_return_広告視聴成功_下記のAI生成処理に
source: ), backgroundColor: Colors.red, ), ); } return; } // Ad viewing successful → Proceed to the AI generation process below. } else { // User canceled. return; } } else { // This month's ad viewing limit has been reached. if (mounted) { await _showUpgradeDialog(
es: ), backgroundColor: Colors.red, ), ); } return; } // Visualización del anuncio exitosa → Continúe con el proceso de generación de IA a continuación. } else { // Usuario cancelado. return; } } else { // Se alcanzó el límite de visualización de anuncios de este mes. if (mounted) { await _showUpgradeDialog(
ja: ), backgroundColor: Colors.red, ), ); } return; } // 広告視聴成功 → 下記のAI生成処理に進む } else { // ユーザーがキャンセル return; } } else { // 今月の広告視聴上限に達している if (mounted) { await _showUpgradeDialog(

# general_Google_Places検索_googleGymslength件
source: ✅ Google Places Search: ${googleGyms.length} results
es: ✅ Búsqueda de Google Places: ${googleGyms.length} resultados
ja: ✅ Google Places検索: ${googleGyms.length}件

# workout_説明オプション
source: Description (optional)
es: Descripción (opcional)
ja: 説明（オプション）

# general_Firestore_timeout_e_GPS検索は継続します
source: ⚠️ Firestore timeout: $e - GPS search continues
es: ⚠️ Tiempo de espera de Firestore: $e - La búsqueda de GPS continúa
ja: ⚠️ Firestore timeout: $e - GPS検索は継続します

# profile_自己紹介を入力してください
source: Please enter your profile information.
es: Por favor ingrese la información de su perfil.
ja: 自己紹介を入力してください

# general_クイックスタート_templateName
source: 🚀 Quickstart: $templateName
es: 🚀 Inicio rápido: $templateName
ja: 🚀 クイックスタート: $templateName

# error_マッチングパートナー取得エラー_e
source: Error getting matching partner: $e
es: Error al obtener pareja coincidente: $e
ja: マッチングパートナー取得エラー: $e

# error_時空間マッチングエラー_e
source: ❌ Space-time matching error: $e
es: ❌ Error de coincidencia espacio-temporal: $e
ja: ❌ 時空間マッチングエラー: $e

# general_タップして詳細統計を表示
source: Tap to see detailed statistics
es: Toque para ver estadísticas detalladas
ja: タップして詳細統計を表示

# profile_更新日の24時間前までに自動更新が行われます
source: • Automatic renewal will occur 24 hours before the renewal date.
es: • La renovación automática se producirá 24 horas antes de la fecha de renovación.
ja: • 更新日の24時間前までに自動更新が行われます

# general_ACWRの計算には28日間のトレーニングデータが必要です
source: ACWR calculation requires 28 days of training data.
es: El cálculo de ACWR requiere 28 días de datos de entrenamiento.
ja: ACWRの計算には28日間のトレーニングデータが必要です。

# workout_前回記録_lastData
source: Previous record: ${lastData[
es: Registro anterior: ${lastData[
ja: 前回記録: ${lastData[

# general_久留米市
source: Kurume City
es: Ciudad de Kurume
ja: 久留米市

# workout_style_TextStyle_fontSize_14_color_Colorsgreyshade7
source: , style: TextStyle( fontSize: 14, color: Colors.grey.shade700, ), ), ], ), ), ], ), ), ); } /// Volume analysis Widget _buildVolumeAnalysis(Map<String, dynamic> analysis) { final status = analysis[
es: , style: TextStyle( fontSize: 14, color: Colors.grey.shade700, ), ), ], ), ), ], ), ), ); } /// Análisis de volumen Widget _buildVolumeAnalysis(Map<String, dynamic> analysis) { final status = analysis[
ja: , style: TextStyle( fontSize: 14, color: Colors.grey.shade700, ), ), ], ), ), ], ), ), ); } /// ボリューム分析 Widget _buildVolumeAnalysis(Map<String, dynamic> analysis) { final status = analysis[

# gym_名古屋のトレーニーの聖地男女ベルを問わずトレーニング初心者の方から上級者トップアスリートステージ競技
source: A mecca for trainees in Nagoya. For men and women, beginners to advanced trainers, top athletes, stage athletes, and trainers who want to achieve a higher level of physique transformation.
es: Una meca para quienes entrenan en Nagoya. Para hombres y mujeres, desde principiantes hasta entrenadores avanzados, atletas de élite, atletas de alto rendimiento y entrenadores que desean alcanzar un mayor nivel de transformación física.
ja: 名古屋のトレーニーの聖地。男女・ベルを問わずトレーニング初心者の方から上級者、トップアスリート、ステージ競技選手、またより高いレベルの肉体改造を習得したいと思われているトレーナーの方まで。

# workout_セットsetIndex_1_weight_0
source: set ${setIndex + 1}: ${weight == 0 ?
es: establecer ${setIndex + 1}: ${peso == 0?
ja: セット${setIndex + 1}: ${weight == 0 ?

# personalFactor_日々変動する要素です
source: These factors change daily:
es: Estos factores cambian diariamente:
ja: 日々変動する要素です:

# general_総会員数_totalMembers
source: Total members: $_totalMembers
es: Total de miembros: $_totalMembers
ja: 総会員数: $_totalMembers

# general_頻度評価frequencyAnalysis
source: ]} - Frequency analysis: ${frequencyAnalysis[
es: ]} - Análisis de frecuencia: ${frequencyAnalysis[
ja: ]} ・頻度評価：${frequencyAnalysis[

# general_使用済み_currentUsage回
source: Used: $_currentUsage times
es: Usado: $_currentUsage veces
ja: 使用済み: $_currentUsage回

# general_今月のAI機能をさらに5回ご利用いただけます
source: You will receive 5 more uses of this month's AI feature.
es: Recibirás 5 usos más de la función de IA de este mes.
ja: 今月のAI機能をさらに5回ご利用いただけます。

# general_170月
source: \$170/month
es: $170/mes
ja: \$170/月

# workout_style_TextStylecolor_Colorsredshade700_final_resul
source: , style: TextStyle(color: Colors.red.shade700), ), ], ), ), ); } final result = _analysisResult!; / Check for required fields if (!result.containsKey(
es: , style: TextStyle(color: Colors.red.shade700), ), ], ), ), ); } resultado final = _analysisResult!; / Verificar campos obligatorios if (!result.containsKey(
ja: , style: TextStyle(color: Colors.red.shade700), ), ], ), ), ); } final result = _analysisResult!; // 必須フィールドチェック if (!result.containsKey(

# general_differenceinHours時間前
source: ${difference.inHours} hours ago
es: Hace ${difference.inHours} horas
ja: ${difference.inHours}時間前

# gym_パートナー店舗
source: Partner Stores
es: Tiendas asociadas
ja: パートナー店舗

# general_オフラインデータ同期完了
source: ✅ Offline data sync completed
es: ✅ Sincronización de datos sin conexión completada
ja: ✅ オフラインデータ同期完了

# general_メッセージを既読にしました
source: ✅ Message marked as read
es: ✅ Mensaje marcado como leído
ja: ✅ メッセージを既読にしました

# gym_東京都中央区銀座777
source: 7-7-7 Ginza, Chuo-ku, Tokyo
es: 7-7-7 Ginza, Chuo-ku, Tokio
ja: 東京都中央区銀座7-7-7

# profile_新着メッセージ
source: New Messages
es: Nuevos mensajes
ja: 新着メッセージ

# workout_Phase_7_自動取得データ表示UI_年齢体重の自動取得データ表示_Widget_buildAut
source: ; } } // ========================================= // 🆕 Phase 7: Automatically retrieved data display UI // ========================================= /// Display automatically retrieved data for age and weight Widget _buildAutoLoadedDataDisplay() { return Column( children: [ // Display age if (_userAge != null) _buildDataRow( icon: Icons.calendar_today, label: AppLocalizations.of(context)!.age, value:
es: ; } } // ========================================== // 🆕 Fase 7: Interfaz de usuario para visualizar los datos recuperados automáticamente // ============================================= /// Mostrar los datos recuperados automáticamente de edad y peso Widget _buildAutoLoadedDataDisplay() { return Column( children: [ // Mostrar edad if (_userAge != null) _buildDataRow( icon: Icons.calendar_today, label: AppLocalizations.of(context)!.age, value:
ja: ; } } // ======================================== // 🆕 Phase 7: 自動取得データ表示UI // ======================================== /// 年齢・体重の自動取得データ表示 Widget _buildAutoLoadedDataDisplay() { return Column( children: [ // 年齢表示 if (_userAge != null) _buildDataRow( icon: Icons.calendar_today, label: AppLocalizations.of(context)!.age, value:

# workout_value_selectedRPEtoDouble_min_6_max_10_divisions_4
source: , value: _selectedRPE.toDouble(), min: 6, max: 10, divisions: 4, onChanged: (value) { setState(() { _selectedRPE = value.toInt(); }); }, displayValue: _getRPELabel(_selectedRPE), ), const SizedBox(height: 4), Padding( padding: const EdgeInsets.only(left: 4), child: Text( _getRPEDescription(_selectedRPE), style: TextStyle( fontSize: 11, color: Colors.grey.shade600, fontStyle: FontStyle.italic, ), ), ), ], ), const SizedBox(height: 16), // gender Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ _buildDropdownField( label: AppLocalizations.of(context)!.gender, value: _selectedGender, items: [AppLocalizations.of(context)!.genderMale, AppLocalizations.of(context)!.genderFemale], onChanged: (value) { setState(() { _selectedGender = value!; }); }, ), const SizedBox(height: 4), Padding( padding: const EdgeInsets.only(left: 4), child: Text(
es: , valor: _selectedRPE.toDouble(), mín: 6, máx: 10, divisiones: 4, onChanged: (valor) { setState(() { _selectedRPE = valor.toInt(); }); }, displayValue: _getRPELabel(_selectedRPE), ), const SizedBox(height: 4), Padding( padding: const EdgeInsets.only(left: 4), child: Text( _getRPEDescription(_selectedRPE), style: TextStyle( fontSize: 11, color: Colors.grey.shade600, fontStyle: FontStyle.italic, ), ), ), ], ), const SizedBox(height: 16), // género Column( crossAxisAlignment: CrossAxisAlignment.start, child: [ _buildDropdownField( etiqueta: AppLocalizations.of(context)!.género, valor: _selectedGender, items: [AppLocalizations.of(context)!.géneroMasculino, AppLocalizations.of(contexto)!.genderFemale], onChanged: (valor) { setState(() { _selectedGender = valor!; }); }, ), const SizedBox(altura: 4), Padding( padding: const EdgeInsets.only(izquierda: 4), child: Text(
ja: , value: _selectedRPE.toDouble(), min: 6, max: 10, divisions: 4, onChanged: (value) { setState(() { _selectedRPE = value.toInt(); }); }, displayValue: _getRPELabel(_selectedRPE), ), const SizedBox(height: 4), Padding( padding: const EdgeInsets.only(left: 4), child: Text( _getRPEDescription(_selectedRPE), style: TextStyle( fontSize: 11, color: Colors.grey.shade600, fontStyle: FontStyle.italic, ), ), ), ], ), const SizedBox(height: 16), // 性別 Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ _buildDropdownField( label: AppLocalizations.of(context)!.gender, value: _selectedGender, items: [AppLocalizations.of(context)!.genderMale, AppLocalizations.of(context)!.genderFemale], onChanged: (value) { setState(() { _selectedGender = value!; }); }, ), const SizedBox(height: 4), Padding( padding: const EdgeInsets.only(left: 4), child: Text(

# general_条件達成後即座に特典が適用されます
source: Once the conditions are met, the rewards will be applied immediately.
es: Una vez cumplidas las condiciones las recompensas se aplicarán inmediatamente.
ja: 条件達成後、即座に特典が適用されます

# general_アップデート推奨_currentBuildNumber_recommendedBuildNumber
source: 💡 Recommended update: $currentBuildNumber < $recommendedBuildNumber
es: 💡 Actualización recomendada: $currentBuildNumber < $recommendedBuildNumber
ja: 💡 アップデート推奨: $currentBuildNumber < $recommendedBuildNumber

# profile_自己紹介150文字以内
source: Self-introduction (150 characters or less)
es: Autopresentación (150 caracteres o menos)
ja: 自己紹介（150文字以内）

# profile_バーベルロー
source: Barbell Row
es: Remo con barra
ja: バーベルロー

# workout_length行
source: ).length} line
es: ).length} línea
ja: ).length}行

# workout_dsセットsets
source: (\d+)\s*(?:sets?)
es: (\d+)\s*(?:conjuntos?)
ja: (\d+)\s*(?:セット|sets?)

# general_データ戦略フェーズ管理
source: Data Strategy Phase Management
es: Gestión de la fase de estrategia de datos
ja: データ戦略フェーズ管理

# workout_AIコーチデータの読み込みに失敗しました_e
source: Failed to load AI coach data: $e
es: No se pudieron cargar los datos del entrenador de IA: $e
ja: AIコーチデータの読み込みに失敗しました: $e

# personalFactor_変更頻度が低い要素です
source: Elements that change less frequently:
es: Elementos que cambian con menos frecuencia:
ja: 変更頻度が低い要素です:

# general_バージョン管理情報を更新しました_data
source: ✅ Updated version control information: $data
es: ✅ Información de control de versión actualizada: $data
ja: ✅ バージョン管理情報を更新しました: $data

# profile_Proプランの特典
source: ✨ Pro plan benefits
es: ✨ Beneficios del plan Pro
ja: ✨ Proプランの特典

# gym_平日_6002200_土日_7001900
source: Weekdays 6:00-22:00, Saturdays and Sundays 7:00-19:00
es: Días laborables de 6:00 a 22:00, sábados y domingos de 7:00 a 19:00
ja: 平日 6:00-22:00, 土日 7:00-19:00

# general_5回もトレーニングを記録していただきありがとうございます
source: Thank you for recording your training five times!
es: ¡Gracias por grabar tu entrenamiento cinco veces!
ja: 5回もトレーニングを記録していただき、ありがとうございます！

# workout_保存中
source: Saving...
es: Ahorro...
ja: 保存中...

# general_選択日_selectedDayyear_selectedDaymonth_selectedDayda
source: 📅 Selected Day: ${_selectedDay!.year}/${_selectedDay!.month}/${_selectedDay!.day}
es: 📅 Día seleccionado: ${_selectedDay!.year}/${_selectedDay!.month}/${_selectedDay!.day}
ja: 📅 選択日: ${_selectedDay!.year}/${_selectedDay!.month}/${_selectedDay!.day}

# general_対処方法
source: Solution:
es: Solución:
ja: 対処方法:

# general_閲覧統計
source: Viewing Statistics
es: Estadísticas de visualización
ja: 閲覧統計

# general_ℹ_検索結果が0件ですこの地域にジムが存在しない可能性
source: ℹ️ 0 results (maybe there are no gyms in this area)
es: ℹ️ 0 resultados (quizás no haya gimnasios en esta zona)
ja: ℹ️ 検索結果が0件です（この地域にジムが存在しない可能性）

# general_アクティブな目標がありません
source: No active goals
es: No hay objetivos activos
ja: アクティブな目標がありません

# subscription_AI機能無制限AIコーチ成長予測効果分析
source: 🤖 Unlimited AI features (AI coaching, growth predictions, and effectiveness analysis)
es: 🤖 Funciones de IA ilimitadas (entrenamiento de IA, predicciones de crecimiento y análisis de efectividad)
ja: 🤖 AI機能無制限（AIコーチ・成長予測・効果分析）

# general_トレーニングボリューム
source: Training Volume
es: Volumen de entrenamiento
ja: トレーニングボリューム

# workout_style_TextStylefontSize_12_color_Colorsgreyshade60
source: , style: TextStyle(fontSize: 12, color: Colors.grey.shade600), ), value: _enablePlateauDetection, onChanged: (value) { setState(() { _enablePlateauDetection = value; }); }, activeColor: Colors.orange.shade700, contentPadding: EdgeInsets.zero, ), const SizedBox(height: 16), // Number of sets per week Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ _buildSliderField( label:
es: , style: TextStyle(fontSize: 12, color: Colors.grey.shade600), ), value: _enablePlateauDetection, onChanged: (value) { setState(() { _enablePlateauDetection = value; }); }, activeColor: Colors.orange.shade700, contentPadding: EdgeInsets.zero, ), const SizedBox(height: 16), // Número de conjuntos por semana Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ _buildSliderField( etiqueta:
ja: , style: TextStyle(fontSize: 12, color: Colors.grey.shade600), ), value: _enablePlateauDetection, onChanged: (value) { setState(() { _enablePlateauDetection = value; }); }, activeColor: Colors.orange.shade700, contentPadding: EdgeInsets.zero, ), const SizedBox(height: 16), // 週あたりセット数 Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ _buildSliderField( label:

# general_簡単トレーニング記録
source: Easy training record
es: Registro de entrenamiento fácil
ja: 簡単トレーニング記録

# general_基礎TL_baseTrainingLoadtoInt_AU_補正後_adjustedTraining
source: Basic TL: ${baseTrainingLoad.toInt()} AU → After correction: ${adjustedTrainingLoad.toInt()} AU
es: TL básico: ${baseTrainingLoad.toInt()} AU → Después de la corrección: ${adjustedTrainingLoad.toInt()} AU
ja: 基礎TL: ${baseTrainingLoad.toInt()} AU → 補正後: ${adjustedTrainingLoad.toInt()} AU

# general_バナー画像アップロード中
source: 📤 Banner image uploading...
es: 📤 Cargando imagen de banner...
ja: 📤 バナー画像アップロード中...

# general_同期待ちデータなし
source: 📭 No data waiting to be synced
es: 📭 No hay datos esperando a ser sincronizados
ja: 📭 同期待ちデータなし

# gym_月額_gymmonthlyFeetoStringAsFixed0
source: Monthly Fee ¥${gym.monthlyFee.toStringAsFixed(0)}
es: Tarifa mensual ¥${gym.monthlyFee.toStringAsFixed(0)}
ja: 月額 ¥${gym.monthlyFee.toStringAsFixed(0)}

# gym_エステ
source: Beauty Salon
es: Salón de belleza
ja: エステ

# general_永年Proプラン保持者_広告非表示
source: ✅ Lifetime Pro Plan holder - No Ads
es: ✅ Titular del Plan Pro de por vida - Sin anuncios
ja: ✅ 永年Proプラン保持者 - 広告非表示

# general_検索結果_filteredWorkoutslength件
source: Search results: ${_filteredWorkouts.length}
es: Resultados de la búsqueda: ${_filteredWorkouts.length}
ja: 検索結果: ${_filteredWorkouts.length}件

# general_バー重量_barWeight_kg_を含む総重量を入力
source: Enter the total weight including the bar weight ($_barWeight kg)
es: Ingrese el peso total incluido el peso de la barra ($_barWeight kg)
ja: バー重量 ($_barWeight kg) を含む総重量を入力

# general_50日連続達成
source: Achieved 50 consecutive days!
es: ¡Conseguiste 50 días consecutivos!
ja: 50日連続達成！

# workout_既存記録に追記モード_existingWorkoutId
source: ✅ Append to existing record mode: $_existingWorkoutId
es: ✅ Agregar al modo de registro existente: $_existingWorkoutId
ja: ✅ 既存記録に追記モード: $_existingWorkoutId

# general_メニューからホーム画面に追加をタップ
source: Tap "Add to Home Screen" from the menu
es: Toque "Agregar a la pantalla de inicio" en el menú
ja: メニューから「ホーム画面に追加」をタップ

# general_モチベーション系
source: Motivation
es: Motivación
ja: モチベーション系

# general_Phase_1機能をすべてリセットしました_アプリを再起動してください
source: ✅ All Phase 1 functions have been reset. Please restart the app.
es: ✅ Se han restablecido todas las funciones de la Fase 1. Reinicie la aplicación.
ja: ✅ Phase 1機能をすべてリセットしました アプリを再起動してください

# general_無料
source: free!
es: ¡gratis!
ja: 無料!

# error_購入処理に失敗しました
source: The purchase process failed.
es: El proceso de compra falló.
ja: 購入処理に失敗しました。

# subscription_エラー時キャッシュ使用_cachedPlan
source: 📦 Use cache on error: $cachedPlan
es: 📦 Usar caché en caso de error: $cachedPlan
ja: 📦 エラー時キャッシュ使用: $cachedPlan

# general_背中トレ初心者
source: Back training beginner
es: Entrenamiento de espalda para principiantes
ja: 背中トレ初心者

# gym_カーブス_吉祥寺店
source: Curves Kichijoji
es: Curvas Kichijoji
ja: カーブス 吉祥寺店

# gym_完全個室のパーソナルトレーニングジム結果にコミット
source: A completely private personal training gym. Committed to results.
es: Un gimnasio de entrenamiento personal completamente privado. Comprometidos con los resultados.
ja: 完全個室のパーソナルトレーニングジム。結果にコミット。

# workout_ワークアウトテンプレート
source: Workout Templates
es: Plantillas de entrenamiento
ja: ワークアウトテンプレート

# workout_テンプレート名を入力してください
source: Enter the template name
es: Introduzca el nombre de la plantilla
ja: テンプレート名を入力してください

# general_メッセージを送る
source: Send a message
es: Enviar un mensaje
ja: メッセージを送る

# general_ディロード週を実施ボリューム3050削減強度維持
source: Deload week (reduce volume by 30-50%, maintain intensity)
es: Semana de descarga (reducir el volumen en un 30-50%, mantener la intensidad)
ja: ディロード週を実施（ボリューム30-50%削減、強度維持）
