Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# workout_3045分で完了_languageInstruction_重要_各種目に具体的な重量と回数を必ず記載
source: } - Complete in 30-45 minutes - $languageInstruction **Important: Be sure to enter the specific weight and repetitions for each exercise. For aerobic exercise, enter the weight (0kg) and the time (XX minutes). ** ${targetParts.contains(AppLocalizations.of(context)!.exerciseCardio) ?
es: } - Completar en 30-45 minutos - $languageInstruction **Importante: Asegúrate de introducir el peso y las repeticiones específicas para cada ejercicio. Para ejercicios aeróbicos, introduce el peso (0 kg) y el tiempo (XX minutos). ** ${targetParts.contains(AppLocalizations.of(context)!.exerciseCardio) ?
ja: } - 30-45分で完了 - $languageInstruction **重要: 各種目に具体的な重量と回数を必ず記載してください。有酸素運動の場合は重量0kg、時間をXX分形式で記載してください。** ${targetParts.contains(AppLocalizations.of(context)!.exerciseCardio) ?

# general_契約情報
source: Contract Information
es: Información del contrato
ja: 契約情報

# gym_AI機能を月10回使用
source: • Use AI features 10 times per month
es: • Utilice funciones de IA 10 veces al mes
ja: • AI機能を月10回使用

# general_30日連続トレーニング達成
source: Achieved 30 days of continuous training
es: Logró 30 días de capacitación continua
ja: 30日連続トレーニング達成

# personalFactor_25歳_095x_4050歳_105x_50歳_110x
source: <25 years: 0.95x, 40-50 years: 1.05x, 50+ years: 1.10x
es: <25 años: 0,95x, 40-50 años: 1,05x, 50+ años: 1,10x
ja: <25歳: 0.95x, 40-50歳: 1.05x, 50+歳: 1.10x

# workout_テンプレート作成_匿名認証エラー_e
source: ❌ Templating: Anonymous authentication error: $e
es: ❌ Plantillas: Error de autenticación anónima: $e
ja: ❌ テンプレート作成: 匿名認証エラー: $e

# general_3_AI使用回数は月次で自動リセットされます
source: 3. AI usage count is automatically reset every month.
es: 3. El recuento de uso de IA se restablece automáticamente cada mes.
ja: 3. AI使用回数は月次で自動リセットされます

# general_長崎
source: Nagasaki
ja: 長崎

# gym_総合評価
source: comprehensive evaluation
es: evaluación integral
ja: 総合評価

# general_このユーザーの記録が見つかりません
source: ⚠️ No record found for this user
es: ⚠️ No se encontró ningún registro para este usuario
ja: ⚠️ このユーザーの記録が見つかりません

# subscription_プレミアムプラン
source: Premium Plan
es: Plan Premium
ja: プレミアムプラン

# general_他_setslength_3セット
source: Other ${sets.length - 3} sets
es: Otros conjuntos ${sets.length - 3}
ja: 他 ${sets.length - 3}セット

# workout_種目d
source: ^\*\*Event\d+[:：](.+?)\*\*
es: ^\*\*Evento\d+[:：](.+?)\*\*
ja: ^\*\*種目\d+[:：](.+?)\*\*

# general_解除済み
source: Cancelled
es: Cancelado
ja: 解除済み

# workout_オンライン
source: 🌐 Online
es: 🌐 En línea
ja: 🌐 オンライン

# general_AI使用状況
source: AI Usage
es: Uso de IA
ja: AI使用状況

# general_SNSでシェア
source: 📱 Share on social media
es: 📱 Comparte en redes sociales
ja: 📱 SNSでシェア

# general_検証データが取得できません
source: ⚠️ Unable to obtain verification data
es: ⚠️ No se pueden obtener los datos de verificación
ja: ⚠️ 検証データが取得できません

# general_目標タイプ
source: Goal Type
es: Tipo de objetivo
ja: 目標タイプ

# general_記録を削除
source: Delete Record
es: Eliminar registro
ja: 記録を削除

# workout_体重記録が見つかりませんデータ件数_0
source: ⚠️ No weight records found (Number of data: 0)
es: ⚠️ No se encontraron registros de peso (Número de registros: 0)
ja: ⚠️ 体重記録が見つかりません（データ件数: 0）

# general_マジックナンバー達成をFirestoreに記録
source: ✅ Record the magic number achievement in Firestore
es: ✅ Registra el logro del número mágico en Firestore
ja: ✅ マジックナンバー達成をFirestoreに記録

# general_種目_exerciseName_isCardio_isCardio_後方互換性判定
source: Event: $exerciseName, isCardio: $isCardio (backward compatibility check)
es: Evento: $exerciseName, isCardio: $isCardio (comprobación de compatibilidad con versiones anteriores)
ja: 種目: $exerciseName, isCardio: $isCardio (後方互換性判定)

# general_リリースビルドApp_Store版では表示されません_TestFlightビルドのみで利用可能
source: Not displayed in release builds (App Store version) Only available in TestFlight builds
es: No se muestra en las versiones de lanzamiento (versión de la App Store). Solo disponible en las versiones de TestFlight.
ja: リリースビルド（App Store版）では表示されません TestFlightビルドのみで利用可能

# subscription_永年Proプラン保持者Entitlement経由
source: ✅ Lifetime Pro Plan holder (via Entitlement)
es: ✅ Titular del Plan Pro de por vida (a través de Entitlement)
ja: ✅ 永年Proプラン保持者（Entitlement経由）

# general_GPS位置情報取得タイムアウト15秒
source: ⏱️ GPS location timeout (15 seconds)
es: ⏱️ Tiempo de espera de ubicación GPS (15 segundos)
ja: ⏱️ GPS位置情報取得タイムアウト（15秒）

# general_期間限定キャンペーンを即座に更新
source: Limited-time offers updated instantly
es: Ofertas por tiempo limitado actualizadas instantáneamente
ja: 期間限定キャンペーンを即座に更新

# general_肩腕_Davies_2024_Damas_2016
source: Shoulders and arms - Davies 2024, Damas 2016
es: Hombros y brazos - Davies 2024, Damas 2016
ja: 肩・腕 - Davies 2024, Damas 2016

# workout_AI生成_現在のプラン_currentPlan
source: 🔍 [AI generated] Current plan: $currentPlan
es: 🔍 [Generado por IA] Plan actual: $currentPlan
ja: 🔍 [AI生成] 現在のプラン: $currentPlan

# workout_僧帽筋
source: trapezius muscle
es: músculo trapecio
ja: 僧帽筋

# general_次のアップデートで実装予定
source: Will be implemented in the next update
es: Se implementará en la próxima actualización.
ja: 次のアップデートで実装予定

# profile_この利用規約以下本規約は井上元以下開発者が提供するGYM_MATCHアプリ以下本アプリの利用条件を定
source: These Terms of Use (hereinafter referred to as "these Terms") set out the terms of use for the GYM MATCH app (hereinafter referred to as "this App") provided by Gen Inoue (hereinafter referred to as "the Developer"). By using this App, users are deemed to have agreed to these Terms.
es: Estas Condiciones de Uso (en adelante, «estas Condiciones») establecen las condiciones de uso de la aplicación GYM MATCH (en adelante, «esta Aplicación») proporcionada por Gen Inoue (en adelante, «el Desarrollador»). Al usar esta Aplicación, se considera que los usuarios aceptan estas Condiciones.
ja: この利用規約（以下「本規約」）は、井上元（以下「開発者」）が提供するGYM MATCHアプリ（以下「本アプリ」）の利用条件を定めるものです。ユーザーは、本アプリを利用することにより、本規約に同意したものとみなされます。

# general_フェーズ1_統計ベース_ユーザー報告コスト0月
source: Phase 1: Statistics-based + user-reported (cost $0/month)
es: Fase 1: Basado en estadísticas + informado por el usuario (costo $0/mes)
ja: フェーズ1: 統計ベース + ユーザー報告（コスト\$0/月）

# error_プロフィール詳細画面へのナビゲーションエラー_e
source: ❌ Error navigating to profile details: $e
es: ❌ Error al navegar a los detalles del perfil: $e
ja: ❌ プロフィール詳細画面へのナビゲーションエラー: $e

# workout_Colorsgreen_const_SizedBoxheight_16_AI分析_Card_chil
source: , Colors.green), ], ), ], ), ), ), const SizedBox(height: 16), // AI analysis Card( child: Padding( padding: const EdgeInsets.all(16.0), child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Row( children: [ Icon(Icons.psychology, color: Colors.purple.shade700), SizedBox(width: 8), Text(AppLocalizations.of(context)!.aiDetailedAnalysis, style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, ), ), ], ), const SizedBox(height: 12), _buildFormattedText(aiAnalysis), ], ), ), ), const SizedBox(height: 16), // Scientific Basis ScientificBasisSection( basis:scientificBasis.cast<Map<String, String>>(), ), const SizedBox(height: 8), // Confidence Indicator Center( child:ConfidenceIndicator(paperCount:scientificBasis.length), ), ], ); } /// Statistical Item Widget _buildStatItem(String label, String value, Color color) { return Column( children: [ Text( value, style: TextStyle( fontSize: 24, fontWeight: FontWeight.bold, color: color, ), ), const SizedBox(height: 4), Text( label, style: TextStyle( fontSize: 12, color: Colors.grey.shade600, ), ), ], ); } /// Show the rewarded ad dialog Future<bool?> _showRewardAdDialog() async { return showDialog<bool>( context: context, barrierDismissible: false, builder: (context) => AlertDialog( title: Row( children: [ Icon(Icons.play_circle_outline, color: Colors.blue, size: 28), SizedBox(width: 12), Text(
es: , Colors.green), ], ), ], ), ), ), const SizedBox(altura: 16), // Análisis de IA Card( child: Padding( padding: const EdgeInsets.all(16.0), child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Row( children: [ Icon(Icons.psychology, color: Colors.purple.shade700), SizedBox(ancho: 8), Text(AppLocalizations.of(context)!.aiDetailedAnalysis, style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, ), ), ], ), const SizedBox(altura: 12), _buildFormattedText(aiAnalysis), ], ), ), ), const SizedBox(height: 16), // Base científica ScientificBasisSection( basis:scientificBasis.cast<Map<String, String>>(), ), const SizedBox(height: 8), // Indicador de confianza Center( child:ConfidenceIndicator(paperCount:scientificBasis.length), ), ], ); } /// Elemento estadístico Widget _buildStatItem(String etiqueta, String valor, Color color) { return Column( children: [ Text( value, style: TextStyle( fontSize: 24, fontWeight: FontWeight.bold, color: color, ), ), const SizedBox(height: 4), Text( label, style: TextStyle( fontSize: 12, color: Colors.grey.shade600, ), ), ], ); } /// Mostrar el cuadro de diálogo del anuncio recompensado Future<bool?> _showRewardAdDialog() async { return showDialog<bool>( context: context, barrierDismissible: false, builder: (context) => AlertDialog( title: Row( children: [ Icon(Icons.play_circle_outline, color: Colors.blue, size: 28), SizedBox(width: 12), Text(
ja: , Colors.green), ], ), ], ), ), ), const SizedBox(height: 16), // AI分析 Card( child: Padding( padding: const EdgeInsets.all(16.0), child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Row( children: [ Icon(Icons.psychology, color: Colors.purple.shade700), SizedBox(width: 8), Text(AppLocalizations.of(context)!.aiDetailedAnalysis, style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, ), ), ], ), const SizedBox(height: 12), _buildFormattedText(aiAnalysis), ], ), ), ), const SizedBox(height: 16), // 科学的根拠 ScientificBasisSection( basis: scientificBasis.cast<Map<String, String>>(), ), const SizedBox(height: 8), // 信頼度インジケーター Center( child: ConfidenceIndicator(paperCount: scientificBasis.length), ), ], ); } /// 統計アイテム Widget _buildStatItem(String label, String value, Color color) { return Column( children: [ Text( value, style: TextStyle( fontSize: 24, fontWeight: FontWeight.bold, color: color, ), ), const SizedBox(height: 4), Text( label, style: TextStyle( fontSize: 12, color: Colors.grey.shade600, ), ), ], ); } /// リワード広告ダイアログ表示 Future<bool?> _showRewardAdDialog() async { return showDialog<bool>( context: context, barrierDismissible: false, builder: (context) => AlertDialog( title: Row( children: [ Icon(Icons.play_circle_outline, color: Colors.blue, size: 28), SizedBox(width: 12), Text(

# general_慢性負荷_28日
source: Chronic load (28 days)
es: Carga crónica (28 días)
ja: 慢性負荷 (28日)

# gym_ティップネス_六本木店
source: Tipness Roppongi store
es: Tienda Tipness Roppongi
ja: ティップネス 六本木店

# general_セッションRPE入力
source: 🔬 Session RPE Input
es: Entrada de RPE de sesión
ja: 🔬 セッションRPE入力

# general_ヒント_ブラウザで位置情報権限を許可してください
source: 💡 Tip: Allow location permissions in your browser
es: 💡 Consejo: Habilita los permisos de ubicación en tu navegador
ja: 💡 ヒント: ブラウザで位置情報権限を許可してください

# workout_yyyy年MM月dd日E
source: yyyy year MM month dd day (E)
es: aaaa año MM mes dd día (E)
ja: yyyy年MM月dd日(E)

# general_entryvalue回
source: ${entry.value} times
es: ${entry.value} veces
ja: ${entry.value}回

# workout_AIコーチデータから初期化開始
source: 🤖 Initialization starts from AI coach data
es: 🤖 La inicialización comienza a partir de los datos del entrenador de IA
ja: 🤖 AIコーチデータから初期化開始

# general_実力フィルター有効_検索者の平均1RM_userAverage1RMtoStringAsFixed1
source: 💪 Ability filter enabled - Searcher's average 1RM: ${userAverage1RM?.toStringAsFixed(1) ??
es: 💪 Filtro de habilidad habilitado - 1RM promedio del buscador: ${userAverage1RM?.toStringAsFixed(1) ??
ja: 💪 実力フィルター有効 - 検索者の平均1RM: ${userAverage1RM?.toStringAsFixed(1) ??

# general_脚背中胸_Davies_2024_Damas_2016
source: Legs, back, chest - Davies 2024, Damas 2016
es: Piernas, espalda, pecho - Davies 2024, Damas 2016
ja: 脚・背中・胸 - Davies 2024, Damas 2016

# workout_ユーザー未ログイン_前回データなし
source: ⚠️ User not logged in - no previous data
es: ⚠️ Usuario no conectado - sin datos previos
ja: ⚠️ ユーザー未ログイン - 前回データなし

# workout_種目データの変換エラー_e
source: ❌ Event data conversion error: $e
es: ❌ Error de conversión de datos de eventos: $e
ja: ❌ 種目データの変換エラー: $e

# gym_7002300完全予約制
source: 7:00-23:00 (reservations required)
es: 7:00-23:00 (se requieren reservas)
ja: 7:00-23:00（完全予約制）

# general_バー重量_barWeightkg_より大きい重量を入力してください
source: Please enter a weight greater than the bar weight (${_barWeight}kg)
es: Ingrese un peso mayor que el peso de la barra (${_barWeight}kg)
ja: バー重量 (${_barWeight}kg) より大きい重量を入力してください

# subscription_基本情報閲覧
source: View basic information
es: Ver información básica
ja: 基本情報閲覧

# workout_生成されたメニュー最初の500文字_textsubstring0_textlength_500_50
source: 📄 Generated menu (first 500 characters): ${text.substring(0, text.length > 500 ? 500 : text.length)}
es: Menú generado (primeros 500 caracteres): ${text.substring(0, text.length > 500 ? 500 : text.length)}
ja: 📄 生成されたメニュー（最初の500文字）: ${text.substring(0, text.length > 500 ? 500 : text.length)}

# general_全セット削除_ドキュメント削除完了
source: ✅ Delete all sets - Documents deleted
es: ✅ Eliminar todos los conjuntos - Documentos eliminados
ja: ✅ 全セット削除 - ドキュメント削除完了

# workout_種目リスト
source: Event List
es: Lista de eventos
ja: 種目リスト

# gym_東京都品川区上大崎111111
source: 11-11-11 Kamiosaki, Shinagawa-ku, Tokyo
es: 11-11-11 Kamiosaki, Shinagawa-ku, Tokio
ja: 東京都品川区上大崎11-11-11

# profile_マッチングリクエストを送信しました
source: Match request sent
es: Solicitud de coincidencia enviada
ja: マッチングリクエストを送信しました

# general_名前未設定
source: Unnamed
es: Sin nombre
ja: 名前未設定

# workout_トレーナー_recordtrainerName
source: Trainer: ${record.trainerName}
es: Entrenador: ${record.trainerName}
ja: トレーナー: ${record.trainerName}

# general_GPS位置情報取得中
source: 🔄 Obtaining GPS location information...
es: 🔄Obteniendo información de ubicación GPS...
ja: 🔄 GPS位置情報取得中...

# general_あなたに最適なトレーニングを
source: The best training for you
es: La mejor formación para ti
ja: あなたに最適なトレーニングを

# workout_前回_dateStr_weightkg_reps回
source: Last time $dateStr: ${weight}kg × ${reps}
es: Última vez $dateStr: ${weight}kg × ${reps}
ja: 前回 $dateStr: ${weight}kg × ${reps}回

# general_06ヶ月
source: 0-6 months
es: 0-6 meses
ja: 0-6ヶ月

# profile_基本機能広告表示ありAI機能は広告視聴で月3回まで
source: Basic functions (advertisements displayed, AI function requires viewing of ads up to 3 times per month)
es: Funciones básicas (anuncios mostrados, la función de IA requiere ver anuncios hasta 3 veces al mes)
ja: 基本機能（広告表示あり、AI機能は広告視聴で月3回まで）

# workout_メニュー生成に失敗しました_e
source: Menu generation failed: $e
es: Error en la generación del menú: $e
ja: メニュー生成に失敗しました: $e

# personalFactor_トレーニング経験_適応能力の違い
source: • Training experience: differences in adaptability
es: • Experiencia formativa: diferencias en adaptabilidad
ja: • トレーニング経験: 適応能力の違い

# general_条件_getCategoryLabelbadgecategory_badgethreshold_ge
source: Condition: ${_getCategoryLabel(badge.category)} ${badge.threshold}${_getCategoryUnit(badge.category)}
es: Condición: ${_getCategoryLabel(badge.category)} ${badge.threshold}${_getCategoryUnit(badge.category)}
ja: 条件: ${_getCategoryLabel(badge.category)} ${badge.threshold}${_getCategoryUnit(badge.category)}

# general_ヒント_端末の設定_アプリ_GYM_MATCH_位置情報を常に許可に変更してください
source: 💡 Tip: Go to your device's Settings → Apps → GYM MATCH → Change Location to "Always"
es: 💡 Consejo: Ve a Ajustes de tu dispositivo → Aplicaciones → GYM MATCH → Cambiar Ubicación a "Siempre"
ja: 💡 ヒント: 端末の設定 → アプリ → GYM MATCH → 位置情報を「常に許可」に変更してください

# general_削除開始_Workout_ID_workoutId
source: 🗑️ Start Deletion: Workout ID = $workoutId
es: 🗑️ Iniciar eliminación: ID de entrenamiento = $workoutId
ja: 🗑️ 削除開始: Workout ID = $workoutId

# general_春の入会キャンペーン開催中
source: 🎉 Spring Membership Campaign Now Underway!
es: ¡La campaña de membresía de primavera ya está en marcha!
ja: 🎉 春の入会キャンペーン開催中!

# workout_IMPORT_データ取り込み開始
source: 🔄 [IMPORT] Data import started...
es: 🔄 [IMPORTACIÓN] Importación de datos iniciada...
ja: 🔄 [IMPORT] データ取り込み開始...

# general_Firestore_キャッシュから取得オフライン_durationms
source: 📴 [Firestore] Get from cache (offline) - ${duration}ms
es: 📴 [Firestore] Obtener de la caché (sin conexión) - ${duration}ms
ja: 📴 [Firestore] キャッシュから取得（オフライン） - ${duration}ms

# general_富山
source: Toyama
ja: 富山

# profile_Freeプラン_基本機能広告表示ありAI機能は広告視聴で月3回まで
source: • Free Plan: Basic features, ads, AI features limited to 3 ads per month.
es: • Plan gratuito: Funciones básicas, anuncios y funciones de IA limitadas a 3 anuncios al mes.
ja: • Freeプラン: 基本機能、広告表示あり、AI機能は広告視聴で月3回まで

# subscription_お気に入り登録無制限
source: • Unlimited favorites
es: • Favoritos ilimitados
ja: • お気に入り登録無制限

# workout_トレーニング種目
source: Training Events
es: Eventos de capacitación
ja: トレーニング種目

# general_今月のAI使用状況
source: AI Usage This Month
es: Uso de IA este mes
ja: 今月のAI使用状況

# general_プレート構成_片側
source: Plate Configuration (One Side)
es: Configuración de la placa (un lado)
ja: プレート構成 (片側)

# general_適度な負荷のトレーニングでした_78時間の睡眠とタンパク質補給体重1kgあたり16g以上を心がけまし
source: This was a moderate-intensity training session. Make sure to get 7-8 hours of sleep and consume protein (at least 1.6g per kg of body weight).
es: Esta fue una sesión de entrenamiento de intensidad moderada. Asegúrate de dormir de 7 a 8 horas y consumir proteínas (al menos 1,6 g por kg de peso corporal).
ja: 適度な負荷のトレーニングでした。 7-8時間の睡眠とタンパク質補給（体重1kgあたり1.6g以上）を心がけましょう。

# workout_オフ日保存エラー_e
source: ❌ Off-day save error: $e
es: ❌ Error al guardar en día no laborable: $e
ja: ❌ オフ日保存エラー: $e

# error_紹介コードデータ読み込みエラー_e
source: Referral code data loading error: $e
es: Error al cargar datos del código de referencia: $e
ja: 紹介コードデータ読み込みエラー: $e

# subscription_1200お得
source: Save ¥1,200!
es: ¡Ahorre ¥1,200!
ja: ¥1,200お得！

# general_西新町
source: Nishishinmachi
ja: 西新町

# profile_以降毎月自動更新解約しない限り継続課金
source: • Automatically renews monthly thereafter (continuous billing unless canceled)
es: • Se renueva automáticamente cada mes a partir de entonces (facturación continua a menos que se cancele).
ja: • 以降、毎月自動更新（解約しない限り継続課金）

# profile_言語を変更しました
source: Changed language
es: Idioma cambiado
ja: 言語を変更しました

# gym_スタッフの対応
source: Staff response
es: Respuesta del personal
ja: スタッフの対応

# subscription_いつでもキャンセル可能期間満了まで利用可
source: • Cancel anytime (can be used until the end of the period)
es: • Cancelar en cualquier momento (se puede utilizar hasta el final del período)
ja: • いつでもキャンセル可能（期間満了まで利用可）

# general_競合優位性の確立
source: ✅ Establishing a competitive advantage
es: ✅ Establecer una ventaja competitiva
ja: ✅ 競合優位性の確立

# general_混雑レポーター10回達成
source: Congestion Reporter (achieved 10 times)
es: Reportero de congestión (logrado 10 veces)
ja: 混雑レポーター（10回達成）

# gym_パワーリフティング設備
source: Powerlifting Equipment
es: Equipo de levantamiento de pesas
ja: パワーリフティング設備

# workout_エラー時は_null_のまま未設定状態_効果分析を実行サブスクリプションチェック統合_Futurev
source: ); // If an error occurs, it will remain null (unset). } } /// Execute effectiveness analysis (subscription check integration) Future<void> _executeAnalysis() async { if (!_formKey.currentState!.validate()) return; // ======================================== // 🔐 Step 1: Check subscription status // ========================================== final subscriptionService = SubscriptionService(); final creditService = AICreditService(); final rewardAdService = globalRewardAdService; final currentPlan = await subscriptionService.getCurrentPlan(); debugPrint(
es: ); // Si se produce un error, permanecerá nulo (sin establecer). } } /// Ejecutar análisis de efectividad (integración de comprobación de suscripción) Future<void> _executeAnalysis() async { if (!_formKey.currentState!.validate()) return; // =========================================== // 🔐 Paso 1: Comprobar el estado de la suscripción // ============================================ final subscriptionService = SubscriptionService(); final creditService = AICreditService(); final rewardAdService = globalRewardAdService; final currentPlan = await subscriptionService.getCurrentPlan(); debugPrint(
ja: ); // エラー時は null のまま（未設定状態） } } /// 効果分析を実行(サブスクリプションチェック統合) Future<void> _executeAnalysis() async { if (!_formKey.currentState!.validate()) return; // ======================================== // 🔐 Step 1: サブスクリプション状態チェック // ======================================== final subscriptionService = SubscriptionService(); final creditService = AICreditService(); final rewardAdService = globalRewardAdService; final currentPlan = await subscriptionService.getCurrentPlan(); debugPrint(

# general_1週間の戦士
source: Warrior of the Week
es: Guerrero de la semana
ja: 1週間の戦士

# general_フリーウエイト
source: Free weights
es: Pesas libres
ja: フリーウエイト

# general_現在のボリュームは過剰です週volumeAnalysis
source: Current volume is excessive.
es: El volumen actual es excesivo.
ja: 現在のボリュームは過剰です。週${-volumeAnalysis[

# workout_片側のプレート
source: One side plate
es: Un plato lateral
ja: 片側のプレート

# workout_IMPORT_エラー発生_エラーメッセージ表示
source: ❌ [IMPORT] Error occurs - Error message displayed
es: ❌ [IMPORTAR] Se produjo un error: se muestra un mensaje de error
ja: ❌ [IMPORT] エラー発生 - エラーメッセージ表示

# workout_有効な1RMを入力してください
source: Please enter a valid 1RM
es: Por favor ingrese un 1RM válido
ja: 有効な1RMを入力してください

# general_GPS検索結果_googleGymslength件
source: ✅ GPS search results: ${googleGyms.length}
es: ✅ Resultados de búsqueda GPS: ${googleGyms.length}
ja: ✅ GPS検索結果: ${googleGyms.length}件

# workout_月3回まで動画視聴でAI利用可能
source: AI can be used by watching videos up to three times a month
es: La IA se puede utilizar viendo vídeos hasta tres veces al mes
ja: 月3回まで動画視聴でAI利用可能

# general_月間収益が3ヶ月連続で100万円以上達成時
source: When monthly revenue reaches 1 million yen or more for three consecutive months
es: Cuando los ingresos mensuales alcanzan 1 millón de yenes o más durante tres meses consecutivos
ja: 月間収益が3ヶ月連続で100万円以上達成時

# error_GPS検索エラー_e
source: ❌ GPS search error: $e
es: ❌ Error de búsqueda de GPS: $e
ja: ❌ GPS検索エラー: $e

# workout_選択された種目がありません
source: ⚠️ No events selected
es: ⚠️ No hay eventos seleccionados
ja: ⚠️ 選択された種目がありません

# error_初回ボーナス付与エラー_e
source: ❌ First bonus grant error: $e
es: ❌ Primer error de bonificación: $e
ja: ❌ 初回ボーナス付与エラー: $e

# profile_特定商取引に関する法律第11条に基づき以下の通り表示いたします
source: In accordance with Article 11 of the "Act on Specified Commercial Transactions," we hereby display the following information.
es: De conformidad con el artículo 11 de la “Ley de Transacciones Comerciales Específicas”, a continuación mostramos la siguiente información.
ja: 「特定商取引に関する法律」第11条に基づき、以下の通り表示いたします。

# general_900相当
source: Equivalent to ¥900!
es: ¡Equivalente a ¥900!
ja: ¥900相当！

# gym_シャワー室
source: shower room
es: cuarto de ducha
ja: シャワー室

# workout_有酸素時間_累計totalMinutes分
source: ✅ Cardio time: Total ${totalMinutes} minutes
es: ✅ Tiempo de cardio: Total ${totalMinutes} minutos
ja: ✅ 有酸素時間: 累計${totalMinutes}分

# profile_GYM_MATCHで一緒にトレーニングしませんか
source: Would you like to train with us at GYM MATCH?
es: ¿Te gustaría entrenar con nosotros en GYM MATCH?
ja: GYM MATCHで一緒にトレーニングしませんか？

# general_データ読み込み完了_画面表示_selectedDayWorkoutslength件
source: 🎉 Data loading complete: Screen display = ${_selectedDayWorkouts.length} items
es: 🎉 Carga de datos completada: Visualización en pantalla = ${_selectedDayWorkouts.length} elementos
ja: 🎉 データ読み込み完了: 画面表示=${_selectedDayWorkouts.length}件

# general_初回ボーナス付与成功_AI_firstTimeAiBonus回
source: ✅ First time bonus granted successfully: AI × $_firstTimeAiBonus times
es: ✅ Bono por primera vez otorgado exitosamente: AI × $_firstTimeAiBonus veces
ja: ✅ 初回ボーナス付与成功: AI×$_firstTimeAiBonus回

# general_gymslength件の実際のジムを取得しました
source: ✅ Got ${gyms.length} real gyms
es: ✅ Tengo ${gyms.length} gimnasios reales
ja: ✅ ${gyms.length}件の実際のジムを取得しました

# general_位置情報サービスが無効です
source: ❌ Location services disabled
es: ❌ Servicios de ubicación deshabilitados
ja: ❌ 位置情報サービスが無効です

# profile_プラン別機能
source: Plan-specific features:
es: Características específicas del plan:
ja: プラン別機能:

# general_canEarnCreditFromAd_現在のプラン_plan
source: 🔍 [canEarnCreditFromAd] Current plan: $plan
es: 🔍 [canEarnCreditFromAd] Plan actual: $plan
ja: 🔍 [canEarnCreditFromAd] 現在のプラン: $plan
