Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# bodyPart_初心者向けトレーニング種目一覧以下から選択し必ず説明を含めてください_胸大胸筋_1_チェストプレスマ
source: [Beginner Training Exercises List] Please select from the following and be sure to include a description. ■ Chest (Pectoral Muscles): 1. Chest Press Machine Description: This exercise has a fixed trajectory and is the safest. While seated, you press the bar in front of your chest. This is a basic exercise that trains the entire pectoral muscles. 2. Dumbbell Bench Press Description: Lie on your back on a bench and press dumbbells up over your chest. This exercise has a wider range of motion than a barbell and also helps develop your sense of balance. 3. Pec Fly Machine Description: While seated, you close your arms in front of your chest. This exercise helps you focus on stretching and contracting the pectoral muscles. ■ Back (Latissimus Dorsi and Trapezius): 1. Lat Pulldown Description: While seated, you pull the bar down from above. This is a basic back exercise that is ideal for beginners who can't do pull-ups. 2. Seated Row Description: While seated, you pull a cable or bar toward your chest. This effectively trains the latissimus dorsi and trapezius muscles. 3. Back Extension Description: Lie face down and raise your upper body. Strengthens the erector spinae muscles, improving posture. ■ Legs (Quadriceps and Hamstrings): 1. Leg Press Machine Description: Push off a plate with your feet while seated. Safer than squats, this exercise strengthens the quadriceps, hamstrings, and glutes. 2. Leg Extension Description: Extend your knees while seated. Focuses on strengthening the quadriceps (front of the thighs). 3. Leg Curl Description: Bend your knees while lying face down. Focuses on strengthening the hamstrings (back of the thighs). ■ Shoulders (Deltoids): 1. Shoulder Press Machine Description: Press the bar overhead while seated. Safely strengthens the entire deltoid muscle. 2. Side Raise (Dumbbell) Description: Hold a dumbbell in each hand and raise your arms to your sides. This exercise focuses on training the middle deltoids. ■Biceps (Upper Arm): 1. Dumbbell Curl Description: Hold a dumbbell and bend your elbows to raise it. This is a basic exercise for training the biceps (biceps). 2. Hammer Curl Description: Lift the dumbbell with your thumbs facing up. This exercise trains both the biceps and forearms at the same time. 3. Machine Arm Curl Description: This exercise has a fixed trajectory, making it safe for beginners. Bend your elbows while seated. ■Triceps (Upper Arm): 1. Tricep Pressdown Description: Press the bar down on a cable machine. This is a basic exercise for training the triceps (upper arms). 2. Tricep Kickback Description: Hold a dumbbell and push it back. It's easy to focus on contracting the triceps. 3. Machine Dips Description: Safely train your triceps with assistance. Moves your body up and down. ■Abs (rectus abdominis and obliques): 1. Abdominal Crunch Machine Description: Curls your upper body using the machine. Effectively trains the rectus abdominis. 2. Plank Description: Lie face down and support your body with your elbows and toes. A basic exercise that trains the entire core. ■Aerobic Exercise: 1. Running (Treadmill) Description: The classic aerobic exercise. Effective for improving cardiopulmonary function and burning fat. Recommended to start at 6-8 km/h. 2. Stationary Bike Description: Gentle on the knees, ideal for aerobic exercise beginners. Easy to manage heart rate. 3. Walking (Treadmill) Description: The least impactful aerobic exercise. A great first step for those new to exercise. 4. Cross Trainer Description: Full-body aerobic exercise. Light on joints and burns calories. 5. Stepper Description: Recreates the movement of climbing stairs. Strengthens the lower body and cardiovascular fitness simultaneously. 6. Swimming Description: Full-body exercise with minimal joint strain. Improves cardiovascular fitness and muscular endurance simultaneously. **Important**: Be sure to include the above description in your proposal.
es: [Lista de ejercicios para principiantes] Seleccione entre los siguientes y asegúrese de incluir una descripción. ■ Pecho (Músculos pectorales): 1. Press de pecho en máquina Descripción: Este ejercicio tiene una trayectoria fija y es el más seguro. Sentado, presione la barra frente al pecho. Este es un ejercicio básico que trabaja todos los músculos pectorales. 2. Press de banca con mancuernas Descripción: Acuéstese boca arriba en un banco y presione las mancuernas sobre el pecho. Este ejercicio tiene un rango de movimiento más amplio que con una barra y también ayuda a desarrollar el sentido del equilibrio. 3. Apertura de pectorales en máquina Descripción: Sentado, cierre los brazos frente al pecho. Este ejercicio le ayuda a concentrarse en estirar y contraer los músculos pectorales. ■ Espalda (Dorsal ancho y trapecio): 1. Jalón dorsal Descripción: Sentado, baje la barra desde arriba. Este es un ejercicio básico para la espalda, ideal para principiantes que no pueden hacer dominadas. 2. Remo sentado Descripción: Sentado, jala un cable o barra hacia el pecho. Esto entrena eficazmente los músculos dorsal ancho y trapecio. 3. Extensión de espalda Descripción: Acuéstate boca abajo y eleva el torso. Fortalece los músculos erectores de la columna, mejorando la postura. ■ Piernas (Cuádriceps e Isquiotibiales): 1. Prensa de piernas Descripción: Impúlsate con los pies desde un disco sentado. Más seguro que las sentadillas, este ejercicio fortalece los cuádriceps, los isquiotibiales y los glúteos. 2. Extensión de piernas Descripción: Extiende las rodillas sentado. Se enfoca en fortalecer los cuádriceps (parte frontal de los muslos). 3. Flexión de piernas Descripción: Flexiona las rodillas boca abajo. Se enfoca en fortalecer los isquiotibiales (parte posterior de los muslos). ■ Hombros (Deltoides): 1. Press de Hombros en Máquina Descripción: Levanta la barra por encima de la cabeza sentado. Fortalece todo el deltoides de forma segura. 2. Elevaciones Laterales (Mancuernas) Descripción: Sujeta una mancuerna en cada mano y eleva los brazos a los costados. Este ejercicio se centra en el deltoides medio. ■ Bíceps (Brazo): 1. Curl con Mancuernas Descripción: Sujeta una mancuerna y flexiona los codos para levantarla. Este es un ejercicio básico para entrenar el bíceps. 2. Curl Martillo Descripción: Levanta la mancuerna con los pulgares hacia arriba. Este ejercicio trabaja tanto el bíceps como los antebrazos simultáneamente. 3. Curl de Brazos en Máquina Descripción: Este ejercicio tiene una trayectoria fija, lo que lo hace seguro para principiantes. Flexiona los codos sentado. ■Tríceps (Brazo): 1. Press de Tríceps Descripción: Presione la barra hacia abajo en una máquina de polea. Este es un ejercicio básico para entrenar los tríceps (brazo). 2. Patada de Tríceps Descripción: Sujete una mancuerna y empújela hacia atrás. Es fácil concentrarse en contraer los tríceps. 3. Fondos en Máquina Descripción: Entrene sus tríceps de forma segura con ayuda. Mueva el cuerpo hacia arriba y hacia abajo. ■Abdominales (recto abdominal y oblicuos): 1. Abdominales en Máquina Descripción: Flexione la parte superior del cuerpo usando la máquina. Entrene eficazmente el recto abdominal. 2. Plancha Descripción: Acuéstese boca abajo y apóyese el cuerpo con los codos y las puntas de los pies. Un ejercicio básico que trabaja todo el core. ■Ejercicio Aeróbico: 1. Correr (Cinta) Descripción: El ejercicio aeróbico clásico. Eficaz para mejorar la función cardiopulmonar y quemar grasa. Se recomienda comenzar a 6-8 km/h. 2. Bicicleta estática Descripción: Suave para las rodillas, ideal para principiantes en ejercicios aeróbicos. Fácil control de la frecuencia cardíaca. 3. Caminar (cinta) Descripción: El ejercicio aeróbico de menor impacto. Un excelente comienzo para quienes se inician en el ejercicio. 4. Bicicleta elíptica Descripción: Ejercicio aeróbico de cuerpo completo. Suave para las articulaciones y quema calorías. 5. Stepper Descripción: Recrea el movimiento de subir escaleras. Fortalece la parte inferior del cuerpo y la capacidad cardiovascular simultáneamente. 6. Natación Descripción: Ejercicio de cuerpo completo con mínima tensión articular. Mejora la capacidad cardiovascular y la resistencia muscular simultáneamente. **Importante**: Asegúrese de incluir la descripción anterior en su propuesta.
ja: 【初心者向けトレーニング種目一覧】以下から選択し、必ず説明を含めてください。 ■胸（大胸筋）: 1. チェストプレスマシン 説明: 軌道が固定されており最も安全。座ったまま胸の前でバーを押し出す。大胸筋全体を鍛える基本種目。 2. ダンベルベンチプレス 説明: ベンチに仰向けになりダンベルを胸の上で押し上げる。バーベルより可動域が広く、バランス感覚も養える。 3. ペックフライマシン 説明: 座った状態で両腕を胸の前で閉じる動作。大胸筋のストレッチと収縮を意識しやすい。 ■背中（広背筋・僧帽筋）: 1. ラットプルダウン 説明: 座った状態でバーを上から引き下ろす。懸垂ができない初心者に最適な背中の基本種目。 2. シーテッドロー 説明: 座った状態でケーブルやバーを胸に向かって引く。広背筋と僧帽筋を効率的に鍛える。 3. バックエクステンション 説明: うつ伏せで上体を起こす。脊柱起立筋を鍛え、姿勢改善に効果的。 ■脚（大腿四頭筋・ハムストリングス）: 1. レッグプレスマシン 説明: 座った状態で足でプレートを押し出す。スクワットより安全で、大腿四頭筋・ハムストリングス・大臀筋を鍛える。 2. レッグエクステンション 説明: 座った状態で膝を伸ばす動作。大腿四頭筋（太もも前側）を集中的に鍛える。 3. レッグカール 説明: うつ伏せで膝を曲げる動作。ハムストリングス（太もも裏側）を集中的に鍛える。 ■肩（三角筋）: 1. ショルダープレスマシン 説明: 座った状態でバーを頭上に押し上げる。三角筋全体を安全に鍛えられる。 2. サイドレイズ（ダンベル） 説明: 両手にダンベルを持ち、腕を横に上げる。三角筋中部を重点的に鍛える。 ■二頭（上腕二頭筋）: 1. ダンベルカール 説明: ダンベルを持ち肘を曲げて持ち上げる。上腕二頭筋（力こぶ）を鍛える基本種目。 2. ハンマーカール 説明: 親指を上にしてダンベルを持ち上げる。二頭筋と前腕を同時に鍛えられる。 3. マシンアームカール 説明: 軌道が固定されており初心者に安全。座った状態で肘を曲げる。 ■三頭（上腕三頭筋）: 1. トライセプスプレスダウン 説明: ケーブルマシンでバーを下に押し下げる。上腕三頭筋（二の腕）を鍛える基本種目。 2. トライセプスキックバック 説明: ダンベルを持ち、後ろに押し出す動作。三頭筋の収縮を意識しやすい。 3. マシンディップス 説明: 補助付きで安全に三頭筋を鍛える。体を上下させる動作。 ■腹筋（腹直筋・腹斜筋）: 1. アブドミナルクランチマシン 説明: マシンで上体を丸める動作。腹直筋を効率的に鍛えられる。 2. プランク 説明: うつ伏せで肘と つま先で体を支える。体幹全体を鍛える基礎種目。 ■有酸素運動: 1. ランニング（トレッドミル） 説明: 有酸素運動の王道。心肺機能向上と脂肪燃焼に効果的。時速6-8km/hから開始推奨。 2. エアロバイク 説明: 膝への負担が少なく、有酸素運動初心者に最適。心拍数を管理しやすい。 3. ウォーキング（トレッドミル） 説明: 最も負担が少ない有酸素運動。運動習慣がない方の第一歩に最適。 4. クロストレーナー 説明: 全身を使う有酸素運動。関節への負担が少なく、消費カロリーが高い。 5. ステッパー 説明: 階段を登る動作を再現。下半身と心肺機能を同時に鍛えられる。 6. 水泳 説明: 全身運動で関節への負担が最小。心肺機能と筋持久力を同時に向上。 **重要**: 必ず上記の説明を含めて提案すること。

# subscription_解約理由記録_reasons
source: ✅ Cancellation reason record: $reasons
es: ✅ Registro de motivo de cancelación: $reasons
ja: ✅ 解約理由記録: $reasons

# error_削除エラー_e_1
source: Deletion error: $e
es: Error de eliminación: $e
ja: 削除エラー: $e

# general_選択日_selectedDate_selectedDateyearselectedDatemonth
source: 🕐 Selected date: $selectedDate (${selectedDate.year}/${selectedDate.month}/${selectedDate.day})
es: 🕐 Fecha seleccionada: $selectedDate (${selectedDate.year}/${selectedDate.month}/${selectedDate.day})
ja: 🕐 選択日: $selectedDate (${selectedDate.year}/${selectedDate.month}/${selectedDate.day})

# workout_画像サイズが大きすぎます_imageByteslength_1024_1024toStringAsF
source: Image size is too large (${(imageBytes.length / 1024 / 1024).toStringAsFixed(1)}MB).
es: El tamaño de la imagen es demasiado grande (${(imageBytes.length / 1024 / 1024).toStringAsFixed(1)}MB).
ja: 画像サイズが大きすぎます (${(imageBytes.length / 1024 / 1024).toStringAsFixed(1)}MB)。

# workout_履歴表示エラー_e
source: ❌ History display error: $e
es: ❌ Error en la visualización del historial: $e
ja: ❌ 履歴表示エラー: $e

# workout_アプリ再開_統計を更新
source: 📊 Restart the app: Refresh your statistics
es: 📊 Reinicia la aplicación: Actualiza tus estadísticas
ja: 📊 アプリ再開: 統計を更新

# workout_GYM_MATCHでトレーニング記録をシェア_GYMMATCH_筋トレ記録
source: Share your training records on GYM MATCH! #GYMMATCH #muscletrainingrecord
es: ¡Comparte tus récords de entrenamiento en GYM MATCH! #GYMMATCH #muscletrainingrecord
ja: GYM MATCHでトレーニング記録をシェア！ #GYMMATCH #筋トレ記録

# workout_休憩_90秒_1
source: - Rest: 90 seconds
es: - Descanso: 90 segundos
ja: - 休憩: 90秒

# general_ボリューム増加Grgic_2018
source: Volume increase (Grgic 2018)
es: Aumento de volumen (Grgic 2018)
ja: ボリューム増加（Grgic 2018）

# general_アプリ名を入力してください
source: Enter the app name
es: Introduzca el nombre de la aplicación
ja: アプリ名を入力してください

# general_Firestore削除完了_workoutId
source: ✅ Firestore deletion completed: $workoutId
es: ✅ Eliminación de Firestore completada: $workoutId
ja: ✅ Firestore削除完了: $workoutId

# workout_下半身を徹底的に鍛えるテンプレート
source: A template for a thorough lower body workout
es: Una plantilla para un entrenamiento completo de la parte inferior del cuerpo
ja: 下半身を徹底的に鍛えるテンプレート

# general_メールアドレスが既に使用中通常ログインに切り替え
source: ⚠️ Email address already in use, switch to regular login
es: ⚠️ Dirección de correo electrónico ya en uso, cambiar al inicio de sesión normal
ja: ⚠️ メールアドレスが既に使用中、通常ログインに切り替え

# general_最初の1記録を追加しましょう
source: Add your first record!
es: ¡Añade tu primer disco!
ja: 最初の1記録を追加しましょう！

# general_習慣化達成あなたは継続できる人です
source: 🎉 Habit achieved! You are someone who can stick to it!
es: ¡Hábito cumplido! ¡Eres capaz de perseverar!
ja: 🎉 習慣化達成！あなたは継続できる人です！

# workout_リワード広告ダイアログを表示
source: Show rewarded ad dialog
es: Mostrar el cuadro de diálogo de anuncios recompensados
ja: リワード広告ダイアログを表示

# workout_recordweighttoStringAsFixed1分_recordrepskm
source: ${record.weight.toStringAsFixed(1)} minutes × ${record.reps}km
es: ${record.weight.toStringAsFixed(1)} minutos × ${record.reps}km
ja: ${record.weight.toStringAsFixed(1)}分 × ${record.reps}km

# general_全ワークアウト詳細_allWorkoutslength件
source: 📊 All Workout Details: ${allWorkouts.length}
es: 📊 Todos los detalles del entrenamiento: ${allWorkouts.length}
ja: 📊 全ワークアウト詳細: ${allWorkouts.length}件

# workout_直近1ヶ月のトレーニング履歴
source: [Training history for the past month]
es: [Historial de entrenamiento del último mes]
ja: 【直近1ヶ月のトレーニング履歴】

# general_お気に入り追加_gymname
source: ✅ Add to Favorites: ${gym.name}
es: ✅ Agregar a favoritos: ${gym.name}
ja: ✅ お気に入り追加: ${gym.name}

# general_パワーマスター
source: Power Master
es: Maestro del poder
ja: パワーマスター

# general_日本語ロケール初期化成功
source: Japanese locale initialization successful
es: La inicialización de la configuración regional japonesa fue exitosa
ja: 日本語ロケール初期化成功

# workout_as_DateTime_週番号を付与直近が_week_1_final_result_MapStrin
source: ] as DateTime)); / Assign the week number (the most recent is week 1) final result = <Map<String, dynamic>>[]; for (int i = 0; i < exerciseRecords.length; i++) { result.add({
es: ] como fecha y hora)); / Asignar el número de semana (la más reciente es la semana 1) resultado final = <Map<String, dynamic>>[]; for (int i = 0; i < exerciseRecords.length; i++) { resultado.add({
ja: ] as DateTime)); // 週番号を付与（直近が week 1） final result = <Map<String, dynamic>>[]; for (int i = 0; i < exerciseRecords.length; i++) { result.add({

# workout_トレーニングメニューを提案してください_advancedExerciseDatabase_histo
source: )}" Please suggest a training menu. $_advancedExerciseDatabase $historyInfo [Target Audience] - 2+ years of strength training experience - Aiming for maximum muscle strength and hypertrophy - Accustomed to high-intensity training [Proposal Format] **Please output in this format:** ``` ## Body Part Training Menu **Exercise 1: Exercise Name** * Weight: XX kg * Reps: XX * Sets: X * Rest Time: XX seconds * Advanced Technique: Description **Exercise 2: Exercise Name** * Weight: XX kg * Reps: XX * Sets: X ``` Please include the following information for each exercise: - Exercise Name (select from the exercise database) - **Specific Weight (kg)** ← Suggestions are based on 85-95% of your historical 1RM. *For aerobic exercise, enter "Weight: 0 kg" and "Time: XX minutes" instead of "Reps." - **Number of repetitions (5-8)** ← For aerobic exercise, enter "HIIT format: XX minutes" or "Endurance run: XX minutes" - Number of sets (4-5 sets) ← For aerobic exercise, enter "1 set" - Rest time (120-180 seconds) - Advanced techniques (pyramid exercise, 5x5 exercise, etc.) [Conditions] - ${targetParts.isEmpty ?
es: )}" Sugiera un menú de entrenamiento. $_advancedExerciseDatabase $historyInfo [Público objetivo] - Más de 2 años de experiencia en entrenamiento de fuerza - Objetivo de máxima fuerza muscular e hipertrofia - Acostumbrado al entrenamiento de alta intensidad [Formato de la propuesta] **Por favor, escriba en este formato:** ``` ## Menú de entrenamiento por parte del cuerpo **Ejercicio 1: Nombre del ejercicio** * Peso: XX kg * Repeticiones: XX * Series: X * Tiempo de descanso: XX segundos * Técnica avanzada: Descripción **Ejercicio 2: Nombre del ejercicio** * Peso: XX kg * Repeticiones: XX * Series: X ``` Incluya la siguiente información para cada ejercicio: - Nombre del ejercicio (seleccione de la base de datos de ejercicios) - **Peso específico (kg)** ← Las sugerencias se basan en el 85-95 % de su 1RM histórico. *Para ejercicio aeróbico, introduzca "Peso: 0" kg" y "Tiempo: XX minutos" en lugar de "Repeticiones". - **Número de repeticiones (5-8)** ← Para ejercicio aeróbico, introduce "Formato HIIT: XX minutos" o "Carrera de resistencia: XX minutos". - Número de series (4-5 series) ← Para ejercicio aeróbico, introduce "1 serie". - Tiempo de descanso (120-180 segundos). - Técnicas avanzadas (ejercicio piramidal, ejercicio 5x5, etc.). [Condiciones] - ${targetParts.isEmpty ?
ja: )}」トレーニングメニューを提案してください。 $_advancedExerciseDatabase $historyInfo 【対象者】 - 筋トレ経験2年以上 - 最大限の筋力・筋肥大を目指す方 - 高強度トレーニングに慣れている方 【提案形式】 **必ずこの形式で出力してください：** ``` ## 部位トレーニングメニュー **種目1：種目名** * 重量：XXkg * 回数：XX回 * セット数：Xセット * 休憩時間：XX秒 * 高度なテクニック：説明文 **種目2：種目名** * 重量：XXkg * 回数：XX回 * セット数：Xセット ``` 各種目について以下の情報を含めてください： - 種目名（種目データベースから選択） - **具体的な重量（kg）** ← 履歴の1RMの85-95%を目安に提案 ※有酸素運動の場合は「重量：0kg」とし、回数の代わりに「時間：XX分」を記載 - **回数（5-8回）** ← 有酸素の場合は「HIIT形式：XX分」または「持久走：XX分」 - セット数（4-5セット）← 有酸素の場合は「1セット」 - 休憩時間（120-180秒） - 高度なテクニック（ピラミッド法、5x5法等） 【条件】 - ${targetParts.isEmpty ?

# workout_全削除防止
source: ⚠️ Prevent all deletion
es: ⚠️ Evitar cualquier eliminación
ja: ⚠️ 全削除防止

# workout_style_TextStyle_fontSize_13_color_Colorsgreyshade7
source: , style: TextStyle( fontSize: 13, color: Colors.grey.shade700, ), ), ], ), ), ], ), ), ); } /// Recommended action Widget _buildRecommendations(List recommendations) { return Card( child: Padding( padding: const EdgeInsets.all(16.0), child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Row( children: [ Icon(Icons.recommend, color: Colors.purple.shade700), const SizedBox(width: 8), const Text(
es: , estilo: TextStyle( fontSize: 13, color: Colors.grey.shade700, ), ), ], ), ), ], ), ), ); } /// Acción recomendada Widget _buildRecommendations(Listar recomendaciones) { return Card( hijo: Padding( padding: const EdgeInsets.all(16.0), hijo: Column( crossAxisAlignment: CrossAxisAlignment.start, hijos: [ Row( hijos: [ Icon(Icons.recommend, color: Colors.purple.shade700), const SizedBox(width: 8), const Text(
ja: , style: TextStyle( fontSize: 13, color: Colors.grey.shade700, ), ), ], ), ), ], ), ), ); } /// 推奨アクション Widget _buildRecommendations(List recommendations) { return Card( child: Padding( padding: const EdgeInsets.all(16.0), child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Row( children: [ Icon(Icons.recommend, color: Colors.purple.shade700), const SizedBox(width: 8), const Text(

# error_AdMob_リワード広告読み込み失敗
source: ❌ [AdMob] Rewarded ads failed to load
es: ❌ [AdMob] Los anuncios recompensados no se pudieron cargar
ja: ❌ [AdMob] リワード広告読み込み失敗

# general_佐賀
source: Saga
ja: 佐賀

# subscription_残りremaining回_currentUsagetotalLimit回使用_うち追加購入分_add
source: ${remaining} remaining (${currentUsage}/${totalLimit} uses) *Additional purchases: ${addonLimit}
es: ${remaining} usos restantes (${currentUsage}/${totalLimit} usos) *Compras adicionales: ${addonLimit}
ja: 残り${remaining}回 (${currentUsage}/${totalLimit}回使用) ※うち追加購入分: ${addonLimit}回

# general_アプリがアクティブになりました_データを再読み込み
source: 🔄 App is now active - Reload data
es: 🔄 La aplicación ya está activa - Recargar datos
ja: 🔄 アプリがアクティブになりました - データを再読み込み

# subscription_永年Proプラン
source: Lifetime Pro Plan (∞)
es: Plan Pro de por vida (∞)
ja: 永年Proプラン（∞）

# general_アクセスコードを入力してください
source: Enter your access code
es: Introduzca su código de acceso
ja: アクセスコードを入力してください

# profile_ビジター利用を受け付ける
source: Accepting visitors
es: Aceptar visitantes
ja: ビジター利用を受け付ける

# general_メッセージ機能は近日公開予定です
source: Message feature coming soon
es: Próximamente, función de mensajes
ja: メッセージ機能は近日公開予定です

# general_コスト効率的費用率017
source: ✅ Cost-effective (expense rate 0.17%)
es: ✅ Rentable (tasa de gasto 0,17%)
ja: ✅ コスト効率的（費用率0.17%）

# workout_今月の統計
source: This month's statistics
es: Estadísticas de este mes
ja: 今月の統計

# workout_回復時間とトレーニングメニューを自動で提案します
source: Automatically suggests recovery time and training menus.
es: Sugiere automáticamente tiempos de recuperación y menús de entrenamiento.
ja: 回復時間とトレーニングメニューを自動で提案します。

# personalFactor_基礎Training_Loadに掛け算されます
source: Multiplied by the base Training Load
es: Multiplicado por la carga de entrenamiento base
ja: 基礎Training Loadに掛け算されます

# general_公園
source: park
es: parque
ja: 公園

# general_素晴らしい
source: 🎉 Awesome!
es: 🎉¡Genial!
ja: 🎉 素晴らしい！

# gym_広告
source: advertisement
es: anuncio
ja: 広告

# error_更新に失敗しました_e
source: Update failed: $e
es: Actualización fallida: $e
ja: 更新に失敗しました: $e

# error_パートナー検索エラー_e
source: Partner search error: $e
es: Error de búsqueda de socio: $e
ja: パートナー検索エラー: $e

# general_ビルドモード_kReleaseMode
source: 📱 Build mode: ${kReleaseMode ?
es: 📱 Modo de compilación: ${kReleaseMode ?
ja: 📱 ビルドモード: ${kReleaseMode ?

# general_Pro_Plan_50_OFF_初月
source: Pro Plan 50% OFF (First Month)
es: Plan Pro 50% de descuento (primer mes)
ja: Pro Plan 50% OFF (初月)

# general_画像を削除
source: Delete Image
es: Eliminar imagen
ja: 画像を削除

# error_平均1RM計算エラー_e
source: ❌ Average 1RM calculation error: $e
es: ❌ Error promedio de cálculo de 1RM: $e
ja: ❌ 平均1RM計算エラー: $e

# workout_onTap_Navigatorpush_context_MaterialPageRoutebuild
source: , onTap: () => Navigator.push( context, MaterialPageRoute(builder: (context) => const PersonalFactorsScreen()), ).then((_) => _loadUserAge()), ), const SizedBox(height: 12), // Weight display if (_latestBodyWeight != null) _buildDataRow( icon: Icons.monitor_weight, label: AppLocalizations.of(context)!.bodyWeight, value:
es: , onTap: () => Navigator.push( contexto, MaterialPageRoute(builder: (contexto) => const PersonalFactorsScreen()), ).then((_) => _loadUserAge()), ), const SizedBox(altura: 12), // Visualización del peso if (_latestBodyWeight != null) _buildDataRow( icon: Icons.monitor_weight, etiqueta: AppLocalizations.of(contexto)!.bodyWeight, value:
ja: , onTap: () => Navigator.push( context, MaterialPageRoute(builder: (context) => const PersonalFactorsScreen()), ).then((_) => _loadUserAge()), ), const SizedBox(height: 12), // 体重表示 if (_latestBodyWeight != null) _buildDataRow( icon: Icons.monitor_weight, label: AppLocalizations.of(context)!.bodyWeight, value:

# general_種目削除開始_Workout_ID_workoutId_Exercise_exerciseName
source: 🗑️ Start deleting an exercise: Workout ID = $workoutId, Exercise = $exerciseName
es: 🗑️ Comenzar a eliminar un ejercicio: ID de entrenamiento = $workoutId, Ejercicio = $exerciseName
ja: 🗑️ 種目削除開始: Workout ID = $workoutId, Exercise = $exerciseName

# subscription_プレミアム7日間無料
source: Premium 7 Days Free
es: Premium 7 días gratis
ja: プレミアム7日間無料

# profile_画像選択エラー_e
source: ❌ Image selection error: $e
es: ❌ Error de selección de imagen: $e
ja: ❌ 画像選択エラー: $e

# general_参考値
source: Reference value
es: Valor de referencia
ja: 参考値

# workout_セット数sdsセットsets
source: Number of sets [::]?\s*(\d+)\s*(?:set|sets?)?
es: Número de conjuntos [::]?\s*(\d+)\s*(?:set|conjuntos?)?
ja: セット数[:：]?\s*(\d+)\s*(?:セット|sets?)?

# general_モバイル環境_ネイティブGPS使用
source: 📱 Mobile environment: Uses native GPS
es: 📱 Entorno móvil: Utiliza GPS nativo
ja: 📱 モバイル環境: ネイティブGPS使用

# workout_科学的な分析
source: Scientific Analysis
es: Análisis científico
ja: 科学的な分析

# general_トレーニングできるようサポートします
source: We'll help you train.
es: Te ayudaremos a entrenar.
ja: トレーニングできるようサポートします。

# workout_種目_exerciseName_部位_bodyPart_有酸素_isCardio
source: 🏋️ Exercise: $exerciseName (body part: $bodyPart, cardio: $isCardio)
es: 🏋️ Ejercicio: $exerciseName (Parte del cuerpo: $bodyPart, Cardio: $isCardio)
ja: 🏋️ 種目: $exerciseName (部位: $bodyPart, 有酸素: $isCardio)

# general_セット比較
source: Set Comparison:
es: Comparación de conjuntos:
ja: セット比較:
