Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# general_科学的根拠成長予測_筋力向上率_初心者_月1525_ACSM_2009_中級者_月510_ACSM
source: [Scientific Basis (Growth Prediction)] ## Strength Improvement Rate - Beginner: +15-25% per month (ACSM 2009) - Intermediate: +5-10% per month (ACSM 2009) - Advanced: +1-3% per month (ACSM 2009) ## Progression Rules - Achieve +1-2 reps above target repetitions → Increase load by +2-10% (ACSM 2009) ## Optimal Frequency - 2x per week: ES 0.82 (Grgic 2018) - 3x per week: ES 0.93 (Grgic 2018) - No difference in frequency with equivalent volume (p=0.421) ## Plateau - Definition: 3-4 week plateau - Countermeasure: Deload (volume -30-50% for 1 week) or introduce new stimulation ## Gender Adjustment - Female Upper Body: Higher improvement rate than men (ES=-0.60, Roberts 2020)
ja: 【科学的根拠（成長予測）】 ## 筋力向上率 - 初心者: 月+15-25% (ACSM 2009) - 中級者: 月+5-10% (ACSM 2009) - 上級者: 月+1-3% (ACSM 2009) ## 進捗ルール - 目標レップ+1-2回達成 → 負荷+2-10% (ACSM 2009) ## 最適頻度 - 週2回: ES 0.82 (Grgic 2018) - 週3回: ES 0.93 (Grgic 2018) - ボリューム等価なら頻度差なし (p=0.421) ## プラトー - 定義: 3-4週間停滞 - 対策: ディロード（ボリューム-30-50%、1週間）or 新刺激導入 ## 性別補正 - 女性の上半身: 男性より高い向上率 (ES=-0.60, Roberts 2020)

# general_時空間マッチング_matchingUserIdslength人_ジム_targetGymId_時間
source: ✅ Spatiotemporal matching: ${matchingUserIds.length} people (Gym: $targetGymId, Time: $targetHour±${hourWindow}h)
ja: ✅ 時空間マッチング: ${matchingUserIds.length}人 (ジム: $targetGymId, 時間: $targetHour±${hourWindow}h)

# bodyPart_あなたはプロのパーソナルトレーナーです筋トレ初心者向けの全身トレーニングメニューを提案してください
source: You are a professional personal trainer. Please propose a full-body training menu for beginners. [Target Audience] - Beginners (those who have been going to the gym for about 1-3 months) - Those looking to build basic fitness - Those looking to learn training form [Proposal Format] Please include the following information for each exercise: - Exercise name - Number of sets (low: 2-3 sets) - Reps (light weight: 10-15 reps) - Rest time (longer: 90-120 seconds) - Form tips for beginners - Common mistakes and cautions [Requirements] - Balanced full-body training (chest, back, legs, shoulders, arms, abs) - Focus on basic exercises (combination of machines and free weights) - 30-45 minutes to complete - Exercises with low risk of injury - Emphasis on form mastery - Detailed explanations in Japanese Please propose a full-body training menu that is safe for beginners.
ja: あなたはプロのパーソナルトレーナーです。筋トレ初心者向けの全身トレーニングメニューを提案してください。 【対象者】 - 筋トレ初心者（ジム通い始めて1〜3ヶ月程度） - 基礎体力づくりを目指す方 - トレーニングフォームを学びたい方 【提案形式】 各種目について以下の情報を含めてください： - 種目名 - セット数（少なめ: 2-3セット） - 回数（軽い重量で: 10-15回） - 休憩時間（長め: 90-120秒） - 初心者向けフォームのポイント - よくある間違いと注意事項 【条件】 - 全身をバランスよく鍛える（胸・背中・脚・肩・腕・腹筋） - 基本種目中心（マシンとフリーウェイト組み合わせ） - 30-45分で完了 - 怪我のリスクが少ない種目 - フォーム習得を重視 - 日本語で丁寧に説明 初心者が安全に取り組める全身トレーニングメニューを提案してください。

# general_ScientificDatabasegetSystemPrompt_分析対象_部位bodyPart
source: ${ScientificDatabase.getSystemPrompt()} [Analysis Target] ・Body Part: $bodyPart ・Level: $level ・Gender: $gender ・Age: ${age} [Current Status] ・Training for $bodyPart: ${currentSetsPerWeek} sets per week ・Training Frequency for $bodyPart: ${currentFrequency} times per week ・Volume Assessment: ${volumeAnalysis[
ja: ${ScientificDatabase.getSystemPrompt()} 【分析対象】 ・部位：$bodyPart ・レベル：$level ・性別：$gender ・年齢：${age}歳 【現在の状況】 ・$bodyPart のトレーニング：週${currentSetsPerWeek}セット実施中 ・$bodyPart のトレーニング頻度：週${currentFrequency}回 ・ボリューム評価：${volumeAnalysis[

# appName
source: GYM MATCH
es: PARTIDO DE GIMNASIO

source: OK
es: DE ACUERDO
ko: 확인
zh: 确定
zh_tw: 確定

source: {weight}kg
es: {peso}kg

source: MONTHLY ARCHIVE
de: [DE] MONTHLY ARCHIVE
es: ARCHIVO MENSUAL
ko: [KO] MONTHLY ARCHIVE
zh: [ZH] MONTHLY ARCHIVE
zh_tw: [ZH_TW] MONTHLY ARCHIVE

source: BMI
es: IMC

# languageEnglish
source: English
de: English (Englisch)
es: Inglés
ko: English (영어)
zh: English (英语)
zh_tw: English (英語)

source: {height}cm
de: [DE] {height}cm
es: {altura}cm
zh: [ZH] {height}cm
zh_tw: [ZH_TW] {height}cm

source: kg
de: [DE] kg
es: kilogramo
ko: [KO] kg
zh: [ZH] kg
zh_tw: [ZH_TW] kg

source: lbs
de: [DE] lbs
es: libras
ko: [KO] lbs
zh: [ZH] lbs
zh_tw: [ZH_TW] lbs

source: cm
de: [DE] cm
es: centímetro
ko: [KO] cm
zh: [ZH] cm
zh_tw: [ZH_TW] cm

# meter
source: m
de: [DE] m
es: metro
ko: [KO] m
zh: [ZH] m
zh_tw: [ZH_TW] m

# kilometer
source: km
de: [DE] km
es: kilómetros
ko: [KO] km
zh: [ZH] km
zh_tw: [ZH_TW] km

source: CVV
de: [DE] CVV
ko: [KO] CVV
zh: [ZH] CVV
zh_tw: [ZH_TW] CVV

# navAI
source: AI
de: KI
