Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# exerciseBentOverRow
source: Bent-Over Row
de: Vorgebeugtes Rudern
es: Remo inclinado
ja: ベントオーバーロウ
ko: 벤트오버 로우
zh: 俯身划船
zh_tw: 俯身划船

# exerciseDumbbellPress
source: Dumbbell press
de: Kurzhanteldrücken
es: Press con mancuernas
ja: ダンベルプレス
ko: 덤벨 프레스
zh: 哑铃推举
zh_tw: 啞鈴推舉

# exerciseInclinePress
source: Incline Press
de: Schrägbankdrücken
es: Press inclinado
ja: インクラインプレス
ko: 인클라인 프레스
zh: 上斜推举
zh_tw: 上斜推舉

# exerciseCableFly
source: Cable fly
de: Kabel-Flys
es: Mosca de cable
ja: ケーブルフライ
ko: 케이블 플라이
zh: 绳索夹胸
zh_tw: 繩索夾胸

# exerciseSeatedRow
source: Seated Row
de: Rudern sitzend
es: Remo sentado
ja: シーテッドロウ
ko: 시티드 로우
zh: 坐姿划船
zh_tw: 坐姿划船

# exerciseTricepsExtension
source: Tricep Extension
de: Trizepsstrecker
es: Extensión de tríceps
ja: トライセプスエクステンション
ko: 트라이셉스 익스텐션
zh: 三头臂屈伸
zh_tw: 三頭臂屈伸

# exerciseRearDeltFly
source: Rear Delt Fly
de: Reverse Flys
es: Vuelo del deltoides posterior
ja: リアデルトフライ
ko: 리어 델트 플라이
zh: 后束飞鸟
zh_tw: 後束飛鳥

# exerciseChinUp
source: Chin-ups
de: Klimmzug
es: dominadas
ja: チンニング
ko: 친업
zh: 引体向上
zh_tw: 引體向上

# exerciseLegRaise
source: Leg raises
de: Beinheben
es: Elevaciones de piernas
ja: レッグレイズ
ko: 레그 레이즈
zh: 举腿
zh_tw: 舉腿

# exercisePlank
source: Plank
de: Unterarmstütz
es: Tablón
ja: プランク
ko: 플랭크
zh: 平板支撑
zh_tw: 平板支撐

# exerciseRunning
source: running
de: Laufen
es: correr
ja: ランニング
ko: 러닝
zh: 跑步
zh_tw: 跑步

# exerciseCrunch
source: Crunch
de: Crunches
es: Crujido
ja: クランチ
ko: 크런치
zh: 卷腹
zh_tw: 捲腹

# exerciseAbRoller
source: Ab roller
es: Rodillo para abdominales
ja: アブローラー
ko: 앱 롤러
zh: 健腹轮
zh_tw: 健腹輪

# exerciseHangingLegRaise
source: Hanging Leg Raises
de: Hängendes Beinheben
es: Elevaciones de piernas colgado
ja: ハンギングレッグレイズ
ko: 행잉 레그 레이즈
zh: 悬垂举腿
zh_tw: 懸垂舉腿

# exerciseSidePlank
source: Side Plank
de: Seitlicher Unterarmstütz
es: Plancha lateral
ja: サイドプランク
ko: 사이드 플랭크
zh: 侧平板
zh_tw: 側平板

# exerciseBicycleCrunch
source: Bicycle Crunch
de: Fahrrad-Crunches
es: Crujido de bicicleta
ja: バイシクルクランチ
ko: 바이시클 크런치
zh: 自行车卷腹
zh_tw: 自行車捲腹

# exerciseCableCrunch
source: Cable Crunch
de: Kabel-Crunches
es: Crujido de cable
ja: ケーブルクランチ
ko: 케이블 크런치
zh: 绳索卷腹
zh_tw: 繩索捲腹

# exerciseCalfRaise
source: Calf raises
de: Wadenheben
es: Elevaciones de pantorrillas
ja: カーフレイズ
ko: 카프 레이즈
zh: 提踵
zh_tw: 提踵

# exerciseUprightRow
source: Upright Row
de: Aufrechtes Rudern
es: Remo vertical
ja: アップライトロウ
ko: 업라이트 로우
zh: 直立划船
zh_tw: 直立划船

# exercisePreacherCurl
source: Preacher Curl
de: Scott-Curl
es: Predicador Curl
ja: プリチャーカール
ko: 프리처 컬
zh: 托臂弯举
zh_tw: 托臂彎舉

# exerciseCableCurl
source: Cable curl
de: Kabel-Curl
es: Curl de cable
ja: ケーブルカール
ko: 케이블 컬
zh: 绳索弯举
zh_tw: 繩索彎舉

# exerciseSkullCrusher
source: Skull Crusher
de: Stirndrücken
es: Triturador de cráneos
ja: スカルクラッシャー
ko: 스컬 크러셔
zh: 仰卧臂屈伸
zh_tw: 仰臥臂屈伸

# exerciseKickback
source: kickback
de: Kickbacks
es: contragolpe
ja: キックバック
ko: 킥백
zh: 后伸臂屈伸
zh_tw: 後伸臂屈伸

# exerciseAerobicBike
source: exercise bike
de: Heimtrainer
es: bicicleta estática
ja: エアロバイク
ko: 에어로 바이크
zh: 健身车
zh_tw: 健身車

# unknown
source: not clear
de: Unbekannt
es: no está claro
ja: 不明
ko: 알 수 없음
zh: 未知
zh_tw: 未知

source: seconds
de: Sek.
es: artículos de segunda clase
ja: 秒
ko: 초
zh: 秒
zh_tw: 秒數

source: limit
es: límite
ja: 限界
ko: 한계
zh: 极限
zh_tw: 極限

# normal
source: usually
de: Normal
es: generalmente
ja: 普通
ko: 보통
zh: 普通
zh_tw: 普通

source: active
de: Aktiv
es: activo
ja: アクティブ
ko: 활성
zh: 活跃
zh_tw: 活躍

source: Not set
de: Nicht festgelegt
es: No establecido
ja: 未設定
ko: 미설정
zh: 未设置
zh_tw: 未設置

# personalRecord
source: Personal Records
de: Persönlicher Rekord
es: Registros personales
ja: パーソナルレコード
ko: 개인 기록
zh: 个人记录
zh_tw: 個人記錄

# trainingLog
source: Training Record
de: Trainingsprotokoll
es: Registro de entrenamiento
ja: トレーニング記録
ko: 훈련 기록
zh: 训练记录
zh_tw: 訓練記錄

source: Body part tracking
de: Körperteil-Tracking
es: Seguimiento de partes del cuerpo
ja: 部位別トラッキング
ko: 부위별 추적
zh: 部位跟踪
zh_tw: 部位追蹤

source: Partner Search
de: Partnersuche
es: Búsqueda de socios
ja: パートナー検索
ko: 파트너 검색
zh: 合作伙伴搜索
zh_tw: 合作夥伴搜尋

# goalMuscleGain
source: muscle hypertrophy
de: Muskelaufbau
es: hipertrofia muscular
ja: 筋肥大
ko: 근육 증가
zh: 增肌
zh_tw: 增肌

# goalHealthMaintenance
source: maintain health
de: Gesundheitserhaltung
es: mantener la salud
ja: 健康維持
ko: 건강 유지
zh: 健康维持
zh_tw: 健康維持

# goalDiet
source: diet
de: Diät
es: dieta
ja: ダイエット
ko: 다이어트
zh: 减肥
zh_tw: 減肥

# bodyFatRate
source: body fat percentage
de: Körperfettanteil
es: porcentaje de grasa corporal
ja: 体脂肪率
ko: 체지방률
zh: 体脂率
zh_tw: 體脂率

source: Experience level
de: Erfahrungsstufe
es: Nivel de experiencia
ja: 経験レベル
ko: 경험 수준
zh: 经验等级
zh_tw: 經驗等級

# musclePecs
source: Pectoralis major
de: Brustmuskel
es: Pectoral mayor
ja: 大胸筋
ko: 대흉근
zh: 胸大肌
zh_tw: 胸大肌

# enterEmailAddress
source: Enter your email address
de: Bitte E-Mail-Adresse eingeben
es: Introduzca su dirección de correo electrónico
ja: メールアドレスを入力してください
ko: 이메일 주소를 입력하세요
zh: 请输入电子邮件地址
zh_tw: 請輸入電子郵件地址

# enterValidEmailAddress
source: Please enter a valid email address
de: Bitte gültige E-Mail-Adresse eingeben
es: Por favor, introduce una dirección de correo electrónico válida
ja: 正しいメールアドレスを入力してください
ko: 올바른 이메일 주소를 입력하세요
zh: 请输入有效的电子邮件地址
zh_tw: 請輸入有效的電子郵件地址

source: Login required
de: Anmeldung erforderlich
es: Se requiere iniciar sesión
ja: ログインが必要です
ko: 로그인이 필요합니다
zh: 需要登录
zh_tw: 需要登入

source: User not authenticated
de: Benutzer nicht authentifiziert
es: Usuario no autenticado
ja: ユーザーが認証されていません
ko: 사용자가 인증되지 않음
zh: 用户未认证
zh_tw: 用戶未認證

# deleteFailed
source: Delete failed: {e}
de: Löschen fehlgeschlagen: {e}
es: Error en la eliminación: {e}
ja: 削除に失敗しました: {e}
ko: 삭제 실패: $e
zh: 删除失败: {e}
zh_tw: 刪除失敗: $e

# dataLoadError
source: Data loading error: {e}
de: Datenladefehler: {e}
es: Error de carga de datos: {e}
ja: データ読み込みエラー: {e}
ko: 데이터 로드 오류: $e
zh: 数据加载错误: {e}
zh_tw: 數據載入錯誤: $e

# saveFailed
source: Save error: {e}
de: Speicherfehler: {e}
es: Error de guardado: {e}
ja: 保存エラー: {e}
ko: 저장 오류: $e
zh: 保存错误: {e}
zh_tw: 儲存錯誤: $e

# snapshotError
source: Error: {error}
de: Fehler: {error}
ja: エラー: {error}
ko: 오류: ${snapshot.error}
zh: 错误: {error}
zh_tw: 錯誤: ${snapshot.error}

# lastExerciseDeleted
source: The entire training record was deleted because the last event was deleted.
de: Gesamtes Trainingsprotokoll gelöscht, da letzte Übung entfernt wurde
es: Se eliminó todo el registro de entrenamiento porque se eliminó el último evento.
ja: 最後の種目が削除されたため、トレーニング記録全体を削除しました
ko: 마지막 운동이 삭제되어 전체 훈련 기록을 삭제했습니다
zh: 由于最后一个动作被删除，已删除整个训练记录
zh_tw: 由於最後一個動作被刪除，已刪除整個訓練記錄

# calculate
source: calculation
de: Berechnen
es: cálculo
ja: 計算
ko: 계산
zh: 计算
zh_tw: 計算

source: Report
de: Melden
es: Informe
ja: 通報する
ko: 신고
zh: 举报
zh_tw: 檢舉

source: valid
de: Gültig
es: válido
ja: 有効
ko: 유효
zh: 有效
zh_tw: 有效

source: invalid
de: Ungültig
es: inválido
ja: 無効
ko: 무효
zh: 无效
zh_tw: 無效

# unset
source: Not set
de: [DE] 未設定
es: No establecido
ja: 未設定
ko: [KO] 未設定
zh: [ZH] 未設定
zh_tw: [ZH_TW] 未設定

source: Delete All
de: Alle löschen
es: Eliminar todo
ja: すべて削除
ko: 모두 삭제
zh: 删除全部
zh_tw: 刪除全部

# frequency1to2
source: 1-2 times a week
de: [DE] 週1-2回
es: 1-2 veces por semana
ja: 週1-2回
ko: 주 1-2회
zh: [ZH] 週1-2回
zh_tw: [ZH_TW] 週1-2回

# frequency3to4
source: 3-4 times a week
de: [DE] 週3-4回
es: 3-4 veces por semana
ja: 週3-4回
ko: 주 3-4회
zh: [ZH] 週3-4回
zh_tw: [ZH_TW] 週3-4回

# frequency5plus
source: 5 or more times a week
de: [DE] 週5回以上
es: 5 o más veces a la semana
ja: 週5回以上
ko: 주 5회 이상
zh: [ZH] 週5回以上
zh_tw: [ZH_TW] 週5回以上

source: Training days
de: [DE] トレーニング日数
es: Días de entrenamiento
ja: トレーニング日数
ko: 훈련 일수
zh: [ZH] トレーニング日数
zh_tw: [ZH_TW] トレーニング日数

# bodyPartCore
source: core
de: Rumpf
es: centro
ja: 体幹
ko: 코어
zh: 核心
zh_tw: 核心

# levelExpert
source: Expert
de: Experte
es: Experto
ja: エキスパート
ko: 전문가
zh: 专家
zh_tw: 專家

# goalMaintenance
source: maintain health
de: Gesundheitserhaltung
es: mantener la salud
ja: 健康維持
ko: 건강 유지
zh: 健康维护
zh_tw: 健康維護

# goalWeightLoss
source: weight loss
de: Gewichtsabnahme
es: pérdida de peso
ja: 減量
ko: 감량
zh: 减重
zh_tw: 減重

# goalStrengthGain
source: Strengthening
de: [DE] 筋力増強
es: Fortalecimiento
ja: 筋力増強
ko: 근력 강화
zh: [ZH] 筋力増強
zh_tw: [ZH_TW] 筋力増強

# goalEndurance
source: Improved endurance
de: [DE] 持久力向上
es: Resistencia mejorada
ja: 持久力向上
ko: 지구력 향상
zh: [ZH] 持久力向上
zh_tw: [ZH_TW] 持久力向上

# goalFlexibility
source: Improved flexibility
de: [DE] 柔軟性向上
es: Mayor flexibilidad
ja: 柔軟性向上
ko: 유연성 향상
zh: [ZH] 柔軟性向上
zh_tw: [ZH_TW] 柔軟性向上

source: Target value
de: [DE] 目標値
es: Valor objetivo
ja: 目標値
ko: 목표값
zh: [ZH] 目標値
zh_tw: [ZH_TW] 目標値

# emailNotRegistered
source: This email address is not registered
de: このE-Mail-Adresseは登録されていません
es: Esta dirección de correo electrónico no está registrada
ja: このメールアドレスは登録されていません
ko: この이메일 주소は登録されていません
zh: この电子邮件は登録されていません
zh_tw: この電子郵件は登録されていません

# invalidEmailFormat
source: Email address format is incorrect
de: E-Mail-Adresseの形式が正しくありません
es: El formato de la dirección de correo electrónico es incorrecto
ja: メールアドレスの形式が正しくありません
ko: 이메일 주소の形式が正しくありません
zh: 电子邮件の形式が正しくありません
zh_tw: 電子郵件の形式が正しくありません

# passwordMin6
source: Please enter a password of at least 6 characters
de: Passwortは6文字以上で入力してください
es: Por favor, introduzca una contraseña de al menos 6 caracteres
ja: パスワードは6文字以上で入力してください
ko: 비밀번호は6文字以上で入力してください
zh: 密码は6文字以上で入力してください
zh_tw: 密碼は6文字以上で入力してください

source: Incorrect password
de: Passwortが正しくありません
es: Contraseña incorrecta
ja: パスワードが正しくありません
ko: 비밀번호が正しくありません
zh: 密码が正しくありません
zh_tw: 密碼が正しくありません

source: Access Code
de: [DE] アクセスコード
es: Código de acceso
ja: アクセスコード
ko: [KO] アクセスコード
zh: [ZH] アクセスコード
zh_tw: [ZH_TW] アクセスコード

# residence
source: place of residence
de: Wohnort
es: domicilio
ja: 居住地
ko: 거주지
zh: 居住地
zh_tw: 居住地

# prefectureAomori
source: Aomori Prefecture
de: [DE] 青森県
es: Prefectura de Aomori
ja: 青森県
ko: [KO] 青森県
zh: [ZH] 青森県
zh_tw: [ZH_TW] 青森県

# prefectureIwate
source: Iwate Prefecture
de: [DE] 岩手県
es: Prefectura de Iwate
ja: 岩手県
ko: [KO] 岩手県
zh: [ZH] 岩手県
zh_tw: [ZH_TW] 岩手県

# prefectureMiyagi
source: Miyagi Prefecture
de: [DE] 宮城県
es: Prefectura de Miyagi
ja: 宮城県
ko: [KO] 宮城県
zh: [ZH] 宮城県
zh_tw: [ZH_TW] 宮城県

# prefectureAkita
source: Akita Prefecture
de: [DE] 秋田県
es: Prefectura de Akita
ja: 秋田県
ko: [KO] 秋田県
zh: [ZH] 秋田県
zh_tw: [ZH_TW] 秋田県

# prefectureYamagata
source: Yamagata Prefecture
de: [DE] 山形県
es: Prefectura de Yamagata
ja: 山形県
ko: [KO] 山形県
zh: [ZH] 山形県
zh_tw: [ZH_TW] 山形県

# prefectureFukushima
source: Fukushima Prefecture
de: [DE] 福島県
es: Prefectura de Fukushima
ja: 福島県
ko: [KO] 福島県
zh: [ZH] 福島県
zh_tw: [ZH_TW] 福島県

# prefectureIbaraki
source: Ibaraki Prefecture
de: [DE] 茨城県
es: Prefectura de Ibaraki
ja: 茨城県
ko: [KO] 茨城県
zh: [ZH] 茨城県
zh_tw: [ZH_TW] 茨城県

# prefectureTochigi
source: Tochigi Prefecture
de: [DE] 栃木県
es: Prefectura de Tochigi
ja: 栃木県
ko: [KO] 栃木県
zh: [ZH] 栃木県
zh_tw: [ZH_TW] 栃木県

# prefectureGunma
source: Gunma Prefecture
de: [DE] 群馬県
es: Prefectura de Gunma
ja: 群馬県
ko: [KO] 群馬県
zh: [ZH] 群馬県
zh_tw: [ZH_TW] 群馬県

# prefectureSaitama
source: Saitama Prefecture
de: [DE] 埼玉県
es: Prefectura de Saitama
ja: 埼玉県
ko: [KO] 埼玉県
zh: [ZH] 埼玉県
zh_tw: [ZH_TW] 埼玉県

# prefectureChiba
source: Chiba Prefecture
de: [DE] 千葉県
es: Prefectura de Chiba
ja: 千葉県
ko: [KO] 千葉県
zh: [ZH] 千葉県
zh_tw: [ZH_TW] 千葉県

# prefectureTokyo
source: Tokyo
de: Tokio
es: Tokio
ja: 東京都
ko: 도쿄
zh: 东京
zh_tw: 東京

# prefectureKanagawa
source: Kanagawa Prefecture
de: [DE] 神奈川県
es: Prefectura de Kanagawa
ja: 神奈川県
ko: [KO] 神奈川県
zh: [ZH] 神奈川県
zh_tw: [ZH_TW] 神奈川県

# prefectureNiigata
source: Niigata Prefecture
de: [DE] 新潟県
es: Prefectura de Niigata
ja: 新潟県
ko: [KO] 新潟県
zh: [ZH] 新潟県
zh_tw: [ZH_TW] 新潟県

# prefectureToyama
source: Toyama Prefecture
de: [DE] 富山県
es: Prefectura de Toyama
ja: 富山県
ko: [KO] 富山県
zh: [ZH] 富山県
zh_tw: [ZH_TW] 富山県

# prefectureIshikawa
source: Ishikawa Prefecture
de: [DE] 石川県
es: Prefectura de Ishikawa
ja: 石川県
ko: [KO] 石川県
zh: [ZH] 石川県
zh_tw: [ZH_TW] 石川県

# prefectureFukui
source: Fukui Prefecture
de: [DE] 福井県
es: Prefectura de Fukui
ja: 福井県
ko: [KO] 福井県
zh: [ZH] 福井県
zh_tw: [ZH_TW] 福井県

# prefectureYamanashi
source: Yamanashi Prefecture
de: [DE] 山梨県
es: Prefectura de Yamanashi
ja: 山梨県
ko: [KO] 山梨県
zh: [ZH] 山梨県
zh_tw: [ZH_TW] 山梨県

# prefectureNagano
source: Nagano Prefecture
de: [DE] 長野県
es: Prefectura de Nagano
ja: 長野県
ko: [KO] 長野県
zh: [ZH] 長野県
zh_tw: [ZH_TW] 長野県

# prefectureGifu
source: Gifu Prefecture
de: [DE] 岐阜県
es: Prefectura de Gifu
ja: 岐阜県
ko: [KO] 岐阜県
zh: [ZH] 岐阜県
zh_tw: [ZH_TW] 岐阜県

# prefectureShizuoka
source: Shizuoka Prefecture
de: [DE] 静岡県
es: Prefectura de Shizuoka
ja: 静岡県
ko: [KO] 静岡県
zh: [ZH] 静岡県
zh_tw: [ZH_TW] 静岡県

# prefectureAichi
source: Aichi prefecture
de: [DE] 愛知県
es: Prefectura de Aichi
ja: 愛知県
ko: [KO] 愛知県
zh: [ZH] 愛知県
zh_tw: [ZH_TW] 愛知県

# prefectureMie
source: Mie Prefecture
de: [DE] 三重県
es: Prefectura de Mie
ja: 三重県
ko: [KO] 三重県
zh: [ZH] 三重県
zh_tw: [ZH_TW] 三重県

# prefectureShiga
source: Shiga Prefecture
de: [DE] 滋賀県
es: Prefectura de Shiga
ja: 滋賀県
ko: [KO] 滋賀県
zh: [ZH] 滋賀県
zh_tw: [ZH_TW] 滋賀県

# prefectureKyoto
source: Kyoto Prefecture
de: Kyoto
es: Prefectura de Kioto
ja: 京都府
ko: 교토
zh: 京都
zh_tw: 京都

# prefectureOsaka
source: Osaka Prefecture
de: Osaka
es: Prefectura de Osaka
ja: 大阪府
ko: 오사카
zh: 大阪
zh_tw: 大阪

# prefectureHyogo
source: Hyogo Prefecture
de: [DE] 兵庫県
es: Prefectura de Hyogo
ja: 兵庫県
ko: [KO] 兵庫県
zh: [ZH] 兵庫県
zh_tw: [ZH_TW] 兵庫県

# prefectureNara
source: Nara Prefecture
de: [DE] 奈良県
es: Prefectura de Nara
ja: 奈良県
ko: [KO] 奈良県
zh: [ZH] 奈良県
zh_tw: [ZH_TW] 奈良県

# prefectureWakayama
source: Wakayama Prefecture
de: [DE] 和歌山県
es: Prefectura de Wakayama
ja: 和歌山県
ko: [KO] 和歌山県
zh: [ZH] 和歌山県
zh_tw: [ZH_TW] 和歌山県

# prefectureTottori
source: Tottori Prefecture
de: [DE] 鳥取県
es: Prefectura de Tottori
ja: 鳥取県
ko: [KO] 鳥取県
zh: [ZH] 鳥取県
zh_tw: [ZH_TW] 鳥取県

# prefectureShimane
source: Shimane Prefecture
de: [DE] 島根県
es: Prefectura de Shimane
ja: 島根県
ko: [KO] 島根県
zh: [ZH] 島根県
zh_tw: [ZH_TW] 島根県

# prefectureOkayama
source: Okayama Prefecture
de: [DE] 岡山県
es: Prefectura de Okayama
ja: 岡山県
ko: [KO] 岡山県
zh: [ZH] 岡山県
zh_tw: [ZH_TW] 岡山県

# prefectureHiroshima
source: Hiroshima Prefecture
de: [DE] 広島県
es: Prefectura de Hiroshima
ja: 広島県
ko: [KO] 広島県
zh: [ZH] 広島県
zh_tw: [ZH_TW] 広島県

# prefectureYamaguchi
source: Yamaguchi Prefecture
de: [DE] 山口県
es: Prefectura de Yamaguchi
ja: 山口県
ko: [KO] 山口県
zh: [ZH] 山口県
zh_tw: [ZH_TW] 山口県

# prefectureTokushima
source: Tokushima Prefecture
de: [DE] 徳島県
es: Prefectura de Tokushima
ja: 徳島県
ko: [KO] 徳島県
zh: [ZH] 徳島県
zh_tw: [ZH_TW] 徳島県

# prefectureKagawa
source: Kagawa Prefecture
de: [DE] 香川県
es: Prefectura de Kagawa
ja: 香川県
ko: [KO] 香川県
zh: [ZH] 香川県
zh_tw: [ZH_TW] 香川県

# prefectureEhime
source: Ehime Prefecture
de: [DE] 愛媛県
es: Prefectura de Ehime
ja: 愛媛県
ko: [KO] 愛媛県
zh: [ZH] 愛媛県
zh_tw: [ZH_TW] 愛媛県

# prefectureKochi
source: Kochi Prefecture
de: [DE] 高知県
es: Prefectura de Kochi
ja: 高知県
ko: [KO] 高知県
zh: [ZH] 高知県
zh_tw: [ZH_TW] 高知県

# prefectureFukuoka
source: Fukuoka Prefecture
de: [DE] 福岡県
es: Prefectura de Fukuoka
ja: 福岡県
ko: 후쿠오카
zh: [ZH] 福岡県
zh_tw: [ZH_TW] 福岡県

# prefectureSaga
source: Saga Prefecture
de: [DE] 佐賀県
es: Prefectura de Saga
ja: 佐賀県
ko: [KO] 佐賀県
zh: [ZH] 佐賀県
zh_tw: [ZH_TW] 佐賀県

# prefectureNagasaki
source: Nagasaki Prefecture
de: [DE] 長崎県
es: Prefectura de Nagasaki
ja: 長崎県
ko: [KO] 長崎県
zh: [ZH] 長崎県
zh_tw: [ZH_TW] 長崎県

# prefectureKumamoto
source: Kumamoto Prefecture
de: [DE] 熊本県
es: Prefectura de Kumamoto
ja: 熊本県
ko: [KO] 熊本県
zh: [ZH] 熊本県
zh_tw: [ZH_TW] 熊本県

# prefectureOita
source: Oita Prefecture
de: [DE] 大分県
es: Prefectura de Oita
ja: 大分県
ko: [KO] 大分県
zh: [ZH] 大分県
zh_tw: [ZH_TW] 大分県

# prefectureMiyazaki
source: Miyazaki Prefecture
de: [DE] 宮崎県
es: Prefectura de Miyazaki
ja: 宮崎県
ko: [KO] 宮崎県
zh: [ZH] 宮崎県
zh_tw: [ZH_TW] 宮崎県

# prefectureKagoshima
source: Kagoshima Prefecture
de: [DE] 鹿児島県
es: Prefectura de Kagoshima
ja: 鹿児島県
ko: [KO] 鹿児島県
zh: [ZH] 鹿児島県
zh_tw: [ZH_TW] 鹿児島県

# prefectureOkinawa
source: Okinawa Prefecture
de: [DE] 沖縄県
es: Prefectura de Okinawa
ja: 沖縄県
ko: 오키나와
zh: [ZH] 沖縄県
zh_tw: [ZH_TW] 沖縄県

# viewProPlan
source: See Pro Plan
de: [DE] Proプランを見る
es: Ver Plan Pro
ja: Proプランを見る
ko: [KO] Proプランを見る
zh: [ZH] Proプランを見る
zh_tw: [ZH_TW] Proプランを見る

# rmCalculator
source: 1RM calculation
de: 1RMBerechnen
es: Cálculo de 1RM
ja: 1RM計算
ko: 1RM 계산기
zh: 1RM计算
zh_tw: [ZH_TW] 1RM計算

# plateCalculator
source: Plate Calculation
de: プレートBerechnen
es: Cálculo de placa
ja: プレート計算
ko: 플레이트 계산기
zh: プレート计算
zh_tw: [ZH_TW] プレート計算

# calculators
source: calculator
de: Rechner
es: calculadora
ja: 計算機
ko: 계산기
zh: 计算器
zh_tw: 計算機

source: body fat percentage
de: Körperfettanteil
es: porcentaje de grasa corporal
ja: 体脂肪率
ko: 체지방률
zh: 体脂率
zh_tw: 體脂率

source: Fatigue Management System
de: [DE] 疲労管理システム
es: Sistema de gestión de la fatiga
ja: 疲労管理システム
ko: 피로 관리 시스템
zh: [ZH] 疲労管理システム
zh_tw: [ZH_TW] 疲労管理システム

# enableFatigueManagement
source: Turn on your fatigue management system
de: [DE] 疲労管理システムをONにしてください
es: Encienda su sistema de gestión de la fatiga
ja: 疲労管理システムをONにしてください
ko: 피로 관리 시스템をONにしてください
zh: [ZH] 疲労管理システムをONにしてください
zh_tw: [ZH_TW] 疲労管理システムをONにしてください

# searchConditions
source: Try changing your search criteria
de: [DE] 検索条件を変更してみてください
es: Intente cambiar sus criterios de búsqueda
ja: 検索条件を変更してみてください
ko: [KO] 検索条件を変更してみてください
zh: [ZH] 検索条件を変更してみてください
zh_tw: [ZH_TW] 検索条件を変更してみてください

# postSubmitted
source: Your submission has been accepted!
de: [DE] 投稿を受付ました！
es: ¡Su envío ha sido aceptado!
ja: 投稿を受付ました！
ko: [KO] 投稿を受付ました！
zh: [ZH] 投稿を受付ました！
zh_tw: [ZH_TW] 投稿を受付ました！

source: Inappropriate content
de: Unangemessener Inhalt
es: Contenido inapropiado
ja: 不適切な内容
ko: 부적절한 내용
zh: 不当内容
zh_tw: 不當內容

source: Save Error
de: Speichernエラー
es: Error al guardar
ja: 保存エラー
ko: 저장エラー
zh: [ZH] 保存エラー
zh_tw: 儲存エラー

source: Reset failed
de: [DE] リセット失敗
es: Error de reinicio
ja: リセット失敗
ko: [KO] リセット失敗
zh: [ZH] リセット失敗
zh_tw: [ZH_TW] リセット失敗

# statisticsError
source: Statistics Loading Error
de: [DE] 統計読み込みエラー
es: Error al cargar estadísticas
ja: 統計読み込みエラー
ko: [KO] 統計読み込みエラー
zh: [ZH] 統計読み込みエラー
zh_tw: [ZH_TW] 統計読み込みエラー

# dateFormatYearMonthDay
source: MM DD, yyyy
de: [DE] yyyy年MM月dd日
es: MM DD, aaaa
ja: yyyy年MM月dd日
ko: [KO] yyyy年MM月dd日
zh: [ZH] yyyy年MM月dd日
zh_tw: [ZH_TW] yyyy年MM月dd日

# welcomeMessage
source: welcome
de: Willkommen
es: bienvenido
ja: ようこそ
ko: 환영합니다
zh: 欢迎
zh_tw: 歡迎

# skipIntro
source: skip
de: Überspringen
es: saltar
ja: スキップ
ko: 건너뛰기
zh: 跳过
zh_tw: 跳過

# finish
source: completion
de: [DE] 完了
es: terminación
ja: 完了
ko: [KO] 完了
zh: [ZH] 完了
zh_tw: [ZH_TW] 完了

source: tutorial
de: Anleitung
ja: チュートリアル
ko: 튜토리얼
zh: 教程
zh_tw: 教學

source: Contact Support
de: [DE] サポートに連絡
es: Contactar con soporte técnico
ja: サポートに連絡
ko: [KO] サポートに連絡
zh: [ZH] サポートに連絡
zh_tw: [ZH_TW] サポートに連絡

source: Data Management
de: Datenverwaltung
es: Gestión de datos
ja: データ管理
ko: 데이터 관리
zh: 数据管理
zh_tw: 資料管理

source: Export Data
de: [DE] データをエクスポート
es: Exportar datos
ja: データをエクスポート
ko: [KO] データをエクスポート
zh: [ZH] データをエクスポート
zh_tw: [ZH_TW] データをエクスポート

source: Import data
de: [DE] データをインポート
es: Importar datos
ja: データをインポート
ko: [KO] データをインポート
zh: [ZH] データをインポート
zh_tw: [ZH_TW] データをインポート

# sortByAmount
source: Quantity order
de: [DE] 量順
es: Orden de cantidad
ja: 量順
ko: [KO] 量順
zh: [ZH] 量順
zh_tw: [ZH_TW] 量順

source: morning
de: Morgen
es: mañana
ja: 朝
ko: 아침
zh: 早上
zh_tw: 早上

source: afternoon
de: Nachmittag
es: tarde
ja: 午後
ko: 오후
zh: 下午
zh_tw: 下午

source: evening
de: Abend
es: noche
ja: 夕方
ko: 저녁
zh: 傍晚
zh_tw: 傍晚

source: night
de: Nacht
es: noche
ja: 夜
ko: 밤
zh: 晚上
zh_tw: 晚上

# daily
source: every day
de: Täglich
es: cada día
ja: 毎日
ko: 매일
zh: 每天
zh_tw: 每天

# weekly
source: Every week
de: Wöchentlich
es: Cada semana
ja: 毎週
ko: 매주
zh: 每周
zh_tw: 每週

# weeklyStats
source: Weekly Statistics
de: [DE] 週間統計
es: Estadísticas semanales
ja: 週間統計
ko: [KO] 週間統計
zh: [ZH] 週間統計
zh_tw: [ZH_TW] 週間統計

# monthlyStats
source: monthly statistics
de: [DE] 月間統計
es: estadísticas mensuales
ja: 月間統計
ko: [KO] 月間統計
zh: [ZH] 月間統計
zh_tw: [ZH_TW] 月間統計

# yearlyStats
source: Annual Statistics
de: [DE] 年間統計
es: Estadísticas anuales
ja: 年間統計
ko: [KO] 年間統計
zh: [ZH] 年間統計
zh_tw: [ZH_TW] 年間統計

# currentStreak
source: Current consecutive days
de: [DE] 現在の連続日数
es: Días consecutivos actuales
ja: 現在の連続日数
ko: [KO] 現在の連続日数
zh: [ZH] 現在の連続日数
zh_tw: [ZH_TW] 現在の連続日数

# longestStreak
source: Longest consecutive days
de: [DE] 最長連続日数
es: Días consecutivos más largos
ja: 最長連続日数
ko: [KO] 最長連続日数
zh: [ZH] 最長連続日数
zh_tw: [ZH_TW] 最長連続日数

# congestion
source: Congestion level
de: Auslastung
es: Nivel de congestión
ja: 混雑度
ko: 혼잡도
zh: 拥挤度
zh_tw: 擁擠度

source: Congestion history
de: [DE] 混雑履歴
es: Historial de congestión
ja: 混雑履歴
ko: [KO] 混雑履歴
zh: [ZH] 混雑履歴
zh_tw: [ZH_TW] 混雑履歴

# crowdReport
source: Congestion Report
de: [DE] 混雑報告
es: Informe de congestión
ja: 混雑報告
ko: [KO] 混雑報告
zh: [ZH] 混雑報告
zh_tw: [ZH_TW] 混雑報告

source: nearby
de: [DE] 近くの
es: cercano
ja: 近くの
ko: [KO] 近くの
zh: [ZH] 近くの
zh_tw: [ZH_TW] 近くの

source: AI suggestion
de: [DE] AI提案
es: Sugerencia de IA
ja: AI提案
ko: [KO] AI提案
zh: [ZH] AI提案
zh_tw: [ZH_TW] AI提案

source: Personalized Plan
de: [DE] パーソナライズプラン
es: Plan personalizado
ja: パーソナライズプラン
ko: [KO] パーソナライズプラン
zh: [ZH] パーソナライズプラン
zh_tw: [ZH_TW] パーソナライズプラン

source: Required
de: Pflichtfeld
es: Requerido
ja: 必須
ko: 필수
zh: 必填
zh_tw: 必填

# optional
source: any
de: Optional
es: cualquier
ja: 任意
ko: 선택
zh: 选填
zh_tw: 選填

source: Please enter
de: [DE] 入力してください
es: Por favor, introduzca
ja: 入力してください
ko: [KO] 入力してください
zh: [ZH] 入力してください
zh_tw: [ZH_TW] 入力してください

source: Invalid input
de: [DE] 入力が正しくありません
es: Entrada no válida
ja: 入力が正しくありません
ko: [KO] 入力が正しくありません
zh: [ZH] 入力が正しくありません
zh_tw: [ZH_TW] 入力が正しくありません

source: Too short
de: [DE] 短すぎます
es: Demasiado corto
ja: 短すぎます
ko: [KO] 短すぎます
zh: [ZH] 短すぎます
zh_tw: [ZH_TW] 短すぎます

source: Too long
de: [DE] 長すぎます
es: Demasiado largo
ja: 長すぎます
ko: [KO] 長すぎます
zh: [ZH] 長すぎます
zh_tw: [ZH_TW] 長すぎます

source: copy
de: Kopieren
es: Copiar
ja: コピー
ko: 복사
zh: 复制
zh_tw: 複製

source: paste
de: [DE] ペースト
es: pasta
ja: ペースト
ko: [KO] ペースト
zh: [ZH] ペースト
zh_tw: [ZH_TW] ペースト

# duplicate
source: Reproduction
de: Duplizieren
es: Reproducción
ja: 複製
ko: 복제
zh: 复制
zh_tw: 複製

# rename
source: Change name
de: [DE] 名前を変更
es: Cambiar nombre
ja: 名前を変更
ko: [KO] 名前を変更
zh: [ZH] 名前を変更
zh_tw: [ZH_TW] 名前を変更

source: move
de: [DE] 移動
es: mover
ja: 移動
ko: [KO] 移動
zh: [ZH] 移動
zh_tw: [ZH_TW] 移動

source: archive
de: [DE] アーカイブ
es: archivo
ja: アーカイブ
ko: [KO] アーカイブ
zh: [ZH] アーカイブ
zh_tw: [ZH_TW] アーカイブ

source: Inactive
de: 非Aktiv
es: Inactivo
ja: 非アクティブ
ko: 비활성
zh: 非活跃
zh_tw: 非活躍

source: pending
de: Ausstehend
es: pendiente
ja: 保留中
ko: 보류 중
zh: 待定
zh_tw: 待定

source: Completed
de: [DE] 完了済み
es: Terminado
ja: 完了済み
ko: [KO] 完了済み
zh: [ZH] 完了済み
zh_tw: [ZH_TW] 完了済み

source: in progress
de: [DE] 進行中
es: en curso
ja: 進行中
ko: [KO] 進行中
zh: [ZH] 進行中
zh_tw: [ZH_TW] 進行中

# scheduled
source: schedule
de: [DE] 予定
es: cronograma
ja: 予定
ko: [KO] 予定
zh: [ZH] 予定
zh_tw: [ZH_TW] 予定

# intensityVeryLight
source: Very light
de: [DE] 非常に軽い
es: Muy claro
ja: 非常に軽い
ko: [KO] 非常に軽い
zh: [ZH] 非常に軽い
zh_tw: [ZH_TW] 非常に軽い

# intensityLight
source: light
de: [DE] 軽い
es: luz
ja: 軽い
ko: [KO] 軽い
zh: [ZH] 軽い
zh_tw: [ZH_TW] 軽い

# intensityModerate
source: usually
de: [DE] 普通
es: generalmente
ja: 普通
ko: [KO] 普通
zh: [ZH] 普通
zh_tw: [ZH_TW] 普通

# intensityHard
source: tight
de: [DE] きつい
es: ajustado
ja: きつい
ko: [KO] きつい
zh: [ZH] きつい
zh_tw: [ZH_TW] きつい

# intensityVeryHard
source: Very tight
de: [DE] 非常にきつい
es: Muy apretado
ja: 非常にきつい
ko: [KO] 非常にきつい
zh: [ZH] 非常にきつい
zh_tw: [ZH_TW] 非常にきつい

# intensityMaximal
source: maximum
de: [DE] 最大
es: máximo
ja: 最大
ko: [KO] 最大
zh: [ZH] 最大
zh_tw: [ZH_TW] 最大

# rest
source: break
de: Pause
es: romper
ja: 休憩
ko: [KO] 休憩
zh: 休息
zh_tw: [ZH_TW] 休憩

source: Rest day
de: [DE] 休養日
es: Día de descanso
ja: 休養日
ko: [KO] 休養日
zh: [ZH] 休養日
zh_tw: [ZH_TW] 休養日

source: recovery
de: [DE] 回復
es: recuperación
ja: 回復
ko: [KO] 回復
zh: [ZH] 回復
zh_tw: [ZH_TW] 回復

source: Rest between sets
de: [DE] セット間休憩
es: Descanso entre series
ja: セット間休憩
ko: [KO] セット間休憩
zh: [ZH] セット間休憩
zh_tw: [ZH_TW] セット間休憩
