Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# workout_border_OutlineInputBorder_prefixIcon_IconIconsfitn
source: , border: OutlineInputBorder(), prefixIcon: Icon(Icons.fitness_center), ), keyboardType: const TextInputType.numberWithOptions(decimal: true), textInputAction: TextInputAction.done, onEditingComplete: () => FocusScope.of(context).unfocus(), onChanged: (value) { final oneRM = double.tryParse(value); if (oneRM != null && oneRM > 0) { _calculateWeightRatioAndLevel(oneRM); } else { // 🔧 Phase 7 Fix: Clear Weight Ratio on invalid input setState(() { _currentOneRM = null; _weightRatio = null; _objectiveLevel = null; }); } }, validator: (value) { if (value == null || value.isEmpty) { return AppLocalizations.of(context)!.enterOneRM; } final weight = double.tryParse(value); if (weight == null) { return
es: , borde: OutlineInputBorder(), prefixIcon: Icon(Icons.fitness_center), ), keyboardType: const TextInputType.numberWithOptions(decimal: true), textInputAction: TextInputAction.done, onEditingComplete: () => FocusScope.of(context).unfocus(), onChanged: (value) { final oneRM = double.tryParse(value); if (oneRM != null && oneRM > 0) { _calculateWeightRatioAndLevel(oneRM); } else { // 🔧 Corrección de la Fase 7: Borrar la proporción de peso en entradas no válidas setState(() { _currentOneRM = null; _weightRatio = null; _objectiveLevel = null; }); } }, validador: (valor) { si (valor == nulo || valor.estáVacío) { devuelve AppLocalizations.of(contexto)!.enterOneRM; } peso final = double.tryParse(valor); si (peso == nulo) { devuelve
ja: , border: OutlineInputBorder(), prefixIcon: Icon(Icons.fitness_center), ), keyboardType: const TextInputType.numberWithOptions(decimal: true), textInputAction: TextInputAction.done, onEditingComplete: () => FocusScope.of(context).unfocus(), onChanged: (value) { final oneRM = double.tryParse(value); if (oneRM != null && oneRM > 0) { _calculateWeightRatioAndLevel(oneRM); } else { // 🔧 Phase 7 Fix: 無効な入力時はWeight Ratioをクリア setState(() { _currentOneRM = null; _weightRatio = null; _objectiveLevel = null; }); } }, validator: (value) { if (value == null || value.isEmpty) { return AppLocalizations.of(context)!.enterOneRM; } final weight = double.tryParse(value); if (weight == null) { return

# gym_パワーラック
source: Power rack
ja: パワーラック

# general_記録がありません
source: No records
es: No hay registros
ja: 記録がありません

# workout_トレーナーからのメッセージ
source: Message from the trainer
es: Mensaje del entrenador
ja: トレーナーからのメッセージ

# general_レート制限に達しました
source: Rate limit reached
es: Límite de velocidad alcanzado
ja: レート制限に達しました

# general_AppLocalizationsofcontextsearchGym_位置情報は検索のみに使用され保
source: ${AppLocalizations.of(context)!.searchGym} *Location information is used only for searches and is not stored.
es: ${AppLocalizations.of(context)!.searchGym} *La información de ubicación se utiliza únicamente para búsquedas y no se almacena.
ja: ${AppLocalizations.of(context)!.searchGym} ※位置情報は検索のみに使用され、保存されません。

# general_残りセッション
source: Remaining sessions
es: Sesiones restantes
ja: 残りセッション

# subscription_AI追加購入完了_5回_合計_currentAddon_5回
source: ✅ AI add-on purchases completed: +5 times (Total: ${currentAddon + 5} times)
es: ✅ Compras de complementos de IA completadas: +5 veces (Total: ${currentAddon + 5} veces)
ja: ✅ AI追加購入完了: +5回 (合計: ${currentAddon + 5}回)

# subscription_成長予測と効果分析
source: 📈 Growth forecast and impact analysis
es: 📈 Previsión de crecimiento y análisis de impacto
ja: 📈 成長予測と効果分析

# workout_ワークアウト保存開始
source: 💾 Start saving your workout
es: 💾 Empieza a guardar tu entrenamiento
ja: 💾 ワークアウト保存開始

# general_メッセージを送信して_会話を始めましょう
source: Send a message and start a conversation
es: Envía un mensaje e inicia una conversación.
ja: メッセージを送信して 会話を始めましょう

# subscription_プラン管理
source: Plan Management
es: Gestión de planes
ja: プラン管理

# gym_ジュラシックアカデミー
source: Jurassic Academy
es: Academia Jurásica
ja: ジュラシックアカデミー

# general_高ボリューム達成Grgic_2018
source: High volume achieved (Grgic 2018)
es: Alto volumen logrado (Grgic 2018)
ja: 高ボリューム達成（Grgic 2018）

# workout_総セット数_totalSets
source: Total sets: $totalSets
es: Conjuntos totales: $totalSets
ja: 総セット数: $totalSets

# general_匿名認証成功_userCredentialuseruid
source: ✅ Anonymous authentication successful: ${userCredential.user?.uid}
es: ✅ Autenticación anónima exitosa: ${userCredential.user?.uid}
ja: ✅ 匿名認証成功: ${userCredential.user?.uid}

# subscription_ジム検索_AI混雑度予測_トレーニング記録_AI機能月3回
source: Gym search + AI crowd prediction + training record + AI function 3 times a month
es: Búsqueda de gimnasios + predicción de multitudes con IA + registro de entrenamiento + función de IA 3 veces al mes
ja: ジム検索 + AI混雑度予測 + トレーニング記録 + AI機能月3回

# error_マッチングリクエスト送信エラー_e
source: Matching request submission error: $e
es: Error de envío de solicitud coincidente: $e
ja: マッチングリクエスト送信エラー: $e

# general_PR更新_exercisename_maxEstimated1RMtoStringAsFixed1k
source: ✅ PR update: ${exercise.name} → ${maxEstimated1RM.toStringAsFixed(1)}kg
es: ✅ Actualización de PR: ${exercise.name} → ${maxEstimated1RM.toStringAsFixed(1)}kg
ja: ✅ PR更新: ${exercise.name} → ${maxEstimated1RM.toStringAsFixed(1)}kg

# personalFactor_アルコール摂取量を入力してください0も入力
source: Please enter your alcohol intake (including 0)
es: Por favor ingrese su consumo de alcohol (incluido 0)
ja: アルコール摂取量を入力してください（0も入力）

# general_poAppLocalizationsofcontextpassword_PO_Email認証開始
source: poAppLocalizations.of(context)!.password📧 PO Email authentication started...
es: poAppLocalizations.of(context)!.password📧 Autenticación de correo electrónico de PO iniciada...
ja: poAppLocalizations.of(context)!.password📧 PO Email認証開始...

# general_パートナージム統合処理開始
source: 🏆 Partner gym integration process has begun...
es: 🏆Ya comenzó el proceso de integración de gimnasios asociados...
ja: 🏆 パートナージム統合処理開始...

# profile_販売価格
source: Sales price
es: Precio de venta
ja: 販売価格

# general_aiCount回
source: / $aiCount times
es: / $aiCount veces
ja: / $aiCount回

# general_GPS取得成功_positionlatitude_positionlongitude
source: ✅ Successful GPS acquisition: ${position.latitude}, ${position.longitude}
es: ✅ Adquisición de GPS exitosa: ${position.latitude}, ${position.longitude}
ja: ✅ GPS取得成功: ${position.latitude}, ${position.longitude}

# workout_exerciseNameslength種目_setslength_セット
source: ${exerciseNames.length} exercises • ${sets.length} sets
es: ${exerciseNames.length} ejercicios • ${sets.length} conjuntos
ja: ${exerciseNames.length}種目 • ${sets.length} セット

# general_実力差でソート完了_profileslength件
source: ✅ Sorted by skill level: ${profiles.length}
es: ✅ Ordenado por nivel de habilidad: ${profiles.length}
ja: ✅ 実力差でソート完了: ${profiles.length}件

# error_analyzeTrainingEffect全体エラー_e
source: ❌❌❌ analyzeTrainingEffect global error: $e
es: ❌❌❌ Error global de analyseTrainingEffect: $e
ja: ❌❌❌ analyzeTrainingEffect全体エラー: $e

# profile_夕
source: evening
es: noche
ja: 夕

# workout_まだ記録がありません最初のワークアウトを記録しましょう
source: No records yet. Record your first workout!
es: Aún no hay registros. ¡Graba tu primer entrenamiento!
ja: まだ記録がありません。最初のワークアウトを記録しましょう！

# general_ユーザー_userId_の平均1RM_averagetoStringAsFixed1kg_value
source: ✅ User $userId's average 1RM: ${average.toStringAsFixed(1)}kg (${values.length} events)
es: ✅ 1RM promedio del usuario $userId: ${average.toStringAsFixed(1)}kg (eventos ${values.length})
ja: ✅ ユーザー $userId の平均1RM: ${average.toStringAsFixed(1)}kg (${values.length}種目)

# general_福岡
source: Fukuoka
ja: 福岡

# general_magicNumberCount5記録
source: $_magicNumberCount/5 records
es: $_magicNumberCount/5 registros
ja: $_magicNumberCount/5記録

# error_Firebase認証エラー_ecode_emessage
source: ❌ Firebase Authentication Error: ${e.code} - ${e.message}
es: ❌ Error de autenticación de Firebase: ${e.code} - ${e.message}
ja: ❌ Firebase認証エラー: ${e.code} - ${e.message}

# general_AIメニューを作成
source: Create an AI menu
es: Crear un menú de IA
ja: AIメニューを作成

# general_プラン基本_無制限_追加購入_addonLimit回
source: Basic plan: Unlimited / Additional purchases: $_addonLimit times
es: Plan básico: Ilimitado / Compras adicionales: $_addonLimit times
ja: プラン基本: 無制限 / 追加購入: $_addonLimit回

# general_負荷増加_週weeklyRate_100_10round_10のペースで重量を上げる
source: * Increase Load: Increase weight at a rate of +${(weeklyRate * 100 * 10).round() / 10}% per week
es: * Aumentar la carga: aumenta el peso a una tasa de +${(weeklyRate * 100 * 10).round() / 10}% por semana
ja: * 負荷増加: 週+${(weeklyRate * 100 * 10).round() / 10}%のペースで重量を上げる

# general_500月で毎月10回
source: ¥500/month for 10 sessions per month
es: ¥500/mes por 10 sesiones al mes
ja: ¥500/月で毎月10回

# general_疲労管理システムとは
source: What is a fatigue management system?
es: ¿Qué es un sistema de gestión de la fatiga?
ja: 疲労管理システムとは？

# general_トレーニング効果の評価
source: ## Training effectiveness evaluation
es: ## Evaluación de la eficacia de la formación
ja: ## トレーニング効果の評価

# error_最終訪問日取得失敗_e
source: ❌ Failed to get last visit date: $e
es: ❌ No se pudo obtener la fecha de la última visita: $e
ja: ❌ 最終訪問日取得失敗: $e

# general_深夜時間帯に集中利用
source: Concentrated use during late night hours
es: Uso concentrado durante las horas nocturnas
ja: 深夜時間帯に集中利用

# workout_ペックフライ
source: Pec Fly
ja: ペックフライ

# general_画像アップロード中_imagename
source: 📤 Image uploading: ${image.name}
es: 📤 Carga de imagen: ${image.name}
ja: 📤 画像アップロード中: ${image.name}

# profile_本表記に関するご質問サービスに関するお問い合わせは以下までご連絡ください
source: If you have any questions about this notice or inquiries about our services, please contact us at the address below.
es: Si tiene alguna pregunta sobre este aviso o consultas sobre nuestros servicios, comuníquese con nosotros a la siguiente dirección.
ja: 本表記に関するご質問、サービスに関するお問い合わせは、以下までご連絡ください。

# general_群馬
source: Gunma
ja: 群馬

# general_プラトー期を検出しましたプログラム変更種目変更強度変更を推奨します
source: A plateau has been detected. We recommend changing your program (changing exercises and intensity).
es: Se ha detectado una meseta. Recomendamos cambiar el programa (modificar los ejercicios y la intensidad).
ja: プラトー期を検出しました。プログラム変更（種目変更、強度変更）を推奨します。

# subscription_永年プラン無期限
source: ⭐ Lifetime plan (unlimited)
es: ⭐ Plan de por vida (ilimitado)
ja: ⭐ 永年プラン（無期限）

# general_データ不足
source: Data shortage
es: escasez de datos
ja: データ不足

# workout_を重点的にトレーニング_targetPartscontainsAppLocalizationsofc
source: )} ${targetParts.contains(AppLocalizations.of(context)!.exerciseCardio) ?
ja: )}を重点的にトレーニング ${targetParts.contains(AppLocalizations.of(context)!.exerciseCardio) ?

# workout_15kg_女性用
source: 15kg (for women)
es: 15 kg (para mujeres)
ja: 15kg (女性用)

# general_他_allWorkoutslength_3件
source: ... and more ${allWorkouts.length - 3}
es: ... y más ${allWorkouts.length - 3}
ja: ... 他 ${allWorkouts.length - 3}件

# general_ボリューム強度頻度の個別最適化を提案
source: We propose individual optimization of volume, intensity, and frequency.
es: Proponemos una optimización individual del volumen, intensidad y frecuencia.
ja: ボリューム・強度・頻度の個別最適化を提案

# general_報酬_nextMilestonereward
source: Reward: ${_nextMilestone!.reward}
es: Recompensa: ${_nextMilestone!.reward}
ja: 報酬: ${_nextMilestone!.reward}

# subscription_ジムレビュー投稿
source: ⭐ Post a gym review
es: ⭐ Publica una reseña del gimnasio
ja: ⭐ ジムレビュー投稿

# general_まだパーソナル会員がいません
source: I don't have a personal account yet
es: Aún no tengo una cuenta personal
ja: まだパーソナル会員がいません

# general_GYM_MATCHでトレーニング記録をシェア_GYMMATCH_筋トレ記録_ジム_httpsgymm
source: Share your training records on GYM MATCH! #GYMMATCH #muscletrainingrecord #gym https://gym-match-e560d.web.app
es: ¡Comparte tus récords de entrenamiento en GYM MATCH! #GYMMATCH #récorddeentrenamientomuscular #gimnasio https://gym-match-e560d.web.app
ja: GYM MATCHでトレーニング記録をシェア！ #GYMMATCH #筋トレ記録 #ジム https://gym-match-e560d.web.app

# general_Skip_docid_時空間スコア低_score点
source: ⏭️ Skip: ${doc.id} - Low space-time score ($score points)
es: ⏭️ Saltar: ${doc.id} - Puntuación espacio-temporal baja (puntos de puntuación)
ja: ⏭️ Skip: ${doc.id} - 時空間スコア低 ($score点)

# profile_Freeプラン
source: Free Plan
es: Plan gratuito
ja: Freeプラン

# general_Firestore更新開始_workout_logsworkoutId
source: 📤 Firestore update started: workout_logs/$workoutId
es: 📤 Actualización de Firestore iniciada: workout_logs/$workoutId
ja: 📤 Firestore更新開始: workout_logs/$workoutId

# workout_履歴データ_なし
source: 📊 Historical Data: None
es: 📊 Datos históricos: Ninguno
ja: 📊 履歴データ: なし

# subscription_無料プランの全機能
source: ✨ All features in the free plan
es: ✨ Todas las funciones en el plan gratuito
ja: ✨ 無料プランの全機能

# gym_アメリカ発の話題のグループトレーニングスタジオ
source: A popular group training studio originating from the United States.
es: Un popular estudio de entrenamiento grupal originario de los Estados Unidos.
ja: アメリカ発の話題のグループトレーニングスタジオ。

# workout_全選択
source: FullSelect
es: Selección completa
ja: 全選択

# workout_この日は既にオフ日として登録されています
source: This day is already registered as an off day
es: Este día ya está registrado como día libre.
ja: この日は既にオフ日として登録されています

# workout_プリセットに戻る
source: Return to presets
es: Volver a los ajustes preestablecidos
ja: プリセットに戻る

# general_AI残回数_remainingCredits回
source: AI remaining times: $remainingCredits times
es: Tiempos restantes de IA: $remainingCredits veces
ja: AI残回数: $remainingCredits回

# gym_このジムの良かった点や改善点を教えてください
source: What are the good points and areas for improvement at this gym?
es: ¿Cuales son los puntos buenos y áreas de mejora de este gimnasio?
ja: このジムの良かった点や改善点を教えてください

# general_Google_Places_APIタイムアウト_e
source: ⏱️ Google Places API Timeout: $e
es: ⏱️ Tiempo de espera de la API de Google Places: $e
ja: ⏱️ Google Places APIタイムアウト: $e

# workout_onTap_Navigatorpush_context_MaterialPageRoutebuild_1
source: , onTap: () => Navigator.push( context, MaterialPageRoute(builder: (context) => const BodyMeasurementScreen()), ).then((_) => _loadLatestBodyWeight()), ), ], ); } /// Data display line (age/weight) Widget _buildDataRow({ required IconData icon, required String label, required String value, required String actionLabel, required VoidCallback onTap, }) { return Container( padding: const EdgeInsets.all(12), decoration: BoxDecoration( color: Colors.blue.shade50, borderRadius: BorderRadius.circular(8), border: Border.all(color: Colors.blue.shade200), ), child: Row( children: [ Icon(icon, color: Colors.blue.shade700), const SizedBox(width: 12), Expanded( child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Text( label, style: TextStyle( fontSize: 12, color: Colors.grey.shade600, ), ), Text( value, style: const TextStyle( fontSize: 16, fontWeight: FontWeight.bold, ), ), ], ), ), TextButton( onPressed: onTap, child: Text(actionLabel), ), ], ), ); } /// Warning card (when not set) Widget _buildWarningCard({ required String message, required String actionLabel, required VoidCallback onTap, }) { return Container( padding: const EdgeInsets.all(12), decoration: BoxDecoration( color: Colors.orange.shade50, borderRadius: BorderRadius.circular(8), border: Border.all(color: Colors.orange.shade300), ), child: Row( children: [ Icon(Icons.warning_amber, color: Colors.orange.shade700), const SizedBox(width: 12), Expanded( child: Text( message, style: const TextStyle(fontSize: 13), ), ), TextButton( onPressed: onTap, child: Text(actionLabel), ), ], ), ); } /// 1RM input field (with Weight Ratio calculation) Widget _build1RMInputField() { return TextFormField( controller: _oneRMController, // 🔧 Phase 7 Fix: Use controller decoration: InputDecoration( labelText:
es: , onTap: () => Navigator.push( contexto, MaterialPageRoute(builder: (contexto) => const BodyMeasurementScreen()), ).then((_) => _loadLatestBodyWeight()), ), ], ); } /// Línea de visualización de datos (edad/peso) Widget _buildDataRow({ requerido IconData icono, requerido String etiqueta, requerido String valor, requerido String actionLabel, requerido VoidCallback onTap, }) { return Container( padding: const EdgeInsets.all(12), decoration: BoxDecoration( color: Colors.blue.shade50, borderRadius: BorderRadius.circular(8), border: Border.all(color: Colors.blue.shade200), ), child: Row( children: [ Icon(icon, color: Colors.blue.shade700), const SizedBox(width: 12), Expanded( child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Text( etiqueta, style: TextStyle( fontSize: 12, color: Colores.gris.sombra600, ), ), Texto( valor, estilo: constante EstiloTexto( TamañoDeFuente: 16, PesoDeFuente: PesoDeFuente.bold, ), ), ], ), ), BotónDeTexto( alPresionar: alTap, hijo: Texto(EtiquetaDeAcción), ), ], ), ); } /// Tarjeta de advertencia (cuando no está configurada) Widget _buildWarningCard({ String message, String actionLabel, VoidCallback onTap, }) { return Container( padding: const EdgeInsets.all(12), decoration: BoxDecoration( color: Colors.orange.shade50, borderRadius: BorderRadius.circular(8), border: Border.all(color: Colors.orange.shade300), ), child: Row( children: [ Icon(Icons.warning_amber, color: Colors.orange.shade700), const SizedBox(width: 12), Expanded( child: Text( message, style: const TextStyle(fontSize: 13), ), ), TextButton( onPressed: onTap, child: Text(actionLabel), ), ], ), ); } /// Campo de entrada 1RM (con cálculo de ratio de peso) Widget _build1RMInputField() { return TextFormField( controller: _oneRMController, // 🔧 Corrección de la fase 7: Usar el controlador decoration: InputDecoration( labelText:
ja: , onTap: () => Navigator.push( context, MaterialPageRoute(builder: (context) => const BodyMeasurementScreen()), ).then((_) => _loadLatestBodyWeight()), ), ], ); } /// データ表示行（年齢・体重） Widget _buildDataRow({ required IconData icon, required String label, required String value, required String actionLabel, required VoidCallback onTap, }) { return Container( padding: const EdgeInsets.all(12), decoration: BoxDecoration( color: Colors.blue.shade50, borderRadius: BorderRadius.circular(8), border: Border.all(color: Colors.blue.shade200), ), child: Row( children: [ Icon(icon, color: Colors.blue.shade700), const SizedBox(width: 12), Expanded( child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Text( label, style: TextStyle( fontSize: 12, color: Colors.grey.shade600, ), ), Text( value, style: const TextStyle( fontSize: 16, fontWeight: FontWeight.bold, ), ), ], ), ), TextButton( onPressed: onTap, child: Text(actionLabel), ), ], ), ); } /// 警告カード（未設定時） Widget _buildWarningCard({ required String message, required String actionLabel, required VoidCallback onTap, }) { return Container( padding: const EdgeInsets.all(12), decoration: BoxDecoration( color: Colors.orange.shade50, borderRadius: BorderRadius.circular(8), border: Border.all(color: Colors.orange.shade300), ), child: Row( children: [ Icon(Icons.warning_amber, color: Colors.orange.shade700), const SizedBox(width: 12), Expanded( child: Text( message, style: const TextStyle(fontSize: 13), ), ), TextButton( onPressed: onTap, child: Text(actionLabel), ), ], ), ); } /// 1RM入力フィールド（Weight Ratio計算付き） Widget _build1RMInputField() { return TextFormField( controller: _oneRMController, // 🔧 Phase 7 Fix: controllerを使用 decoration: InputDecoration( labelText:

# general_トレーニングを予約する
source: Book a training session
es: Reserva una sesión de formación
ja: トレーニングを予約する

# workout_トレーナー記録取得エラー_e_1
source: ❌ Trainer record retrieval error: $e
es: ❌ Error de recuperación de registro del entrenador: $e
ja: ❌ トレーナー記録取得エラー: $e

# general_保健所
source: public health center
es: centro de salud pública
ja: 保健所

# general_その他ご要望任意
source: Other requests (optional)
es: Otras solicitudes (opcional)
ja: その他ご要望（任意）

# general_達成した目標がありません
source: No goals achieved
es: No se lograron objetivos
ja: 達成した目標がありません

# general_バナー広告が閉じられました
source: 📱 Banner ads closed
es: 📱 Anuncios de banner cerrados
ja: 📱 バナー広告が閉じられました

# subscription_購入履歴を復元しました
source: Your purchase history has been restored!
es: ¡Tu historial de compras ha sido restaurado!
ja: 購入履歴を復元しました！

# general_7日間_last7DaysVolumetoStringAsFixed2t
source: 7 days: ${last7DaysVolume.toStringAsFixed(2)}t
es: 7 días: ${last7DaysVolume.toStringAsFixed(2)}t
ja: 7日間: ${last7DaysVolume.toStringAsFixed(2)}t

# general_目標を作成しました_goalname_targetValuegoalunit
source: ✅ Goal created: ${goal.name} - $targetValue${goal.unit}
es: ✅ Objetivo creado: ${goal.name} - $targetValue${goal.unit}
ja: ✅ 目標を作成しました: ${goal.name} - $targetValue${goal.unit}

# workout_合計時間_recordcalculated1RMtoStringAsFixed1分
source: Total time: ${record.calculated1RM.toStringAsFixed(1)} minutes
es: Tiempo total: ${record.calculated1RM.toStringAsFixed(1)} minutos
ja: 合計時間: ${record.calculated1RM.toStringAsFixed(1)}分

# general_PO管理者権限がありません
source: No PO Admin privileges
es: Sin privilegios de administrador de PO
ja: PO管理者権限がありません

# workout_AI使用回数_await_subscriptionServicegetCurrentMonthAIU
source: AI usage count: ${await _subscriptionService.getCurrentMonthAIUsage()}
es: Recuento de uso de IA: ${await _subscriptionService.getCurrentMonthAIUsage()}
ja: AI使用回数: ${await _subscriptionService.getCurrentMonthAIUsage()}

# general_科学的根拠効果分析_ボリューム_vs_効果_1セット追加_筋肥大037_Schoenfeld_201
source: [Scientific Evidence (Effectiveness Analysis)] ## Volume vs. Effect - 1 additional set → +0.37% hypertrophy (Schoenfeld 2017) - Beginners: 10-12 sets/body part per week (Ralston 2017) - Intermediate/Advanced: 12-20 sets/body part per week (Baz-Valle 2022) ## Frequency vs. Effect - Total volume is paramount (Grgic 2018) - Upper body: 3 or more times per week is effective (p=0.004) ## Rest Days - Large muscle groups: 48-72 hours (Davies 2024) - Small muscle groups: 24-48 hours (2024 Review) - MPS Sustained: Up to 48 hours (Davies 2024) ## Intensity - Strength: >60% 1RM required (Schoenfeld 2017) - Muscle hypertrophy: Intensity is irrelevant if you work to your limit (Schoenfeld 2017)
es: [Evidencia científica (Análisis de efectividad)] ## Volumen vs. Efecto - 1 serie adicional → +0,37 % de hipertrofia (Schoenfeld 2017) - Principiantes: 10-12 series/grupo muscular por semana (Ralston 2017) - Intermedio/Avanzado: 12-20 series/grupo muscular por semana (Baz-Valle 2022) ## Frecuencia vs. Efecto - El volumen total es fundamental (Grgic 2018) - Tren superior: 3 o más veces por semana es efectivo (p=0,004) ## Días de descanso - Grupos musculares grandes: 48-72 horas (Davies 2024) - Grupos musculares pequeños: 24-48 horas (Revisión de 2024) - MPS sostenida: Hasta 48 horas (Davies 2024) ## Intensidad - Fuerza: Se requiere >60 % de 1RM (Schoenfeld, 2017) - Hipertrofia muscular: La intensidad es irrelevante si trabajas al límite (Schoenfeld, 2017)
ja: 【科学的根拠（効果分析）】 ## ボリューム vs 効果 - 1セット追加 → 筋肥大+0.37% (Schoenfeld 2017) - 初心者: 週10-12セット/部位 (Ralston 2017) - 中級・上級者: 週12-20セット/部位 (Baz-Valle 2022) ## 頻度 vs 効果 - 総ボリュームが最重要 (Grgic 2018) - 上半身: 週3回以上が有効 (p=0.004) ## 休息日 - 大筋群: 48-72時間 (Davies 2024) - 小筋群: 24-48時間 (2024 Review) - MPS持続: 最大48時間 (Davies 2024) ## 強度 - 筋力: >60% 1RM必須 (Schoenfeld 2017) - 筋肥大: 限界まで行えば強度無関係 (Schoenfeld 2017)

# general_Pro_Planを試す
source: Try Pro Plan
es: Prueba el Plan Pro
ja: Pro Planを試す

# general_分析統計
source: Analysis/Statistics
es: Análisis/Estadísticas
ja: 分析・統計

# subscription_成長予測効果分析
source: Growth forecast and effect analysis
es: Previsión de crecimiento y análisis de efectos
ja: 成長予測・効果分析

# general_Firestore読み取りスキップキャッシュヒット_key
source: ✅ Firestore read skipped (cache hit): $key
es: ✅ Lectura de Firestore omitida (acceso a caché): $key
ja: ✅ Firestore読み取りスキップ（キャッシュヒット）: $key

# error_フラグ記録エラー_e
source: ❌ Flag recording error: $e
es: ❌ Error de grabación de la bandera: $e
ja: ❌ フラグ記録エラー: $e

# workout_画像サイズが大きすぎます_imageByteslength_1024_1024toStringAsF_1
source: ⚠️ Image size too large: ${(imageBytes.length / 1024 / 1024).toStringAsFixed(2)}MB
es: ⚠️ El tamaño de la imagen es demasiado grande: ${(imageBytes.length / 1024 / 1024).toStringAsFixed(2)}MB
ja: ⚠️ 画像サイズが大きすぎます: ${(imageBytes.length / 1024 / 1024).toStringAsFixed(2)}MB

# general_マシン設備の詳細を更新
source: Update machine and equipment details
es: Actualizar detalles de máquinas y equipos
ja: マシン・設備の詳細を更新

# workout_カスタム種目のロードに失敗_e
source: ⚠️ Failed to load custom event: $e
es: ⚠️ Error al cargar el evento personalizado: $e
ja: ⚠️ カスタム種目のロードに失敗: $e
