Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

source: Help Center
de: Hilfeセンター
es: Centro de ayuda
ja: ヘルプセンター
ko: 도움말 센터
zh: 帮助センター
zh_tw: 幫助センター

source: FAQ
de: [DE] よくある質問
es: Preguntas frecuentes
ja: よくある質問
ko: 자주 묻는 질문
zh: [ZH] よくある質問
zh_tw: [ZH_TW] よくある質問

# contactUs
source: inquiry
de: [DE] お問い合わせ
es: consulta
ja: お問い合わせ
ko: 문의하기
zh: [ZH] お問い合わせ
zh_tw: [ZH_TW] お問い合わせ

# reportProblem
source: Report a problem
de: [DE] 問題を報告
es: Informar un problema
ja: 問題を報告
ko: 문제 신고
zh: [ZH] 問題を報告
zh_tw: [ZH_TW] 問題を報告

source: feedback
de: [DE] フィードバック
es: comentario
ja: フィードバック
ko: 피드백
zh: [ZH] フィードバック
zh_tw: [ZH_TW] フィードバック

# sendFeedback
source: Submit Feedback
de: フィードバックをSenden
es: Enviar comentarios
ja: フィードバックを送信
ko: 피드백 보내기
zh: フィードバックを发送
zh_tw: フィードバックを傳送

# legal
source: legal information
de: 法的Information
es: información legal
ja: 法的情報
ko: 법적 정보
zh: 法的信息
zh_tw: 法的資訊

# licenses
source: license
de: [DE] ライセンス
es: licencia
ja: ライセンス
ko: 라이선스
zh: [ZH] ライセンス
zh_tw: [ZH_TW] ライセンス

# todaysWorkoutLog
source: Today's training log
de: HeuteのTrainingsprotokoll
es: Registro de entrenamiento de hoy
ja: 今日のトレーニング記録
ko: 오늘の운동 기록
zh: 今天の训练记录
zh_tw: 今天の訓練記錄

# noTodaysWorkout
source: There are no training records for today
de: HeuteのTrainingsprotokollがありません
es: No hay registros de entrenamiento para hoy
ja: 今日のトレーニング記録がありません
ko: 오늘の운동 기록がありません
zh: 今天の训练记录がありません
zh_tw: 今天の訓練記錄がありません

# addFirstRecord
source: Add the first record
de: 最初の記録をHinzufügen
es: Agregar el primer registro
ja: 最初の記録を追加
ko: 最初の記録を추가
zh: 最初の記録を添加
zh_tw: 最初の記録を新增

# backToHome
source: Return to Home
de: ホームにZurück
es: Regresar a Inicio
ja: ホームに戻る
ko: ホームに뒤로
zh: ホームに返回
zh_tw: ホームに返回

# noExercisesToShare
source: There are no events to share
de: シェアできるÜbungがありません
es: No hay eventos para compartir
ja: シェアできる種目がありません
ko: シェアできる운동がありません
zh: シェアできる运动がありません
zh_tw: シェアできる運動がありません

# shareFailed
source: Share failed: {error}
de: シェアにFehlgeschlagenしました: {error}
es: Error al compartir: {error}
ja: シェアに失敗しました: {error}
ko: シェアに실패しました: {error}
zh: シェアに失败しました: {error}
zh_tw: 分享に失敗しました: {error}

# shareError
source: Share error: {error}
de: シェアFehler: {error}
es: Error al compartir: {error}
ja: シェアエラー: {error}
ko: シェア오류: {error}
zh: シェア错误: {error}
zh_tw: シェア錯誤: {error}

# sortByRating
source: Rating order
de: [DE] 評価順
es: Orden de calificación
ja: 評価順
ko: 평점순
zh: [ZH] 評価順
zh_tw: [ZH_TW] 評価順

# sortByCrowd
source: By congestion level
de: Auslastung順
es: Por nivel de congestión
ja: 混雑度順
ko: 혼잡도순
zh: 拥挤度順
zh_tw: 擁擠度順

# sortByPrice
source: Price order
de: [DE] 料金順
es: Orden de precio
ja: 料金順
ko: 가격순
zh: [ZH] 料金順
zh_tw: [ZH_TW] 料金順

# noWorkoutRecords
source: No training records yet
de: まだTrainingsprotokollがありません
es: Aún no hay registros de entrenamiento
ja: まだトレーニング記録がありません
ko: まだ운동 기록がありません
zh: まだ训练记录がありません
zh_tw: まだ訓練記錄がありません

source: Authentication Error
de: 認証Fehler
es: Error de autenticación
ja: 認証エラー
ko: 認証오류
zh: 認証错误
zh_tw: 認証錯誤

# loginFailed
source: Failed to initialize or log in to Firebase
de: Anmeldung fehlgeschlagen
es: No se pudo inicializar ni iniciar sesión en Firebase
ja: Firebaseの初期化またはログインに失敗しました
ko: 로그인 실패
zh: 登录失败
zh_tw: 登入失敗

source: Updating
de: Aktualisieren中
es: Actualizando
ja: 更新中
ko: 업데이트中
zh: [ZH] 更新中
zh_tw: [ZH_TW] 更新中

# unknownExercise
source: Unknown event
de: UnbekanntなÜbung
es: Evento desconocido
ja: 不明な種目
ko: 알 수 없음な운동
zh: 未知な运动
zh_tw: 未知な運動

# prRecords
source: PR Record
de: [DE] PR記録
es: Registro de relaciones públicas
ja: PR記録
ko: [KO] PR記録
zh: [ZH] PR記録
zh_tw: [ZH_TW] PR記録

# exercisesAndSets
source: {count} events • {sets} sets
de: {count}Übung • {sets} Satz
es: {count} eventos • {sets} conjuntos
ja: {count}種目 • {sets} セット
ko: {count}운동 • {sets} 세트
zh: {count}运动 • {sets} 组
zh_tw: {count}運動 • {sets} 組

source: {duration} minutes
de: {duration}Minute
es: {duration} minutos
ja: {duration}分
ko: {duration}분
zh: [ZH] {duration}分
zh_tw: [ZH_TW] {duration}分

# sortByDistance
source: By distance
de: Entfernung順
es: Por distancia
ja: 距離順
ko: 거리順
zh: 距离順
zh_tw: [ZH_TW] 距離順

# sortByName
source: By name
de: [DE] 名前順
es: Por nombre
ja: 名前順
ko: [KO] 名前順
zh: [ZH] 名前順
zh_tw: [ZH_TW] 名前順

# filterAll
source: all
de: Alle
es: todo
ja: すべて
ko: 모두
zh: 全部
zh_tw: 全部

# filterOpen
source: Open
de: [DE] 営業中
es: Abierto
ja: 営業中
ko: [KO] 営業中
zh: [ZH] 営業中
zh_tw: [ZH_TW] 営業中

# filterNearby
source: near
de: [DE] 近く
es: cerca
ja: 近く
ko: [KO] 近く
zh: [ZH] 近く
zh_tw: [ZH_TW] 近く

# searchHint
source: search
de: Suchen
es: buscar
ja: 検索
ko: 검색
zh: 搜索
zh_tw: 搜尋

# searchGyms
source: Find a gym
de: ジムをSuchen
es: Encuentra un gimnasio
ja: ジムを検索
ko: ジムを검색
zh: ジムを搜索
zh_tw: ジムを搜尋

# noSearchResults
source: No search results found
de: Keine Suchergebnisse
es: No se encontraron resultados de búsqueda
ja: 検索結果がありません
ko: 검색 결과 없음
zh: 无搜索结果
zh_tw: 無搜尋結果

source: map
de: [DE] マップ
es: mapa
ja: マップ
ko: [KO] マップ
zh: [ZH] マップ
zh_tw: [ZH_TW] マップ

source: Open
de: [DE] 営業中
es: Abierto
ja: 営業中
ko: [KO] 営業中
zh: [ZH] 営業中
zh_tw: [ZH_TW] 営業中

source: Closed
de: [DE] 休業
es: Cerrado
ja: 休業
ko: [KO] 休業
zh: [ZH] 休業
zh_tw: [ZH_TW] 休業

source: Opening soon
de: まもなく営業Start
es: Próxima apertura
ja: まもなく営業開始
ko: まもなく営業시작
zh: まもなく営業开始
zh_tw: [ZH_TW] まもなく営業開始

source: Closing soon
de: [DE] まもなく閉店
es: Cerrando pronto
ja: まもなく閉店
ko: [KO] まもなく閉店
zh: [ZH] まもなく閉店
zh_tw: [ZH_TW] まもなく閉店

source: View on map
de: [DE] 地図で見る
es: Ver en el mapa
ja: 地図で見る
ko: [KO] 地図で見る
zh: [ZH] 地図で見る
zh_tw: [ZH_TW] 地図で見る

# getDirections
source: root
de: [DE] ルート
es: raíz
ja: ルート
ko: [KO] ルート
zh: [ZH] ルート
zh_tw: [ZH_TW] ルート

# call
source: phone
de: [DE] 電話
es: teléfono
ja: 電話
ko: [KO] 電話
zh: [ZH] 電話
zh_tw: [ZH_TW] 電話

source: Website
de: [DE] ウェブサイト
es: Sitio web
ja: ウェブサイト
ko: [KO] ウェブサイト
zh: [ZH] ウェブサイト
zh_tw: [ZH_TW] ウェブサイト

source: review
de: [DE] レビュー
es: revisar
ja: レビュー
ko: [KO] レビュー
zh: [ZH] レビュー
zh_tw: [ZH_TW] レビュー

# noReviews
source: No reviews yet. Be the first to write a review!
de: Noch keine Bewertungen Sei der Erste!
es: Aún no hay reseñas. ¡Sé el primero en escribir una!
ja: まだレビューがありません 最初のレビューを投稿してください！
ko: 리뷰가 아직 없습니다 첫 리뷰를 작성해주세요!
zh: 暂无评论 成为第一个评论者！
zh_tw: 暫無評論 成為第一個評論者！

# readMore
source: Show more
de: [DE] もっと見る
es: Mostrar más
ja: もっと見る
ko: [KO] もっと見る
zh: [ZH] もっと見る
zh_tw: [ZH_TW] もっと見る

# readLess
source: close
de: Schließen
es: cerca
ja: 閉じる
ko: 닫기
zh: 关闭
zh_tw: 關閉

# photos
source: photograph
de: [DE] 写真
es: fotografía
ja: 写真
ko: [KO] 写真
zh: [ZH] 写真
zh_tw: [ZH_TW] 写真

source: No photos
de: [DE] 写真がありません
es: Sin fotos
ja: 写真がありません
ko: [KO] 写真がありません
zh: [ZH] 写真がありません
zh_tw: [ZH_TW] 写真がありません

# addPhoto
source: Add a photo
de: 写真をHinzufügen
es: Añadir una foto
ja: 写真を追加
ko: 写真を추가
zh: 写真を添加
zh_tw: 写真を新增

# amenities
source: equipment
de: [DE] 設備
es: equipo
ja: 設備
ko: [KO] 設備
zh: [ZH] 設備
zh_tw: [ZH_TW] 設備

source: Equipment
de: Ausrüstung
es: Equipo
ja: 器具
ko: 기구
zh: 器械
zh_tw: 器械

# classes
source: class
de: [DE] クラス
es: clase
ja: クラス
ko: [KO] クラス
zh: [ZH] クラス
zh_tw: [ZH_TW] クラス

# trainers
source: trainer
de: [DE] トレーナー
es: entrenador
ja: トレーナー
ko: [KO] トレーナー
zh: [ZH] トレーナー
zh_tw: [ZH_TW] トレーナー

# membership
source: Membership Plan
de: [DE] 会員プラン
es: Plan de Membresía
ja: 会員プラン
ko: [KO] 会員プラン
zh: [ZH] 会員プラン
zh_tw: [ZH_TW] 会員プラン

# dayPass
source: one day ticket
de: 一Tag券
es: billete de un día
ja: 一日券
ko: 一일券
zh: [ZH] 一日券
zh_tw: [ZH_TW] 一日券

# monthlyPass
source: Monthly Plan
de: Monat額プラン
es: Plan mensual
ja: 月額プラン
ko: 월額プラン
zh: [ZH] 月額プラン
zh_tw: [ZH_TW] 月額プラン

# yearlyPass
source: Annual plan
de: Jahr間プラン
es: Plan anual
ja: 年間プラン
ko: 년間プラン
zh: [ZH] 年間プラン
zh_tw: [ZH_TW] 年間プラン

# hours
source: Opening hours
de: 営業Zeit
es: Horario de apertura
ja: 営業時間
ko: 営業시간
zh: 営業时间
zh_tw: [ZH_TW] 営業時間

# mon
source: month
de: Monat
es: mes
ja: 月
ko: 월
zh: 月
zh_tw: 月

# tue
source: fire
de: [DE] 火
es: fuego
ja: 火
ko: [KO] 火
zh: [ZH] 火
zh_tw: [ZH_TW] 火

# wed
source: water
de: [DE] 水
es: agua
ja: 水
ko: [KO] 水
zh: [ZH] 水
zh_tw: [ZH_TW] 水

# thu
source: tree
de: [DE] 木
es: árbol
ja: 木
ko: [KO] 木
zh: [ZH] 木
zh_tw: [ZH_TW] 木

# fri
source: gold
de: [DE] 金
es: oro
ja: 金
ko: [KO] 金
zh: [ZH] 金
zh_tw: [ZH_TW] 金

# sat
source: soil
de: [DE] 土
es: suelo
ja: 土
ko: [KO] 土
zh: [ZH] 土
zh_tw: [ZH_TW] 土

# sun
source: day
de: Tag
es: día
ja: 日
ko: 일
zh: 日
zh_tw: 日

source: Monday
de: Monat曜Tag
es: Lunes
ja: 月曜日
ko: 월曜일
zh: [ZH] 月曜日
zh_tw: [ZH_TW] 月曜日

source: Tuesday
de: 火曜Tag
es: Martes
ja: 火曜日
ko: 火曜일
zh: [ZH] 火曜日
zh_tw: [ZH_TW] 火曜日

source: Wednesday
de: 水曜Tag
es: Miércoles
ja: 水曜日
ko: 水曜일
zh: [ZH] 水曜日
zh_tw: [ZH_TW] 水曜日

source: Thursday
de: 木曜Tag
es: Jueves
ja: 木曜日
ko: 木曜일
zh: [ZH] 木曜日
zh_tw: [ZH_TW] 木曜日

source: Friday
de: 金曜Tag
es: Viernes
ja: 金曜日
ko: 金曜일
zh: [ZH] 金曜日
zh_tw: [ZH_TW] 金曜日

source: Saturday
de: 土曜Tag
es: Sábado
ja: 土曜日
ko: 土曜일
zh: [ZH] 土曜日
zh_tw: [ZH_TW] 土曜日

source: Sunday
de: Tag曜Tag
es: Domingo
ja: 日曜日
ko: 일曜일
zh: [ZH] 日曜日
zh_tw: [ZH_TW] 日曜日

# allDay
source: 24 hours
de: 24Zeit
es: 24 horas
ja: 24時間
ko: 24시간
zh: 24时间
zh_tw: [ZH_TW] 24時間

# reportIssue
source: Report a problem
de: [DE] 問題を報告
es: Informar un problema
ja: 問題を報告
ko: [KO] 問題を報告
zh: [ZH] 問題を報告
zh_tw: [ZH_TW] 問題を報告

# reportIncorrectInfo
source: The information is incorrect
de: Informationが間違っています
es: La información es incorrecta
ja: 情報が間違っています
ko: 정보が間違っています
zh: 信息が間違っています
zh_tw: 資訊が間違っています

# reportClosed
source: Closed
de: [DE] 閉業しました
es: Cerrado
ja: 閉業しました
ko: [KO] 閉業しました
zh: [ZH] 閉業しました
zh_tw: [ZH_TW] 閉業しました

# reportOther
source: others
de: [DE] その他
es: otros
ja: その他
ko: [KO] その他
zh: [ZH] その他
zh_tw: [ZH_TW] その他

source: thank you
de: Danke
es: gracias
ja: ありがとうございます
ko: 감사합니다
zh: 谢谢
zh_tw: 謝謝

# submitted
source: Sent
de: Sendenしました
es: Enviado
ja: 送信しました
ko: 전송しました
zh: 发送しました
zh_tw: 傳送しました

# submitting
source: Sending...
de: Senden中...
es: Envío...
ja: 送信中...
ko: 전송中...
zh: 发送中...
zh_tw: 傳送中...

# signInRequired
source: Login required
de: Anmeldenが必要です
es: Se requiere iniciar sesión
ja: ログインが必要です
ko: 로그인が必要です
zh: 登录が必要です
zh_tw: 登入が必要です

# signInToContinue
source: Please log in to continue
de: 続行するにはログインBitte
es: Por favor, inicia sesión para continuar
ja: 続行するにはログインしてください
ko: 続行するにはログイン해 주세요
zh: 続行するにはログイン请
zh_tw: 続行するにはログイン請

# signInWithEmail
source: Log in with your email address
de: E-Mail-AdresseでAnmelden
es: Inicie sesión con su dirección de correo electrónico
ja: メールアドレスでログイン
ko: 이메일 주소で로그인
zh: 电子邮件で登录
zh_tw: 電子郵件で登入

# signInWithGoogle
source: Log in with Google
de: GoogleでAnmelden
es: Iniciar sesión con Google
ja: Googleでログイン
ko: Googleで로그인
zh: Googleで登录
zh_tw: Googleで登入

# signInWithApple
source: Log in with Apple
de: AppleでAnmelden
es: Iniciar sesión con Apple
ja: Appleでログイン
ko: Appleで로그인
zh: Appleで登录
zh_tw: Appleで登入

# createAccount
source: Create an account
de: [DE] アカウントを作成
es: Crear una cuenta
ja: アカウントを作成
ko: [KO] アカウントを作成
zh: [ZH] アカウントを作成
zh_tw: [ZH_TW] アカウントを作成

source: email address
de: E-Mail-Adresse
es: dirección de correo electrónico
ja: メールアドレス
ko: 이메일 주소
zh: 电子邮件地址
zh_tw: 電子郵件地址

# enterEmail
source: Enter your email address
de: E-Mail-Adresseを入力
es: Introduzca su dirección de correo electrónico
ja: メールアドレスを入力
ko: 이메일 주소を入力
zh: 电子邮件を入力
zh_tw: 電子郵件を入力

# enterPassword
source: Enter your password
de: Passwortを入力
es: Ingrese su contraseña
ja: パスワードを入力
ko: 비밀번호を入力
zh: 密码を入力
zh_tw: 密碼を入力

# enterName
source: Enter your name
de: [DE] 名前を入力
es: Introduce tu nombre
ja: 名前を入力
ko: [KO] 名前を入力
zh: [ZH] 名前を入力
zh_tw: [ZH_TW] 名前を入力

source: Invalid password
de: UngültigなPasswort
es: Contraseña inválida
ja: 無効なパスワード
ko: 무효な비밀번호
zh: 无效な密码
zh_tw: 無效な密碼

source: Passwords do not match
de: Passwortが一致しません
es: Las contraseñas no coinciden
ja: パスワードが一致しません
ko: 비밀번호が一致しません
zh: 密码が一致しません
zh_tw: 密碼が一致しません

# signUpSuccess
source: Registration successful
de: RegistrierenがFertigしました
es: Registro exitoso
ja: 登録が完了しました
ko: 등록が완료しました
zh: 注册が完成しました
zh_tw: 註冊が完成しました

# signInSuccess
source: Logged in
de: Anmeldenしました
es: Iniciado sesión
ja: ログインしました
ko: 로그인しました
zh: 登录しました
zh_tw: 登入しました

# signOutSuccess
source: You have been logged out
de: [DE] ログアウトしました
es: Se ha cerrado la sesión
ja: ログアウトしました
ko: [KO] ログアウトしました
zh: [ZH] ログアウトしました
zh_tw: [ZH_TW] ログアウトしました

# verifyEmail
source: Confirm Email Address
de: メールアドレスをBestätigen
es: Confirmar el correo
ja: メールアドレスを確認
ko: メールアドレスを확인
zh: メールアドレスを确认
zh_tw: 電子郵件を確認

# verificationEmailSent
source: A confirmation email has been sent
de: BestätigenメールをSendenしました
es: Se ha enviado un correo electrónico de confirmación.
ja: 確認メールを送信しました
ko: 확인メールを전송しました
zh: 确认メールを发送しました
zh_tw: 確認メールを傳送しました

# resendVerificationEmail
source: Resend confirmation email
de: Bestätigenメールを再Senden
es: Reenviar correo electrónico de confirmación
ja: 確認メールを再送信
ko: 확인メールを再전송
zh: 确认メールを再发送
zh_tw: 確認メールを再傳送

# updateProfile
source: Update your profile
de: プロフィールをAktualisieren
es: Actualiza tu perfil
ja: プロフィールを更新
ko: プロフィールを업데이트
zh: [ZH] プロフィールを更新
zh_tw: [ZH_TW] プロフィールを更新

# updateProfileSuccess
source: I updated my profile
de: プロフィールをAktualisierenしました
es: Actualicé mi perfil
ja: プロフィールを更新しました
ko: プロフィールを업데이트しました
zh: [ZH] プロフィールを更新しました
zh_tw: [ZH_TW] プロフィールを更新しました

# updateProfileError
source: Profile update failed
de: プロフィールのAktualisierenにFehlgeschlagenしました
es: Error en la actualización del perfil
ja: プロフィールの更新に失敗しました
ko: プロフィールの업데이트に실패しました
zh: プロフィールの更新に失败しました
zh_tw: [ZH_TW] プロフィールの更新に失敗しました

# uploadPhoto
source: Upload a photo
de: [DE] 写真をアップロード
es: Subir una foto
ja: 写真をアップロード
ko: [KO] 写真をアップロード
zh: [ZH] 写真をアップロード
zh_tw: [ZH_TW] 写真をアップロード

# uploadPhotoSuccess
source: Photo uploaded
de: [DE] 写真をアップロードしました
es: Foto subida
ja: 写真をアップロードしました
ko: [KO] 写真をアップロードしました
zh: [ZH] 写真をアップロードしました
zh_tw: [ZH_TW] 写真をアップロードしました

# uploadPhotoError
source: Photo upload failed
de: 写真のアップロードにFehlgeschlagenしました
es: Error al cargar la foto
ja: 写真のアップロードに失敗しました
ko: 写真のアップロードに실패しました
zh: 写真のアップロードに失败しました
zh_tw: [ZH_TW] 写真のアップロードに失敗しました

# deleteConfirm
source: Confirm deletion
de: LöschenのBestätigen
es: Confirmar eliminación
ja: 削除の確認
ko: 삭제の확인
zh: 删除の确认
zh_tw: 刪除の確認

# deleteMessage
source: Are you sure you want to delete?
de: 本当にLöschenしますか？
es: ¿Estás seguro que deseas eliminar?
ja: 本当に削除しますか？
ko: 本当に삭제しますか？
zh: 本当に删除しますか？
zh_tw: 本当に刪除しますか？

# deleteSuccess
source: Deleted
de: Löschenしました
es: Eliminado
ja: 削除しました
ko: 삭제しました
zh: 删除しました
zh_tw: 刪除しました

# deleteError
source: Deletion failed
de: LöschenにFehlgeschlagenしました
es: La eliminación falló
ja: 削除に失敗しました
ko: 삭제に실패しました
zh: 删除に失败しました
zh_tw: 刪除に失敗しました

source: Save changes
de: ÄndernをSpeichern
es: Guardar cambios
ja: 変更を保存
ko: 변경を저장
zh: 更改を保存
zh_tw: 變更を儲存

source: Discard changes
de: Ändernを破棄
es: Descartar cambios
ja: 変更を破棄
ko: 변경を破棄
zh: 更改を破棄
zh_tw: 變更を破棄

# unsavedChanges
source: You have unsaved changes
de: SpeichernされていないÄndernがあります
es: Tienes cambios sin guardar
ja: 保存されていない変更があります
ko: 저장されていない변경があります
zh: 保存されていない更改があります
zh_tw: 儲存されていない變更があります

source: Premium
de: [DE] プレミアム
es: De primera calidad
ja: プレミアム
ko: [KO] プレミアム
zh: [ZH] プレミアム
zh_tw: [ZH_TW] プレミアム

# premiumFeatures
source: All Premium features
de: [DE] Premiumプランの全機能
es: Todas las funciones Premium
ja: Premiumプランの全機能
ko: [KO] Premiumプランの全機能
zh: [ZH] Premiumプランの全機能
zh_tw: [ZH_TW] Premiumプランの全機能

source: Upgrade to Premium
de: [DE] プレミアムにアップグレード
es: Actualizar a Premium
ja: プレミアムにアップグレード
ko: [KO] プレミアムにアップグレード
zh: [ZH] プレミアムにアップグレード
zh_tw: [ZH_TW] プレミアムにアップグレード

# startFreeTrial
source: Start your free trial
de: 無料トライアルをStart
es: Comience su prueba gratuita
ja: 無料トライアルを開始
ko: 無料トライアルを시작
zh: 無料トライアルを开始
zh_tw: [ZH_TW] 無料トライアルを開始

source: Subscribe
de: [DE] 購読
es: Suscribir
ja: 購読
ko: [KO] 購読
zh: [ZH] 購読
zh_tw: [ZH_TW] 購読

source: Unsubscribe
de: [DE] 購読解除
es: Darse de baja
ja: 購読解除
ko: [KO] 購読解除
zh: [ZH] 購読解除
zh_tw: [ZH_TW] 購読解除

source: Subscribed
de: [DE] 購読中
es: Suscrito
ja: 購読中
ko: [KO] 購読中
zh: [ZH] 購読中
zh_tw: [ZH_TW] 購読中

source: Subscription Status
de: [DE] 購読状況
es: Estado de suscripción
ja: 購読状況
ko: [KO] 購読状況
zh: [ZH] 購読状況
zh_tw: [ZH_TW] 購読状況

source: Monthly
de: Monatlich
es: Mensual
ja: 月額
ko: 월간
zh: 每月
zh_tw: 每月

# yearly
source: Annual fee
de: Jahr額
es: Cuota anual
ja: 年額
ko: 년額
zh: [ZH] 年額
zh_tw: [ZH_TW] 年額

# lifetime
source: eternal
de: [DE] 永久
es: para siempre
ja: 永久
ko: [KO] 永久
zh: [ZH] 永久
zh_tw: [ZH_TW] 永久

source: price
de: [DE] 価格
es: precio
ja: 価格
ko: [KO] 価格
zh: [ZH] 価格
zh_tw: [ZH_TW] 価格

source: total
de: Gesamt
ja: 合計
ko: 합계
zh: 总计
zh_tw: 總計

source: subtotal
de: [DE] 小計
es: total parcial
ja: 小計
ko: [KO] 小計
zh: [ZH] 小計
zh_tw: [ZH_TW] 小計

source: tax
de: [DE] 税
es: impuesto
ja: 税
ko: [KO] 税
zh: [ZH] 税
zh_tw: [ZH_TW] 税

source: discount
de: [DE] 割引
es: descuento
ja: 割引
ko: [KO] 割引
zh: [ZH] 割引
zh_tw: [ZH_TW] 割引

source: Payment Method
de: [DE] 支払い方法
es: Método de pago
ja: 支払い方法
ko: [KO] 支払い方法
zh: [ZH] 支払い方法
zh_tw: [ZH_TW] 支払い方法

# addPaymentMethod
source: Add a payment method
de: 支払い方法をHinzufügen
es: Agregar un método de pago
ja: 支払い方法を追加
ko: 支払い方法を추가
zh: 支払い方法を添加
zh_tw: 支払い方法を新增

source: Credit card
de: [DE] クレジットカード
es: Tarjeta de crédito
ja: クレジットカード
ko: [KO] クレジットカード
zh: [ZH] クレジットカード
zh_tw: [ZH_TW] クレジットカード

source: Debit Card
de: [DE] デビットカード
es: Tarjeta de débito
ja: デビットカード
ko: [KO] デビットカード
zh: [ZH] デビットカード
zh_tw: [ZH_TW] デビットカード

source: Card number
de: [DE] カード番号
es: Número de tarjeta
ja: カード番号
ko: [KO] カード番号
zh: [ZH] カード番号
zh_tw: [ZH_TW] カード番号

# expiryDate
source: date of expiry
de: Gültig期限
es: fecha de caducidad
ja: 有効期限
ko: 유효期限
zh: 有效期限
zh_tw: 有效期限

source: Billing Address
de: [DE] 請求先住所
es: Dirección de Envio
ja: 請求先住所
ko: [KO] 請求先住所
zh: [ZH] 請求先住所
zh_tw: [ZH_TW] 請求先住所

source: purchase
de: [DE] 購入
es: compra
ja: 購入
ko: [KO] 購入
zh: [ZH] 購入
zh_tw: [ZH_TW] 購入

# purchaseSuccess
source: Your purchase is complete
de: 購入がFertigしました
es: Tu compra está completa
ja: 購入が完了しました
ko: 購入が완료しました
zh: 購入が完成しました
zh_tw: 購入が完成しました

# purchaseError
source: Purchase failed
de: 購入にFehlgeschlagenしました
es: Compra fallida
ja: 購入に失敗しました
ko: 購入に실패しました
zh: 購入に失败しました
zh_tw: [ZH_TW] 購入に失敗しました

# purchaseCancelled
source: Purchase canceled
de: [DE] 購入がキャンセルされました
es: Compra cancelada
ja: 購入がキャンセルされました
ko: [KO] 購入がキャンセルされました
zh: [ZH] 購入がキャンセルされました
zh_tw: [ZH_TW] 購入がキャンセルされました

source: Restore
de: [DE] 復元
es: Restaurar
ja: 復元
ko: [KO] 復元
zh: [ZH] 復元
zh_tw: [ZH_TW] 復元

source: Restore Purchases
de: [DE] 購入を復元
es: Restaurar compras
ja: 購入を復元
ko: [KO] 購入を復元
zh: [ZH] 購入を復元
zh_tw: [ZH_TW] 購入を復元

# restoreSuccess
source: Restored
de: [DE] 復元しました
es: Restaurado
ja: 復元しました
ko: [KO] 復元しました
zh: [ZH] 復元しました
zh_tw: [ZH_TW] 復元しました

# restoreError
source: Restore failed
de: 復元にFehlgeschlagenしました
es: La restauración falló
ja: 復元に失敗しました
ko: 復元に실패しました
zh: 復元に失败しました
zh_tw: [ZH_TW] 復元に失敗しました

source: No purchases to restore
de: [DE] 復元する購入がありません
es: No hay compras para restaurar
ja: 復元する購入がありません
ko: [KO] 復元する購入がありません
zh: [ZH] 復元する購入がありません
zh_tw: [ZH_TW] 復元する購入がありません

source: favorite
de: Favorit
es: favorito
ja: お気に入り
ko: 즐겨찾기
zh: 收藏
zh_tw: 收藏

source: Added to favorites
de: Zu Favoriten hinzugefügt
es: Añadido a favoritos
ja: お気に入りに追加しました
ko: 즐겨찾기에 추가됨
zh: 已添加到收藏
zh_tw: 已新增至收藏

source: Removed from favorites
de: Aus Favoriten entfernt
es: Eliminado de favoritos
ja: お気に入りから削除しました
ko: 즐겨찾기에서 제거됨
zh: 已从收藏移除
zh_tw: 已從收藏移除

# alreadyFavorite
source: Already added to favorites
de: お気に入りRegistrieren済み
es: Ya añadido a favoritos
ja: お気に入り登録済み
ko: お気に入り등록済み
zh: お気に入り注册済み
zh_tw: お気に入り註冊済み

source: check-in
es: registrarse
ja: チェックイン
ko: 체크인
zh: 签到
zh_tw: 簽到

source: Check-out
es: Verificar
ja: チェックアウト
ko: 체크아웃
zh: 签退
zh_tw: 簽退

source: Checked in!
de: Eingecheckt!
es: ¡Registrado!
ja: チェックインしました！
ko: 체크인 완료!
zh: 签到成功！
zh_tw: 簽到成功！

source: Checked out
de: [DE] チェックアウトしました
es: Revisado
ja: チェックアウトしました
ko: [KO] チェックアウトしました
zh: [ZH] チェックアウトしました
zh_tw: [ZH_TW] チェックアウトしました

source: Check-in failed
de: チェックインにFehlgeschlagenしました
es: El check-in falló
ja: チェックインに失敗しました
ko: チェックインに실패しました
zh: チェックインに失败しました
zh_tw: 簽到に失敗しました

# checkInAt
source: Checked in to {gymName}
de: {gymName}にEincheckenしました
es: Se registró en {gymName}
ja: {gymName}にチェックインしました
ko: {gymName}に체크인しました
zh: {gymName}に签到しました
zh_tw: {gymName}に簽到しました

# shareGym
source: Share this gym
de: このジムをTeilen
es: Comparte este gimnasio
ja: このジムをシェア
ko: 이 체육관 공유
zh: このジムを分享
zh_tw: このジムを分享

source: Shared!
de: Teilenしました！
es: ¡Compartido!
ja: シェアしました！
ko: 공유 완료!
zh: 分享しました！
zh_tw: 分享しました！

source: Route guidance
de: [DE] ルート案内
es: Guía de ruta
ja: ルート案内
ko: 길 안내
zh: [ZH] ルート案内
zh_tw: [ZH_TW] ルート案内

# couldNotOpenMap
source: Could not open Google Maps
de: [DE] Googleマップを開けませんでした
es: No se pudo abrir Google Maps
ja: Googleマップを開けませんでした
ko: [KO] Googleマップを開けませんでした
zh: [ZH] Googleマップを開けませんでした
zh_tw: [ZH_TW] Googleマップを開けませんでした

# postReview
source: Write a review
de: Bewertung abgeben
es: Escribe una reseña
ja: レビューを投稿
ko: 리뷰 작성
zh: 发表评论
zh_tw: 發表評論

# loadReviewsFailed
source: Reviews failed to load
de: レビューの読み込みにFehlgeschlagenしました
es: Las reseñas no se pudieron cargar
ja: レビューの読み込みに失敗しました
ko: レビューの読み込みに실패しました
zh: レビューの読み込みに失败しました
zh_tw: [ZH_TW] レビューの読み込みに失敗しました

# viewAll
source: See All
de: Alle anzeigen
es: Ver todo
ja: すべて見る
ko: 모두 보기
zh: 查看全部
zh_tw: 查看全部

# noCrowdData
source: There is no congestion information yet
de: まだ混雑度Informationがありません
es: Aún no hay información de congestión
ja: まだ混雑度情報がありません
ko: 혼잡도 정보가 없습니다
zh: まだ混雑度信息がありません
zh_tw: まだ混雑度資訊がありません

# googleStats
source: Google statistics
de: [DE] Google統計
es: Estadísticas de Google
ja: Google統計
ko: [KO] Google統計
zh: [ZH] Google統計
zh_tw: [ZH_TW] Google統計

source: User Report
de: [DE] ユーザー報告
es: Informe de usuario
ja: ユーザー報告
ko: [KO] ユーザー報告
zh: [ZH] ユーザー報告
zh_tw: [ZH_TW] ユーザー報告

# ownerProvided
source: Provided by the owner
de: [DE] オーナー提供
es: Proporcionado por el propietario
ja: オーナー提供
ko: [KO] オーナー提供
zh: [ZH] オーナー提供
zh_tw: [ZH_TW] オーナー提供

# announcement
source: notice
de: [DE] お知らせ
es: aviso
ja: お知らせ
ko: 공지사항
zh: [ZH] お知らせ
zh_tw: [ZH_TW] お知らせ

source: Partner Gym
de: [DE] パートナージム
es: Gimnasio asociado
ja: パートナージム
ko: [KO] パートナージム
zh: [ZH] パートナージム
zh_tw: [ZH_TW] パートナージム

# visitorWelcome
source: Visitors allowed
de: [DE] ビジター可
es: Se permiten visitantes
ja: ビジター可
ko: 방문객 환영
zh: [ZH] ビジター可
zh_tw: [ZH_TW] ビジター可

# visitorBooking
source: Visitor reservation application
de: [DE] ビジター予約申込
es: Solicitud de reserva de visitantes
ja: ビジター予約申込
ko: [KO] ビジター予約申込
zh: [ZH] ビジター予約申込
zh_tw: [ZH_TW] ビジター予約申込

# couponCode
source: Coupon code: {code}
de: [DE] クーポンコード: {code}
es: Código de cupón: {code}
ja: クーポンコード: {code}
ko: [KO] クーポンコード: {code}
zh: [ZH] クーポンコード: {code}
zh_tw: [ZH_TW] クーポンコード: {code}

# validUntil
source: Until {date}
de: [DE] {date}まで
es: Hasta {date}
ja: {date}まで
ko: [KO] {date}まで
zh: [ZH] {date}まで
zh_tw: [ZH_TW] {date}まで

# moderatelyCrowded
source: Somewhat crowded
de: [DE] やや混雑
es: Un poco lleno de gente
ja: やや混雑
ko: [KO] やや混雑
zh: [ZH] やや混雑
zh_tw: [ZH_TW] やや混雑

# moderatelyEmpty
source: Somewhat empty
de: [DE] やや空き
es: Un poco vacío
ja: やや空き
ko: [KO] やや空き
zh: [ZH] やや空き
zh_tw: [ZH_TW] やや空き

# updatedMinutesAgo
source: Updated {minutes} minutes ago
de: {minutes}Minute前Aktualisieren
es: Actualizado hace {minutes} minutos
ja: {minutes}分前更新
ko: {minutes}분前업데이트
zh: [ZH] {minutes}分前更新
zh_tw: [ZH_TW] {minutes}分前更新

# equipmentCount
source: {name} × {count} units
de: [DE] {name} × {count}台
es: {name} × {count} unidades
ja: {name} × {count}台
ko: [KO] {name} × {count}台
zh: [ZH] {name} × {count}台
zh_tw: [ZH_TW] {name} × {count}台

# ratingWithCount
source: {rating} ({count})
de: [DE] {rating} ({count}件)
ja: {rating} ({count}件)
ko: [KO] {rating} ({count}件)
zh: [ZH] {rating} ({count}件)
zh_tw: [ZH_TW] {rating} ({count}件)

source: Change plan
de: プランÄndern
es: Cambiar plan
ja: プラン変更
ko: プラン변경
zh: プラン更改
zh_tw: プラン變更

source: Cancel subscription
de: [DE] サブスクリプションをキャンセル
es: Cancelar suscripción
ja: サブスクリプションをキャンセル
ko: [KO] サブスクリプションをキャンセル
zh: [ZH] サブスクリプションをキャンセル
zh_tw: [ZH_TW] サブスクリプションをキャンセル
