Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# workout_ドロップダウンフィールド_Widget_buildDropdownField_required_St
source: ), ), ], ), ); } } /// dropdown field Widget _buildDropdownField({ required String label, required String value, required List<String> items, required ValueChanged<String?> onChanged, }) { return DropdownButtonFormField<String>( decoration: InputDecoration( labelText: label, border: const OutlineInputBorder(), ), value: value, items: items.map((item) { return DropdownMenuItem( value: item, child: Text(item), ); }).toList(), onChanged: onChanged, ); } /// slider field Widget _buildSliderField({ required String label, required double value, required double min, required double max, required int divisions, required ValueChanged<double> onChanged, required String displayValue, }) { return Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Row( mainAxisAlignment: MainAxisAlignment.spaceBetween, children: [ Text(label, style: const TextStyle(fontWeight: FontWeight.w500)), Text( displayValue, style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, color: Colors.orange.shade700, ), ), ], ), Slider( value: value, min: min, max: max, divisions: divisions, onChanged: onChanged, activeColor: Colors.orange.shade700, ), ], ); } /// Analysis execution button Widget _buildAnalyzeButton() { return ElevatedButton.icon( onPressed: _isLoading ? null : () { FocusScope.of(context).unfocus(); _executeAnalysis(); }, icon: _isLoading ? const SizedBox( width: 20, height: 20, child: CircularProgressIndicator( strokeWidth: 2, valueColor: AlwaysStoppedAnimation<Color>(Colors.white), ), ) : Icon(Icons.auto_graph), label: Text(_isLoading ? AppLocalizations.of(context)!.aiAnalyzing :
es: ), ), ], ), ); } } /// Campo desplegable Widget _buildDropdownField({ String requerido: etiqueta, String requerido: valor, List<String> requerido: elementos, ValueChanged<String?> requerido: onChanged, }) { return DropdownButtonFormField<String>( decoration: InputDecoration( labelText: etiqueta, border: const OutlineInputBorder(), ), value: valor, items: items.map((item) { return DropdownMenuItem( value: elemento, child: Text(item), ); }).toList(), onChanged: onChanged, ); } /// Campo deslizante Widget _buildSliderField({ String requerido: etiqueta, double requerido: valor, double requerido: mínimo, double requerido: máximo, int requerido: divisiones, ValueChanged<double> requerido: onChanged, String requerido: valor de visualización, }) { return Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Row( mainAxisAlignment: MainAxisAlignment.spaceBetween, children: [ Text(label, style: const TextStyle(fontWeight: FontWeight.w500)), Text( displayValue, style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, color: Colors.orange.shade700, ), ), ], ), Slider( value: valor, min: min, max: max, divisiones: divisiones, onChanged: onChanged, activeColor: Colors.orange.shade700, ), ], ); } /// Botón de ejecución de análisis Widget _buildAnalyzeButton() { return ElevatedButton.icon( onPressed: _isLoading ? null : () { FocusScope.of(context).unfocus(); _executeAnalysis(); }, icon: _isLoading ? const SizedBox( width: 20, high: 20, child: CircularProgressIndicator( strokeWidth: 2, valueColor: AlwaysStoppedAnimation<Color>(Colors.white), ), ) : Icon(Icons.auto_graph), etiqueta: Text(_isLoading ? AppLocalizations.of(context)!.aiAnalyzing :
ja: ), ), ], ), ); } } /// ドロップダウンフィールド Widget _buildDropdownField({ required String label, required String value, required List<String> items, required ValueChanged<String?> onChanged, }) { return DropdownButtonFormField<String>( decoration: InputDecoration( labelText: label, border: const OutlineInputBorder(), ), value: value, items: items.map((item) { return DropdownMenuItem( value: item, child: Text(item), ); }).toList(), onChanged: onChanged, ); } /// スライダーフィールド Widget _buildSliderField({ required String label, required double value, required double min, required double max, required int divisions, required ValueChanged<double> onChanged, required String displayValue, }) { return Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Row( mainAxisAlignment: MainAxisAlignment.spaceBetween, children: [ Text(label, style: const TextStyle(fontWeight: FontWeight.w500)), Text( displayValue, style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, color: Colors.orange.shade700, ), ), ], ), Slider( value: value, min: min, max: max, divisions: divisions, onChanged: onChanged, activeColor: Colors.orange.shade700, ), ], ); } /// 分析実行ボタン Widget _buildAnalyzeButton() { return ElevatedButton.icon( onPressed: _isLoading ? null : () { FocusScope.of(context).unfocus(); _executeAnalysis(); }, icon: _isLoading ? const SizedBox( width: 20, height: 20, child: CircularProgressIndicator( strokeWidth: 2, valueColor: AlwaysStoppedAnimation<Color>(Colors.white), ), ) : Icon(Icons.auto_graph), label: Text(_isLoading ? AppLocalizations.of(context)!.aiAnalyzing :

# general_オフ日を取得中
source: 📅 Getting a day off...
es: 📅Tomándome un día libre...
ja: 📅 オフ日を取得中...

# personalFactor_推奨更新頻度
source: 🎯 Recommended update frequency
es: 🎯 Frecuencia de actualización recomendada
ja: 🎯 推奨更新頻度

# gym_ユーザー
source: user
es: usuario
ja: ユーザー

# general_福島
source: Fukushima
ja: 福島

# workout_を重点的に鍛えたい方_提案形式_必ずこの形式で出力してください_部位トレーニングメニュー_種目1種目
source: For those who want to focus on training the lower extremities. [Proposal Format] **Please be sure to output in this format:** ``` ## Body Part Training Menu **Exercise 1: Exercise Name** * Weight: XX kg * Reps: XX * Sets: X * Rest Time: XX seconds * Form Points: Explanation **Exercise 2: Exercise Name** * Weight: XX kg * Reps: XX * Sets: X ``` Please include the following information for each exercise: - Exercise Name (Select from the Exercise Database) - **Specific Weight (kg)** ← Refer to your training history if available; if not, use the recommended weight for beginners. *For aerobic exercise, enter "Weight: 0 kg" and "Time: XX minutes" instead of reps. - **Reps (10-15)** ← For aerobic exercise, enter "Time: 20-30 minutes." - Number of Sets (2-3 sets) ← For aerobic exercise, enter "1 set." - Break time (90-120 seconds) - Form points [Conditions] - ${targetParts.join(
es: Para quienes desean enfocarse en el entrenamiento de las extremidades inferiores. [Formato de propuesta] **Asegúrese de incluir la propuesta en este formato:** ``` ## Menú de entrenamiento de partes del cuerpo **Ejercicio 1: Nombre del ejercicio** * Peso: XX kg * Repeticiones: XX * Series: X * Tiempo de descanso: XX segundos * Puntos de forma: Explicación **Ejercicio 2: Nombre del ejercicio** * Peso: XX kg * Repeticiones: XX * Series: X ``` Incluya la siguiente información para cada ejercicio: - Nombre del ejercicio (seleccione de la base de datos de ejercicios) - **Peso específico (kg)** ← Consulte su historial de entrenamiento si lo tiene; de lo contrario, utilice el peso recomendado para principiantes. *Para ejercicios aeróbicos, ingrese "Peso: 0 kg" y "Tiempo: XX minutos" en lugar de repeticiones. - **Repeticiones (10-15)** ← Para ejercicio aeróbico, introduzca "Tiempo: 20-30 minutos". - Número de series (2-3 series) ← Para ejercicio aeróbico, introduzca "1 serie". - Tiempo de descanso (90-120 segundos) - Puntos de forma [Condiciones] - ${targetParts.join(
ja: )}を重点的に鍛えたい方 【提案形式】 **必ずこの形式で出力してください：** ``` ## 部位トレーニングメニュー **種目1：種目名** * 重量：XXkg * 回数：XX回 * セット数：Xセット * 休憩時間：XX秒 * フォームのポイント：説明文 **種目2：種目名** * 重量：XXkg * 回数：XX回 * セット数：Xセット ``` 各種目について以下の情報を含めてください： - 種目名（種目データベースから選択） - **具体的な重量（kg）** ← 履歴があればそれを参考に、なければ初心者向けの推奨重量 ※有酸素運動の場合は「重量：0kg」とし、回数の代わりに「時間：XX分」を記載 - **回数（10-15回）** ← 有酸素の場合は「時間：20-30分」 - セット数（2-3セット）← 有酸素の場合は「1セット」 - 休憩時間（90-120秒） - フォームのポイント 【条件】 - ${targetParts.join(

# general_目標重量を入力するとバーベルの片側に必要なプレートの
source: Enter your target weight and we'll calculate the number of plates needed on each side of the barbell.
es: Ingrese su peso objetivo y calcularemos la cantidad de discos necesarios en cada lado de la barra.
ja: 目標重量を入力すると、バーベルの片側に必要なプレートの

# gym_グループスタジオ
source: Group Studio
es: Estudio grupal
ja: グループスタジオ

# error_対象ユーザープラン取得エラー_e
source: ⚠️ Error getting target user plan: $e
es: ⚠️ Error al obtener el plan del usuario objetivo: $e
ja: ⚠️ 対象ユーザープラン取得エラー: $e

# general_totalReferrals人招待済み
source: $_totalReferrals invited
es: $_totalReferrals invitados
ja: $_totalReferrals人招待済み

# workout_7日
source: 7th
es: 7º
ja: 7日

# workout_Phase_7_ユーザーIDが取得できません未ログイン
source: ⚠️ [Phase 7] Unable to obtain user ID (not logged in)
es: ⚠️ [Fase 7] No se puede obtener el ID de usuario (no se ha iniciado sesión)
ja: ⚠️ [Phase 7] ユーザーIDが取得できません（未ログイン）

# general_300万円月以上
source: 3 million yen/month or more
es: 3 millones de yenes al mes o más
ja: 300万円/月以上

# subscription_AI機能月20回AIコーチ成長予測効果分析_お気に入り無制限_レビュー投稿
source: AI features 20 times per month (AI coaching, growth prediction, effectiveness analysis) + unlimited favorites + review submission
es: Funciones de IA 20 veces al mes (coaching de IA, predicción de crecimiento, análisis de efectividad) + favoritos ilimitados + envío de reseñas
ja: AI機能月20回（AIコーチ・成長予測・効果分析） + お気に入り無制限 + レビュー投稿

# gym_メガロス_目黒
source: Megalos Meguro
ja: メガロス 目黒

# general_activeCount名
source: $activeCount name
es: $activeCount nombre
ja: $activeCount名

# general_0_100万円月
source: 0 - 1 million yen/month
es: 0 - 1 millón de yenes al mes
ja: 0 - 100万円/月

# profile_ボディメイク
source: Body makeup
es: Maquillaje corporal
ja: ボディメイク

# workout_記録を反映しました_weight_kg_reps_reps
source: Recorded: $weight kg × $reps reps
es: Registrado: $peso kg × $reps repeticiones
ja: 記録を反映しました: $weight kg × $reps reps

# workout_ポイント_フォーム重視軽い重量から
source: - Tips: Focus on form and start with light weights.
es: Consejos: Concéntrese en la forma y comience con pesas ligeras.
ja: - ポイント: フォーム重視、軽い重量から

# subscription_subscriptionServicegetPlanNamenewPlanに変更します
source: Change it to ${_subscriptionService.getPlanName(newPlan)}.
es: Cámbielo a ${_subscriptionService.getPlanName(newPlan)}.
ja: ${_subscriptionService.getPlanName(newPlan)}に変更します。

# subscription_開始日_premiumStartDatetoDate
source: Start date: ${premiumStartDate.toDate()}
es: Fecha de inicio: ${premiumStartDate.toDate()}
ja: 開始日: ${premiumStartDate.toDate()}

# general_週weeklyGrowthtoStringAsFixed1素晴らしい成長ペース
source: Weekly +${weeklyGrowth.toStringAsFixed(1)}%: Great growth rate!
es: Semanal +${weeklyGrowth.toStringAsFixed(1)}%: ¡Gran tasa de crecimiento!
ja: 週+${weeklyGrowth.toStringAsFixed(1)}%：素晴らしい成長ペース！

# subscription_営業時間確認
source: Check business hours
es: Consultar horario comercial
ja: 営業時間確認

# profile_ファイルの読み込みに失敗しました
source: Failed to load file
es: No se pudo cargar el archivo
ja: ファイルの読み込みに失敗しました

# workout_WorkoutLogScreen_自動ログイン失敗_e
source: ❌ [WorkoutLogScreen] Auto-login failed: $e
es: ❌ [WorkoutLogScreen] Error de inicio de sesión automático: $e
ja: ❌ [WorkoutLogScreen] 自動ログイン失敗: $e

# gym_台数
source: Number of units
es: Número de unidades
ja: 台数

# error_オフラインサービス初期化エラー_e
source: ❌ Offline service initialization error: $e
es: ❌ Error de inicialización del servicio sin conexión: $e
ja: ❌ オフラインサービス初期化エラー: $e

# general_連続で行う2種目
source: Two consecutive events
es: Dos eventos consecutivos
ja: 連続で行う2種目

# general_機械的張力の最大化
source: Maximizing mechanical tension
es: Maximizar la tensión mecánica
ja: 機械的張力の最大化

# gym_有効期限_formatDateannouncementvalidUntil
source: Expiration Date: ${_formatDate(announcement.validUntil!)}
es: Fecha de vencimiento: ${_formatDate(announcement.validUntil!)}
ja: 有効期限: ${_formatDate(announcement.validUntil!)}

# gym_詳細な混雑度統計
source: • Detailed congestion statistics
es: • Estadísticas detalladas de congestión
ja: • 詳細な混雑度統計

# general_パートナー検索_currentUserPlantoStringsplit
source: 🔍 Partner search: ${currentUserPlan.toString().split(
es: 🔍 Búsqueda de socios: ${currentUserPlan.toString().split(
ja: 🔍 パートナー検索: ${currentUserPlan.toString().split(

# gym_本格フリーウェイト
source: Authentic free weights
es: Pesas libres auténticas
ja: 本格フリーウェイト

# general_最優先改善ポイント
source: ## Top priority improvement points
es: ## Puntos de mejora prioritarios
ja: ## 最優先改善ポイント

# general_widgetpartnerdisplayNameさんをブロックしますか
source: Do you want to block ${widget.partner.displayName}?
es: ¿Quieres bloquear ${widget.partner.displayName}?
ja: ${widget.partner.displayName}さんをブロックしますか？

# general_空セットのクリーンアップ開始
source: 🧹 Empty set cleanup begins...
es: 🧹 Comienza la limpieza del set vacío...
ja: 🧹 空セットのクリーンアップ開始...

# profile_解約後も現在の請求期間終了まではサービスをご利用いただけます
source: • Even after cancellation, you can continue to use the service until the end of your current billing period.
es: • Incluso después de la cancelación, podrá seguir utilizando el servicio hasta el final de su período de facturación actual.
ja: • 解約後も、現在の請求期間終了まではサービスをご利用いただけます

# general_自分に友達申請はできません
source: You cannot send a friend request to yourself
es: No puedes enviarte una solicitud de amistad a ti mismo
ja: 自分に友達申請はできません

# profile_解約は次回更新日の24時間前までに行ってください
source: • Cancellation must be made at least 24 hours before your next renewal date.
es: • La cancelación debe realizarse al menos 24 horas antes de la próxima fecha de renovación.
ja: • 解約は次回更新日の24時間前までに行ってください

# general_友達を招待してAI5回分ゲット
source: 🎁 Invite your friends and get 5 AIs!
es: 🎁 ¡Invita a tus amigos y consigue 5 IA!
ja: 🎁 友達を招待してAI5回分ゲット！

# workout_ユーザーID_useruid
source: 🔍 User ID: ${user.uid}
es: 🔍 ID de usuario: ${user.uid}
ja: 🔍 ユーザーID: ${user.uid}

# subscription_特別プレゼント
source: Special Gift
es: Regalo especial
ja: 特別プレゼント

# profile_Apple_App_Storeの返金ポリシーに基づく正当な理由がある場合
source: • If there is a valid reason under the Apple App Store refund policy.
es: • Si existe una razón válida según la política de reembolso de la App Store de Apple.
ja: • Apple App Storeの返金ポリシーに基づく正当な理由がある場合

# general_静岡
source: Shizuoka
ja: 静岡

# error_達成日時取得エラー_e
source: ❌ Error getting achievement date: $e
es: ❌ Error al obtener la fecha del logro: $e
ja: ❌ 達成日時取得エラー: $e

# general_PRコレクター
source: PR Collector
es: Coleccionista de relaciones públicas
ja: PRコレクター

# general_続ける
source: continue!
es: ¡continuar!
ja: 続ける！

# general_特典はすぐに反映されます
source: The rewards will be reflected immediately!
es: ¡Las recompensas se reflejarán inmediatamente!
ja: 特典はすぐに反映されます！

# general_初回ボーナスAI消費_残りawait_getFirstTimeBonusAiCredits回
source: ✅ First Time Bonus AI Consumption: ${await getFirstTimeBonusAiCredits()} remaining
es: ✅ Consumo de IA de bonificación por primera vez: ${await getFirstTimeBonusAiCredits()} restantes
ja: ✅ 初回ボーナスAI消費: 残り${await getFirstTimeBonusAiCredits()}回

# general_今週から_volumeAnalysis
source: * Starting this week: ${volumeAnalysis[
es: * A partir de esta semana: ${volumeAnalysis[
ja: * 今週から: ${volumeAnalysis[

# general_担当_membertrainerName
source: Contact: ${member.trainerName}
es: Contacto: ${member.trainerName}
ja: 担当: ${member.trainerName}

# general_セット削除完了_残りセット数_setslength
source: ✅ Sets deleted - Remaining sets: ${sets.length}
es: ✅ Conjuntos eliminados - Conjuntos restantes: ${sets.length}
ja: ✅ セット削除完了 - 残りセット数: ${sets.length}

# error_プロフィール保存エラー_e
source: Error saving profile: $e
es: Error al guardar el perfil: $e
ja: プロフィール保存エラー: $e

# general_解除_DateFormat
source: Cancellation: ${DateFormat(
es: Cancelación: ${DateFormat(
ja: 解除: ${DateFormat(

# error_バッジの読み込みに失敗しました_e
source: Badge load failed: $e
es: Error en la carga de la insignia: $e
ja: バッジの読み込みに失敗しました: $e

# error_クイックスタート作成エラー_e
source: ❌ Quickstart creation error: $e
es: ❌ Error de creación de inicio rápido: $e
ja: ❌ クイックスタート作成エラー: $e

# workout_部位と種目を選択してください
source: Please select the location and type
es: Por favor seleccione la ubicación y el tipo
ja: 部位と種目を選択してください

# general_まだログがありません
source: No logs yet
es: Aún no hay registros
ja: まだログがありません

# general_アクセスコード認証開始
source: 🔑 Access code authentication started...
es: 🔑 Se inició la autenticación del código de acceso...
ja: 🔑 アクセスコード認証開始...

# general_0月
source: \$0/month
es: $0/mes
ja: \$0/月

# general_トレーニング頻度_frequencyAnalysis
source: * Training frequency: ${frequencyAnalysis[
es: * Frecuencia de entrenamiento: ${frequencyAnalysis[
ja: * トレーニング頻度: ${frequencyAnalysis[

# general_疲労度とアドバイスを表示します
source: Displays fatigue level and advice.
es: Muestra el nivel de fatiga y ofrece consejos.
ja: 疲労度とアドバイスを表示します。

# gym_お気に入り無制限
source: • Unlimited favorites
es: • Favoritos ilimitados
ja: • お気に入り無制限

# general_利用可能な商品一覧
source: 📦 Available Products:
es: 📦 Productos Disponibles:
ja: 📦 利用可能な商品一覧:

# workout_メニュー生成成功_parsedExerciseslength種目抽出
source: ✅ Menu generation successful: ${parsedExercises.length} exercises extracted
es: ✅ Generación de menú exitosa: ${parsedExercises.length} ejercicios extraídos
ja: ✅ メニュー生成成功: ${parsedExercises.length}種目抽出

# workout_templatenameを削除しますか
source: Do you want to delete "${template.name}"?
es: ¿Quieres eliminar "${template.name}"?
ja: 「${template.name}」を削除しますか？

# general_フェーズ3_フルAPI導入コスト850月
source: Phase 3: Full API implementation (cost: $850/month)
es: Fase 3: Implementación completa de API (costo: $850/mes)
ja: フェーズ3: フルAPI導入（コスト\$850/月）

# general_種目重量回数を入力するだけ_カレンダーで成長を可視化
source: Just enter the exercise, weight, and number of repetitions! Visualize your progress with the calendar
es: ¡Solo tienes que introducir el ejercicio, el peso y el número de repeticiones! Visualiza tu progreso con el calendario.
ja: 種目・重量・回数を入力するだけ！ カレンダーで成長を可視化

# general_警戒ゾーンです_怪我のリスクがやや高まっています回復を優先し次回は負荷を少し下げましょう
source: This is a warning zone. Your risk of injury is slightly increased. Prioritize recovery and reduce the load a little next time.
es: Esta es una zona de advertencia. El riesgo de lesión es ligeramente mayor. Prioriza la recuperación y reduce un poco la carga la próxima vez.
ja: 警戒ゾーンです。 怪我のリスクがやや高まっています。回復を優先し、次回は負荷を少し下げましょう。

# subscription_ユーザーが未ログイン_Firestore保存スキップ
source: ⚠️ User not logged in - Firestore save skipped
es: ⚠️ El usuario no inició sesión: se omitió el guardado de Firestore
ja: ⚠️ ユーザーが未ログイン - Firestore保存スキップ

# gym_料金詳細情報
source: Prices and details
es: Precios y detalles
ja: 料金・詳細情報

# general_広告キャンペーン管理
source: Advertising and Campaign Management
es: Gestión de campañas y publicidad
ja: 広告・キャンペーン管理

# subscription_トライアル条件達成自動的にプレミアム7日間トライアル開始
source: 🎉 Trial conditions met! 7-day Premium trial starts automatically
es: ¡Condiciones de prueba cumplidas! La prueba Premium de 7 días comienza automáticamente.
ja: 🎉 トライアル条件達成！自動的にプレミアム7日間トライアル開始

# general_月額コスト
source: Monthly cost
es: Costo mensual
ja: 月額コスト

# general_おめでとうございます_7日間連続でトレーニングを記録しました_この調子で続けましょう
source: Congratulations! You've logged 7 days of training in a row. Keep it up! 💪
es: ¡Felicidades! Has acumulado 7 días seguidos de entrenamiento. ¡Sigue así! 💪
ja: おめでとうございます！ 7日間連続でトレーニングを記録しました。 この調子で続けましょう！💪

# general_購入開始_productId
source: 🛒 Purchase Start: $productId
es: 🛒 Inicio de compra: $productId
ja: 🛒 購入開始: $productId

# workout_weightkg_reps回
source: ${weight}kg × ${reps}
es: ${peso}kg × ${repeticiones}
ja: ${weight}kg × ${reps}回

# bodyPart_PPL_Push_Day胸肩三頭
source: PPL - Push Day (chest/shoulders/tricos)
es: PPL - Día de empuje (pecho/hombros/tricos)
ja: PPL - Push Day（胸・肩・三頭）

# gym_店舗に直接予約申込ができます
source: You can make a reservation directly at the store
es: Puedes hacer una reserva directamente en la tienda.
ja: 店舗に直接予約申込ができます

# workout_を重点的にトレーニング_基本種目中心マシンとフリーウェイト組み合わせ_3045分で完了_怪我のリスク
source: )} - Focused on basic exercises (combination of machines and free weights) - Complete in 30-45 minutes - Exercises with low risk of injury - Emphasis on mastering form - Detailed explanations in Japanese Safe for beginners
es: )} - Centrado en ejercicios básicos (combinación de máquinas y pesas libres) - Duración: 30-45 minutos - Ejercicios con bajo riesgo de lesiones - Énfasis en el dominio de la técnica - Explicaciones detalladas en japonés Seguro para principiantes
ja: )}を重点的にトレーニング - 基本種目中心（マシンとフリーウェイト組み合わせ） - 30-45分で完了 - 怪我のリスクが少ない種目 - フォーム習得を重視 - 日本語で丁寧に説明 初心者が安全に取り組める${targetParts.join(

# general_AI予測で女性の上半身成長率を高く設定
source: AI predictions set higher upper body growth rates for women
es: Las predicciones de IA establecen tasas de crecimiento más altas de la parte superior del cuerpo para las mujeres
ja: AI予測で女性の上半身成長率を高く設定

# general_新規ユーザーとして匿名ログイン中
source: Logging in anonymously as a new user...
es: Iniciar sesión anónimamente como nuevo usuario...
ja: 新規ユーザーとして匿名ログイン中...

# general_胸トレ初心者
source: Chest training beginner
es: Entrenamiento de pecho para principiantes
ja: 胸トレ初心者

# error_アップロード失敗_e
source: ❌ Upload failed: $e
es: ❌ Error en la carga: $e
ja: ❌ アップロード失敗: $e

# general_新しい目標
source: New Goals
es: Nuevas metas
ja: 新しい目標

# general_疲労リスク週suggestedChangeセット削減推奨
source: Fatigue risk: Recommended reduction of ${-suggestedChange} sets per week
es: Riesgo de fatiga: Reducción recomendada de ${-suggestedChange} series por semana
ja: 疲労リスク：週${-suggestedChange}セット削減推奨

# profile_Premiumプラン_広告非表示AI機能月10回利用可能
source: • Premium Plan: No ads, 10 AI features per month
es: • Plan Premium: Sin anuncios, 10 funciones de IA al mes
ja: • Premiumプラン: 広告非表示、AI機能月10回利用可能

# subscription_トライアル既に使用済み
source: ⚠️ Trial already used
es: ⚠️ Prueba ya utilizada
ja: ⚠️ トライアル既に使用済み

# profile_友達
source: friend
es: amigo
ja: 友達

# general_インストール
source: install
es: instalar
ja: インストール

# general_次の報酬まであと_nextMilestoneremaining回
source: Only ${_nextMilestone!.remaining} remaining until your next reward!
es: ¡Solo quedan ${_nextMilestone!.remaining} para tu próxima recompensa!
ja: 次の報酬まであと${_nextMilestone!.remaining}回！

# general_トレーニング分析_API呼び出し中
source: ⏳ Training Analysis: API call in progress...
es: ⏳ Análisis de entrenamiento: Llamada API...
ja: ⏳ トレーニング分析: API呼び出し中...

# general_継続率_80
source: Retention rate: 80%
es: Tasa de retención: 80%
ja: 継続率 80%

# workout_IMPORT_エラー後もプレビュー画面に留まりますユーザーが閉じるまで
source: 🔙 [IMPORT] Stay on preview screen after error (until user closes it)
es: 🔙 [IMPORTAR] Permanecer en la pantalla de vista previa después del error (hasta que el usuario la cierre)
ja: 🔙 [IMPORT] エラー後もプレビュー画面に留まります（ユーザーが閉じるまで）

# general_1年連続達成
source: Achieved for one consecutive year!
es: ¡Logrado por un año consecutivo!
ja: 1年連続達成！

# workout_プル系種目を集中的に鍛えるテンプレート
source: A template for focusing on pull exercises
es: Una plantilla para centrarse en los ejercicios de tracción
ja: プル系種目を集中的に鍛えるテンプレート

# profile_アカウント名を入力してください
source: Enter your account name
es: Ingrese el nombre de su cuenta
ja: アカウント名を入力してください

# error_達成記録エラー_e
source: ❌ Achievement record error: $e
es: ❌ Error en el registro de logros: $e
ja: ❌ 達成記録エラー: $e

# workout_科学的根拠_Schoenfeld_et_al_2017_ACSM_Guidelines_2009
source: 📚 Scientific basis: Schoenfeld et al. 2017, ACSM Guidelines 2009
es: 📚 Base científica: Schoenfeld et al. 2017, Directrices ACSM 2009
ja: 📚 科学的根拠: Schoenfeld et al. 2017, ACSM Guidelines 2009

# gym_コメントを入力してください
source: Please enter your comment
es: Por favor ingrese su comentario
ja: コメントを入力してください

# general_最終セッション
source: Final Session
es: Sesión final
ja: 最終セッション

# profile_近日公開
source: Coming soon
es: Muy pronto
ja: 近日公開

# general_GYMMATCH_トレーニング統計_筋トレ継続
source: #GYMMATCH #TrainingStats #ContinueMuscleTraining
es: #GYMMATCH #EstadísticasDeEntrenamiento #ContinuarEntrenamientoMuscular
ja: #GYMMATCH #トレーニング統計 #筋トレ継続

# general_利用可能な商品ID_availableIds
source: Available product IDs: $availableIds
es: ID de producto disponibles: $availableIds
ja: 利用可能な商品ID: $availableIds

# workout_exercises_フィールド検出_exercisesruntimeType
source: ⚠️ exercises field detection: ${exercises.runtimeType}
es: ⚠️ Detección del campo de ejercicios: ${exercises.runtimeType}
ja: ⚠️ exercises フィールド検出: ${exercises.runtimeType}

# general_重量を落として限界まで
source: Drop the weight to the limit
es: Baja el peso hasta el límite
ja: 重量を落として限界まで
