Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# general_Firestoreからgymslength件のジムを取得
source: ✅ Get ${gyms.length} gyms from Firestore
es: ✅ Consigue ${gyms.length} gimnasios en Firestore
ja: ✅ Firestoreから${gyms.length}件のジムを取得

# general_canUseAI_永年Proプラン保持者_AI無制限
source: ✅ [canUseAI] Lifetime Pro Plan Holder - Unlimited AI
es: ✅ [canUseAI] Titular del plan Pro de por vida - IA ilimitada
ja: ✅ [canUseAI] 永年Proプラン保持者 - AI無制限

# general_goalNameを削除しますか_この操作は取り消せません
source: Do you want to delete "$goalName"? This action cannot be undone.
es: ¿Quieres eliminar "$goalName"? Esta acción no se puede deshacer.
ja: 「$goalName」を削除しますか？ この操作は取り消せません。

# gym_widgetgymnameにチェックインしました
source: Checked in to ${widget.gym.name}
es: Se registró en ${widget.gym.name}
ja: ${widget.gym.name}にチェックインしました

# workout_IMPORT_種目数_exerciseslength
source: ✅ [IMPORT] Number of exercises: ${exercises.length}
es: ✅ [IMPORTAR] Número de ejercicios: ${exercises.length}
ja: ✅ [IMPORT] 種目数: ${exercises.length}

# error_前回ワークアウト取得エラー_e
source: Error getting last workout: $e
es: Error al obtener el último entrenamiento: $e
ja: 前回ワークアウト取得エラー: $e

# personalFactor_6時間_115x_8時間_095x
source: <6 hours: 1.15x, 8+ hours: 0.95x
es: <6 horas: 1,15x, 8+ horas: 0,95x
ja: <6時間: 1.15x, 8+時間: 0.95x

# general_移行チェックリスト
source: 📋 Migration Checklist:
es: Lista de verificación de migración:
ja: 📋 移行チェックリスト:

# general_リセット内容
source: Reset details:
es: Restablecer detalles:
ja: リセット内容:

# subscription_AI追加パック消費_1_残り_currentAddon_1回
source: ✅ AI Add-on Pack Consumption: -1 (Remaining: ${currentAddon - 1} times)
es: ✅ Consumo del paquete complementario de IA: -1 (Restante: ${currentAddon - 1} veces)
ja: ✅ AI追加パック消費: -1 (残り: ${currentAddon - 1}回)

# general_体重または体脂肪率を入力してください
source: Enter your weight or body fat percentage
es: Ingrese su peso o porcentaje de grasa corporal
ja: 体重または体脂肪率を入力してください

# workout_体重データがnull
source: ⚠️ Weight data is null
es: ⚠️ Los datos de peso son nulos
ja: ⚠️ 体重データがnull

# general_Phase_2b_個人補正係数_PFM
source: Phase 2b: Personal Correction Factor (PFM)
es: Fase 2b: Factor de corrección personal (PFM)
ja: Phase 2b: 個人補正係数 (PFM)

# subscription_AI追加購入エラー_e
source: ❌ AI Additional Purchase Error: $e
es: ❌ Error de compra adicional de IA: $e
ja: ❌ AI追加購入エラー: $e

# general_長野
source: Nagano
ja: 長野

# profile_AIによるトレーニングメニュー提案Gemini_API使用
source: • AI-powered training menu suggestions (using Gemini API)
es: • Sugerencias de menú de entrenamiento basadas en IA (mediante la API de Gemini)
ja: • AIによるトレーニングメニュー提案（Gemini API使用）

# workout_週間統計クエリ開始
source: 📊 Weekly Stats Query Started...
es: 📊 Consulta de estadísticas semanales lanzada...
ja: 📊 週間統計クエリ開始...

# profile_残り150_bioControllertextlength文字
source: ${150 - _bioController.text.length} characters remaining
es: ${150 - _bioController.text.length} caracteres restantes
ja: 残り${150 - _bioController.text.length}文字

# workout_weeklyTotalMinutes分
source: $_weeklyTotalMinutes
es: $_minutostotalessemanales
ja: $_weeklyTotalMinutes分

# general_UIDをコピーしました_currentUserUid
source: ✅ UID copied $_currentUserUid
es: ✅ UID copiado $_currentUserUid
ja: ✅ UIDをコピーしました $_currentUserUid

# general_店舗の雰囲気やマシン設備の写真を_アップロードしましょう
source: Upload photos of your store's atmosphere, machines, and equipment.
es: Sube fotos del ambiente, las máquinas y el equipo de tu tienda.
ja: 店舗の雰囲気やマシン・設備の写真を アップロードしましょう

# profile_データ取り込み
source: Data Import
es: Importación de datos
ja: データ取り込み

# general_紹介特典豪華版
source: 🎁 Introduction Bonus (Deluxe Edition)
es: Bono por recomendación (Edición Deluxe)
ja: 🎁 紹介特典（豪華版）

# general_セッション履歴は近日公開予定です
source: Session history coming soon
es: Historial de sesiones próximamente
ja: セッション履歴は近日公開予定です

# general_あと4記録で習慣化達成_残りdaysRemaining日です
source: Just 4 more records to make it a habit! ${daysRemaining} days left.
es: ¡Solo faltan 4 discos para que se vuelva un hábito! ${daysRemaining} días restantes.
ja: あと4記録で習慣化達成！ 残り${daysRemaining}日です。

# gym_クーポンコード任意
source: Coupon code (optional)
es: Código de cupón (opcional)
ja: クーポンコード（任意）

# workout_トレーニング記録_匿名認証エラー_e
source: ❌ Training Record: Anonymous Authentication Error: $e
es: ❌ Registro de entrenamiento: Error de autenticación anónima: $e
ja: ❌ トレーニング記録: 匿名認証エラー: $e

# general_ユーザー画面プレビュー
source: 📱 User Screen Preview
es: 📱 Vista previa de la pantalla del usuario
ja: 📱 ユーザー画面プレビュー

# profile_写真から取り込み
source: 📸 Import from Photos
es: 📸 Importar desde fotos
ja: 📸 写真から取り込み

# general_現在currentWeightroundkg_4ヶ月後predictedWeightroundkgp
source: Currently ${currentWeight.round()}kg → It is scientifically predicted that you will grow ${predictedWeight.round()}kg (+${(predictedWeight - currentWeight).round()}kg) in 4 months.
es: Actualmente ${currentWeight.round()}kg → Se predice científicamente que crecerás ${predictedWeight.round()}kg (+${(predictedWeight - currentWeight).round()}kg) en 4 meses.
ja: 現在${currentWeight.round()}kg → 4ヶ月後${predictedWeight.round()}kg（+${(predictedWeight - currentWeight).round()}kg）の成長が科学的に見込まれます。

# general_マジックナンバー達成
source: 🎉 Magic number achieved!
es: 🎉¡Número mágico conseguido!
ja: 🎉 マジックナンバー達成！

# workout_体重が記録されていません体重を記録してください
source: Your weight has not been recorded. Please record your weight.
es: No se ha registrado su peso. Por favor, regístrelo.
ja: 体重が記録されていません。体重を記録してください。

# workout_種目選択_int_currentSets_12_int_currentFrequency_2_lat
source: ; // Select exercise int _currentSets = 12; int _currentFrequency = 2; late String _selectedLevel; late String _selectedGender; bool _enablePlateauDetection = true; // Plateau detection ON/OFF // 🆕 Phase 7.5: Automatically Obtained Data int? _userAge; // Obtained from Personal Factor Settings // Analysis Results Map<String, dynamic>? _analysisResult; bool _isLoading = false; // ✅ Fixed: No loading by default late List<String> _bodyParts; late Map<String, List<String>> _exercisesByBodyPart; late List<String> _levels; // 🔧 v1.0.297: Late change (initialized with didChangeDependencies) bool _isInitialized = false; // 🔧 Initialization Flag @override void initState() { super.initState(); _loadUserAge(); // 🆕 Phase 7.5: Automatically Obtain Age } @override void didChangeDependencies() { super.didChangeDependencies(); / 🔧 v1.0.297: Initialize Once (Context Available) if (!_isInitialized) { final l10n = AppLocalizations.of(context)!; _selectedBodyPart = l10n.musclePecs; _selectedLevel = l10n.levelIntermediate; _selectedGender = l10n.genderFemale; / Level Selection _levels = [l10n.levelBeginner, l10n.levelIntermediate, l10n.levelAdvanced]; / Body Part Selection _bodyParts = [ l10n.musclePecs,
es: ; // Seleccionar ejercicio int _currentSets = 12; int _currentFrequency = 2; late String _selectedLevel; late String _selectedGender; bool _enablePlateauDetection = true; // Detección de meseta activada/desactivada // 🆕 Fase 7.5: Datos obtenidos automáticamente int? _userAge; // Obtenidos de la configuración de factores personales // Resultados del análisis Map<String, dynamic>? _analysisResult; bool _isLoading = false; // ✅ Corregido: Sin carga por defecto late List<String> _bodyParts; late Map<String, List<String>> _exercisesByBodyPart; late List<String> _levels; // 🔧 v1.0.297: Cambio tardío (inicializado con didChangeDependencies) bool _isInitialized = false; // 🔧 Indicador de inicialización @override void initState() { super.initState(); _loadUserAge(); // 🆕 Fase 7.5: Obtener edad automáticamente } @override void didChangeDependencies() { super.didChangeDependencies(); / 🔧 v1.0.297: Inicializar una vez (contexto disponible) if (!_isInitialized) { final l10n = AppLocalizations.of(context)!; _selectedBodyPart = l10n.musclePecs; _selectedLevel = l10n.levelIntermediate; _selectedGender = l10n.genderFemale; / Selección de nivel _levels = [l10n.levelBeginner, l10n.levelIntermediate, l10n.levelAdvanced]; / Selección de partes del cuerpo _bodyParts = [ l10n.musclePecs,
ja: ; // 種目選択 int _currentSets = 12; int _currentFrequency = 2; late String _selectedLevel; late String _selectedGender; bool _enablePlateauDetection = true; // プラトー検出ON/OFF // 🆕 Phase 7.5: 自動取得データ int? _userAge; // 個人要因設定から取得 // 分析結果 Map<String, dynamic>? _analysisResult; bool _isLoading = false; // ✅ 修正: 初期状態はローディングなし late List<String> _bodyParts; late Map<String, List<String>> _exercisesByBodyPart; late List<String> _levels; // 🔧 v1.0.297: late変更（didChangeDependenciesで初期化） bool _isInitialized = false; // 🔧 初期化フラグ @override void initState() { super.initState(); _loadUserAge(); // 🆕 Phase 7.5: 年齢を自動取得 } @override void didChangeDependencies() { super.didChangeDependencies(); // 🔧 v1.0.297: 1回だけ初期化（context利用可能） if (!_isInitialized) { final l10n = AppLocalizations.of(context)!; _selectedBodyPart = l10n.musclePecs; _selectedLevel = l10n.levelIntermediate; _selectedGender = l10n.genderFemale; // レベル選択肢 _levels = [l10n.levelBeginner, l10n.levelIntermediate, l10n.levelAdvanced]; // 部位選択肢 _bodyParts = [ l10n.musclePecs,

# workout_上記の履歴を参考に適切な重量と回数を提案してください
source: Please refer to the history above to suggest appropriate weights and repetitions.
es: Consulte el historial anterior para sugerir pesos y repeticiones adecuados.
ja: 上記の履歴を参考に、適切な重量と回数を提案してください。

# workout_今月末まで有効
source: • Valid until the end of this month
es: • Válido hasta fin de mes
ja: • 今月末まで有効

# general_例_トレーニング日記
source: Example: Training diary
es: Ejemplo: Diario de entrenamiento
ja: 例: トレーニング日記

# workout_AIコーチデータ初期化エラー_e
source: ❌ AI Coach Data Initialization Error: $e
es: ❌ Error de inicialización de datos de AI Coach: $e
ja: ❌ AIコーチデータ初期化エラー: $e

# general_ウォームアップセット
source: Warm-up set
es: Serie de calentamiento
ja: ウォームアップセット

# general_例_初めてのジム利用です
source: Example: This is my first time at the gym.
es: Ejemplo: Esta es mi primera vez en el gimnasio.
ja: 例: 初めてのジム利用です

# gym_ロッカールーム
source: Locker room
es: Vestuario
ja: ロッカールーム

# personalFactor_前日のアルコール摂取量
source: Alcohol intake the previous day
es: Consumo de alcohol el día anterior
ja: 前日のアルコール摂取量

# gym_現在の混雑度
source: Current congestion level
es: Nivel actual de congestión
ja: 現在の混雑度

# general_実力差大_検索者_userAverage1RMtoStringAsFixed1kg_vs_対象_ta
source: ❌ Large difference in ability: Searcher ${userAverage1RM.toStringAsFixed(1)}kg vs. Target ${targetAverage1RM.toStringAsFixed(1)}kg
es: ❌ Gran diferencia en capacidad: Buscador ${userAverage1RM.toStringAsFixed(1)}kg vs. Objetivo ${targetAverage1RM.toStringAsFixed(1)}kg
ja: ❌ 実力差大: 検索者 ${userAverage1RM.toStringAsFixed(1)}kg vs 対象 ${targetAverage1RM.toStringAsFixed(1)}kg

# personalFactor_1日のタンパク質摂取量
source: Daily Protein Intake
es: Ingesta diaria de proteínas
ja: 1日のタンパク質摂取量

# subscription_AI機能無制限AIコーチ成長予測効果分析_パートナー検索_メッセージング
source: Unlimited AI features (AI coaching, growth predictions, and effectiveness analysis) + partner search + messaging
es: Funciones de IA ilimitadas (coaching de IA, predicciones de crecimiento y análisis de eficacia) + búsqueda de socios + mensajería
ja: AI機能無制限（AIコーチ・成長予測・効果分析） + パートナー検索 + メッセージング

# workout_バーの重量
source: Bar Weight
es: Peso de la barra
ja: バーの重量

# personalFactor_睡眠時間を入力してください
source: Enter your sleep time
es: Introduce tu tiempo de sueño
ja: 睡眠時間を入力してください

# general_人気ジムの精度大幅向上
source: ✅ Greatly improved accuracy for popular gyms
es: ✅ Precisión enormemente mejorada para gimnasios populares
ja: ✅ 人気ジムの精度大幅向上

# workout_20kgベース
source: 20kg base
es: Base de 20 kg
ja: 20kgベース

# general_今日の記録
source: Today's Record
es: El récord de hoy
ja: 今日の記録

# personalFactor_アルコール_回復阻害要因
source: • Alcohol: A factor that inhibits recovery
es: • Alcohol: Un factor que inhibe la recuperación
ja: • アルコール: 回復阻害要因

# general_アプリ名を入力
source: Enter the app name
es: Introduzca el nombre de la aplicación
ja: アプリ名を入力

# general_限界セット
source: Limit Set
es: Límite establecido
ja: 限界セット

# workout_現在の種目_currentExerciseNamesjoin
source: 📊 Current exercise: ${currentExerciseNames.join(
es: 📊 Ejercicio actual: ${currentExerciseNames.join(
ja: 📊 現在の種目: ${currentExerciseNames.join(

# gym_初心者への優しさ
source: Beginner-friendly
es: Apto para principiantes
ja: 初心者への優しさ

# profile_所在地
source: location
es: ubicación
ja: 所在地

# general_茨城
source: Ibaraki
ja: 茨城

# workout_休憩_60秒
source: - Rest: 60 seconds
es: - Descanso: 60 segundos
ja: - 休憩: 60秒

# gym_東京都港区六本木666
source: 6-6-6 Roppongi, Minato-ku, Tokyo
es: 6-6-6 Roppongi, Minato-ku, Tokio
ja: 東京都港区六本木6-6-6

# error_訪問履歴の読み込みに失敗しました_e
source: Failed to load visit history: $e
es: No se pudo cargar el historial de visitas: $e
ja: 訪問履歴の読み込みに失敗しました: $e

# general_週に何回トレーニングするか設定します
source: Set how many times a week you train
es: Establece cuántas veces a la semana entrenas
ja: 週に何回トレーニングするか設定します

# general_ワークアウトログ保存_集計完了
source: ✅ Workout log saved + tally completed
es: ✅ Registro de entrenamiento guardado + recuento completado
ja: ✅ ワークアウトログ保存 + 集計完了

# workout_年齢が未設定です個人要因設定で年齢を登録してください
source: Age is not set. Please register your age in personal settings.
es: La edad no está establecida. Por favor, regístrala en la configuración personal.
ja: 年齢が未設定です。個人要因設定で年齢を登録してください。

# general_山田_太郎
source: Taro Yamada
ja: 山田 太郎

# profile_開発者は本アプリに起因してユーザーに生じたあらゆる損害について一切の責任を負いません
source: • The developer assumes no responsibility for any damages incurred by users as a result of this app.
es: • El desarrollador no asume ninguna responsabilidad por los daños que puedan sufrir los usuarios como resultado del uso de esta aplicación.
ja: • 開発者は、本アプリに起因してユーザーに生じたあらゆる損害について、一切の責任を負いません。

# general_記録を削除中_ID_documentId
source: 🗑️ Deleting record... ID: $documentId
es: 🗑️ Eliminando registro... ID: $documentId
ja: 🗑️ 記録を削除中... ID: $documentId

# workout_新規記録モード
source: ✅ New Record Mode
es: ✅ Nuevo modo de grabación
ja: ✅ 新規記録モード

# workout_part_トレーニング
source: ## $part training
es: ## $entrenamiento parcial
ja: ## $part トレーニング

# general_報告ありがとうございます
source: Thank you for your report!
es: ¡Gracias por tu informe!
ja: 報告ありがとうございます！

# subscription_GYM_MATCHへ
source: To GYM MATCH
es: Para GYM MATCH
ja: GYM MATCHへ

# general_現在の頻度は最適です
source: The current frequency is optimal
es: La frecuencia actual es óptima
ja: 現在の頻度は最適です

# workout_オフ日保存成功
source: ✅ Successfully saved my day off
es: ✅ Me salvó el día con éxito
ja: ✅ オフ日保存成功

# workout_Phase_7_取得ドキュメント数_snapshotdocslength件
source: 📊 [Phase 7] Number of retrieved documents: ${snapshot.docs.length}
es: 📊 [Fase 7] Número de documentos recuperados: ${snapshot.docs.length}
ja: 📊 [Phase 7] 取得ドキュメント数: ${snapshot.docs.length}件

# workout_動画でAI機能解放
source: Unlock AI capabilities with video
es: Desbloquea las capacidades de la IA con vídeo
ja: 動画でAI機能解放

# gym_最初の報告者になりましょう
source: Be the first to report!
es: ¡Sé el primero en informar!
ja: 最初の報告者になりましょう！

# general_重量表示_exerciseName_weight_weight_isBodyweightMode_i
source: 🏋️ Weight display: $exerciseName - weight: $weight, isBodyweightMode: $isBodyweightMode, isAbs: $isAbs
es: 🏋️ Visualización de peso: $exerciseName - peso: $weight, isBodyweightMode: $isBodyweightMode, isAbs: $isAbs
ja: 🏋️ 重量表示: $exerciseName - weight: $weight, isBodyweightMode: $isBodyweightMode, isAbs: $isAbs

# profile_予約設定を更新しました
source: ✅ Booking settings have been updated!
es: ✅ ¡Se han actualizado las configuraciones de reserva!
ja: ✅ 予約設定を更新しました！

# gym_レビューを投稿しました
source: You've posted a review!
es: ¡Has publicado una reseña!
ja: レビューを投稿しました！

# general_Firebase_Analytics初期化成功
source: 📊 Firebase Analytics initialization successful
es: 📊 Inicialización exitosa de Firebase Analytics
ja: 📊 Firebase Analytics初期化成功

# gym_新規設備
source: New Equipment
es: Nuevo equipo
ja: 新規設備

# profile_全Premium機能
source: All Premium features
es: Todas las funciones Premium
ja: 全Premium機能

# gym_マッスルハウスGYM
source: Muscle House GYM
es: Gimnasio Muscle House
ja: マッスルハウスGYM

# profile_サブスクリプションの管理解約はApple_App_Storeの設定から行えます
source: • You can manage and cancel your subscription in your Apple App Store settings.
es: • Puedes gestionar y cancelar tu suscripción en la configuración de la App Store de Apple.
ja: • サブスクリプションの管理・解約は、Apple App Storeの設定から行えます

# workout_Gemini_APIでメニュー生成開始_bodyPartsjoin_1
source: Start generating menu with Gemini API: ${bodyParts.join(
es: Comience a generar el menú con la API de Gemini: ${bodyParts.join(
ja: Gemini APIでメニュー生成開始: ${bodyParts.join(

# personalFactor_050の範囲で入力してください
source: Please enter a value between 0 and 50
es: Por favor, introduzca un valor entre 0 y 50
ja: 0〜50の範囲で入力してください

# workout_エラーチェック_if_analysisResult
source: ), ), ); } // Error check if (_analysisResult![
es: ), ), ); } // Comprobación de errores if (_analysisResult![
ja: ), ), ); } // エラーチェック if (_analysisResult![

# workout_日本語で丁寧に説明
source: Detailed explanation in Japanese
es: Explicación detallada en japonés
ja: 日本語で丁寧に説明

# subscription_2_トレーニング記録を1回入力
source: 2. Enter your training record once
es: 2. Ingrese su registro de entrenamiento una vez
ja: 2. トレーニング記録を1回入力

# error_エラーが発生しました_etoString
source: An error occurred: ${e.toString()}
es: Se produjo un error: ${e.toString()}
ja: エラーが発生しました: ${e.toString()}

# subscription_高度なフィルター検索_1
source: 🎯 Advanced filter search
es: Búsqueda avanzada de filtros
ja: 🎯 高度なフィルター検索

# general_混雑度報告完了_reportCount回目
source: ✅ Crowd level report completed: $reportCountth time
es: ✅ Informe de nivel de multitud completado: $reportCountth tiempo
ja: ✅ 混雑度報告完了: $reportCount回目

# workout_exerciseName_最大重量を計算_final_sets_exerciseMap
source: ] == exerciseName) { // Calculate maximum weight final sets = exerciseMap[
es: ] == nombreEjercicio) { // Calcular peso máximo series finales = mapaEjercicio[
ja: ] == exerciseName) { // 最大重量を計算 final sets = exerciseMap[

# general_未解除
source: Unreleased
es: Inédito
ja: 未解除

# workout_API権限エラー_403_responsebody
source: ❌ API Authorization Error (403): ${response.body}
es: ❌ Error de autorización de API (403): ${response.body}
ja: ❌ API権限エラー (403): ${response.body}

# gym_特別キャンペーン
source: Special Campaign
es: Campaña especial
ja: 特別キャンペーン

# general_ボリューム
source: volume
es: volumen
ja: ボリューム

# workout_例_80
source: Example: 80
es: Ejemplo: 80
ja: 例: 80

# error_アラート設定保存エラー_e
source: ❌ Error saving alert settings: $e
es: ❌ Error al guardar la configuración de alerta: $e
ja: ❌ アラート設定保存エラー: $e

# profile_メールアドレス_ihajime1219outlookjp_対応時間_平日_10001800
source: Email address: i.hajime1219@outlook.jp (Business hours: Weekdays 10:00-18:00)
es: Correo electrónico: i.hajime1219@outlook.jp (Horario: Laborables, de 10:00 a 18:00)
ja: メールアドレス: i.hajime1219@outlook.jp （対応時間: 平日 10:00-18:00）

# general_安全
source: safety
es: seguridad
ja: 安全

# profile_Proプラン_980月税込
source: Pro Plan: ¥980/month (tax included)
es: Plan Pro: ¥980/mes (impuestos incluidos)
ja: Proプラン: ¥980/月（税込）

# subscription_以下の条件を達成すると自動的にプレミアムプラン7日間無料でご利用いただけます
source: You will automatically receive 7 days of free Premium Plan if you meet the following conditions:
es: Recibirás automáticamente 7 días de Plan Premium gratuito si cumples las siguientes condiciones:
ja: 以下の条件を達成すると、自動的にプレミアムプラン7日間無料でご利用いただけます：

# subscription_3_ジム検索を1回実行
source: 3. Run a gym search once
es: 3. Realiza una búsqueda de gimnasio una vez
ja: 3. ジム検索を1回実行

# general_オーバートレーニングを防ぎ常にベストコンディションで
source: Prevent overtraining and stay in top condition
es: Prevenir el sobreentrenamiento y mantenerse en óptimas condiciones
ja: オーバートレーニングを防ぎ、常にベストコンディションで

# gym_銀座の中心地にある高級感あふれるフィットネスクラブ
source: A luxurious fitness club located in the heart of Ginza.
es: Un lujoso club de fitness ubicado en el corazón de Ginza.
ja: 銀座の中心地にある高級感あふれるフィットネスクラブ。

# subscription_今月のAI使用回数を使い切りました_currentUsagetotalLimit回_追加購入で継続利
source: You have used up all your AI usage for this month (${currentUsage}/${totalLimit} times). 💰 You can continue using the service by purchasing additional usage.
es: Has agotado todo tu uso de IA de este mes (${currentUsage}/${totalLimit} veces). 💰 Puedes seguir usando el servicio comprando uso adicional.
ja: 今月のAI使用回数を使い切りました (${currentUsage}/${totalLimit}回) 💰 追加購入で継続利用可能

# workout_データ抽出成功_result
source: ✅ Data extraction successful: ${result[
es: ✅ Extracción de datos exitosa: ${result[
ja: ✅ データ抽出成功: ${result[

# workout_CSVサイズ_csvContentlength_bytes
source: 📄 CSV size: ${csvContent.length} bytes
es: 📄 Tamaño del CSV: ${csvContent.length} bytes
ja: 📄 CSVサイズ: ${csvContent.length} bytes

# subscription_人気No1
source: ⭐ Most popular
es: ⭐ Más populares
ja: ⭐ 人気No.1

# profile_あなたの紹介コード
source: Your referral code
es: Tu código de referencia
ja: あなたの紹介コード

# general_AdMob初期化
source: 📱 AdMob initialization...
es: 📱 Inicialización de AdMob...
ja: 📱 AdMob初期化...

# profile_980月広告なしAI機能月30回
source: ¥980/month (no ads, AI function 30 times per month)
es: ¥980/mes (sin anuncios, función de IA 30 veces al mes)
ja: ¥980/月（広告なし、AI機能月30回）

# general_レビューする
source: Review
es: Revisar
ja: レビューする

# general_全sortedGymslength件中_startIndex_1endIndex_sortedGym
source: Displaying ${startIndex + 1}-${endIndex > sortedGyms.length ? sortedGyms.length : endIndex} of all ${sortedGyms.length} results
es: Mostrando ${startIndex + 1}-${endIndex > sortedGyms.length ? sortedGyms.length : endIndex} de todos los resultados de ${sortedGyms.length}
ja: 全${sortedGyms.length}件中 ${startIndex + 1}-${endIndex > sortedGyms.length ? sortedGyms.length : endIndex}件を表示

# general_アラート
source: Alerts
es: Alertas
ja: アラート

# general_β版テスト運用について
source: About the beta test operation
es: Acerca de la operación de prueba beta
ja: β版テスト運用について

# workout_muscleGroup_weightkg_reps回_volumekg
source: 💪 $muscleGroup: ${weight}kg × ${reps} times = ${volume}kg
es: 💪 $muscleGroup: ${peso}kg × ${repeticiones} veces = ${volumen}kg
ja: 💪 $muscleGroup: ${weight}kg × ${reps}回 = ${volume}kg

# general_ジム名_gymName
source: Gym Name: $_gymName
es: Nombre del gimnasio: $_gymName
ja: ジム名: $_gymName

# workout_setslengthセットをテンプレートから適用しました
source: ✅ ${_sets.length} set applied from template
es: ✅ ${_sets.length} conjunto aplicado desde la plantilla
ja: ✅ ${_sets.length}セットをテンプレートから適用しました

# general_全期間_totalVolumetoStringAsFixed2t
source: Total time: ${totalVolume.toStringAsFixed(2)}t
es: Tiempo total: ${totalVolume.toStringAsFixed(2)}t
ja: 全期間: ${totalVolume.toStringAsFixed(2)}t

# subscription_AI機能が無制限月20回に制限
source: Unlimited AI functions → Limited to 20 times per month
es: Funciones de IA ilimitadas → Limitado a 20 veces al mes
ja: AI機能が無制限→月20回に制限

# workout_筋肉グループ_muscleGroup
source: Muscle Group: $muscleGroup
es: Grupo muscular: $muscleGroup
ja: 筋肉グループ: $muscleGroup

# general_山形
source: Yamagata
ja: 山形

# profile_featureNameは有料プラン会員限定の機能です
source: $featureName is a feature available only to paid plan members.
es: $featureName es una función disponible solo para miembros del plan pago.
ja: $featureNameは有料プラン会員限定の機能です。

# general_あなたの認証コード
source: Your authentication code
es: Su código de autenticación
ja: あなたの認証コード

# general_自由に編集してOKですが認証コードとハッシュタグは必須です
source: 💡 Feel free to edit, but verification code and hashtags are required.
es: 💡Siéntete libre de editar, pero se requiere un código de verificación y hashtags.
ja: 💡 自由に編集してOKですが、認証コードとハッシュタグは必須です

# general_購入完了
source: ✅ Purchase completed
es: ✅ Compra completada
ja: ✅ 購入完了

# workout_トレーナーメモ
source: Trainer Notes
es: Notas del entrenador
ja: トレーナーメモ

# general_テキスト検索
source: 📝 Text Search:
es: 📝 Búsqueda de texto:
ja: 📝 テキスト検索:

# general_ログをコピー
source: Copy Log
es: Copiar registro
ja: ログをコピー

# workout_サブセクションをスキップ_line
source: ⏭️ Skip subsection: $line
es: ⏭️ Saltar subsección: $line
ja: ⏭️ サブセクションをスキップ: $line

# general_validUntilyear年_validUntilmonth月_validUntilday日まで
source: ${_validUntil!.year} ${_validUntil!.month} month ${_validUntil!.day}
es: ${_validUntil!.year} ${_validUntil!.month} mes ${_validUntil!.day}
ja: ${_validUntil!.year}年${_validUntil!.month}月${_validUntil!.day}日まで
