Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# workout_種目検出_currentExerciseName_部位_currentBodyPart
source: ✅ Exercise detection: $currentExerciseName (body part: $currentBodyPart)
es: ✅ Detección de ejercicio: $currentExerciseName (parte del cuerpo: $currentBodyPart)
ja: ✅ 種目検出: $currentExerciseName (部位: $currentBodyPart)

# general_軽い運動
source: Light exercise
es: Ejercicio ligero
ja: 軽い運動

# subscription_AI機能が月20回月3回に制限
source: AI function limited from 20 times a month to 3 times a month
es: Función de IA limitada de 20 veces al mes a 3 veces al mes
ja: AI機能が月20回→月3回に制限

# profile_AI使用回数3回がもらえます
source: You will receive 3 AI usage times!
es: ¡Recibirás 3 usos de IA!
ja: AI使用回数3回がもらえます！

# general_カール
source: curl
es: rizo
ja: カール

# general_widgetbasislength本の査読付き論文
source: ${widget.basis.length} peer-reviewed papers
es: ${widget.basis.length} artículos revisados por pares
ja: ${widget.basis.length}本の査読付き論文

# subscription_後で確認する
source: Check back later
es: Vuelve más tarde
ja: 後で確認する

# general_gymnameをお気に入りから削除しますか
source: Do you want to remove "${gym.name}" from your favorites?
es: ¿Quieres eliminar "${gym.name}" de tus favoritos?
ja: 「${gym.name}」をお気に入りから削除しますか？

# gym_合戸孝二氏のパーソナルトレーニングを受けられる本格派ジム日本を4度制覇しアジアをも制覇した狂気のトレ
source: This is a full-scale gym where you can receive personal training from Koji Godo. Experience the crazy training that has taken Japan by storm four times and conquered Asia!
es: Este es un gimnasio completo donde puedes recibir entrenamiento personal de Koji Godo. ¡Vive el entrenamiento alocado que ha conquistado Japón cuatro veces y Asia!
ja: 合戸孝二氏のパーソナルトレーニングを受けられる本格派ジム。日本を4度制覇しアジアをも制覇した狂気のトレーニングを体験せよ！

# general_recordexerciseslength種目
source: ${record.exercises.length}exercises
es: ${record.exercises.length}ejercicios
ja: ${record.exercises.length}種目

# profile_デジタルコンテンツの性質上原則として返品返金はお受けできません
source: Due to the nature of digital content, returns and refunds are not accepted as a general rule.
es: Debido a la naturaleza del contenido digital, por lo general no se aceptan devoluciones ni reembolsos.
ja: デジタルコンテンツの性質上、原則として返品・返金はお受けできません。

# general_頻度に応じた最適なボリュームを提案します
source: We will suggest the optimal volume according to frequency.
es: Sugeriremos el volumen óptimo según la frecuencia.
ja: 頻度に応じた最適なボリュームを提案します

# general_予約申込を送信
source: Submit your reservation request
es: Envíe su solicitud de reserva
ja: 予約申込を送信

# general_月間
source: Monthly
es: Mensual
ja: 月間

# general_香川
source: Kagawa
ja: 香川

# profile_エラー_etoString
source: ❌ Error: ${e.toString()}
ja: ❌ エラー: ${e.toString()}

# profile_本アプリの不具合を意図的に利用する行為
source: • Intentionally exploiting any bugs in this app
es: • Explotar intencionalmente cualquier error en esta aplicación
ja: • 本アプリの不具合を意図的に利用する行為

# general_招待コードが正常に適用されました
source: Your invitation code has been successfully applied!
es: ¡Tu código de invitación ha sido aplicado exitosamente!
ja: 招待コードが正常に適用されました！

# general_希望日時
source: Desired date and time *
es: Fecha y hora deseada *
ja: 希望日時 *

# workout_実施種目
source: Events
es: Eventos
ja: 実施種目

# general_Skip_docid_FreePremium_検索者がNonPro
source: ⏭️ Skip: ${doc.id} (Free/Premium) - Searcher is Non-Pro
es: ⏭️ Omitir: ${doc.id} (Gratis/Premium) - El buscador no es profesional
ja: ⏭️ Skip: ${doc.id} (Free/Premium) - 検索者がNon-Pro

# subscription_300_5回
source: ¥300 / 5 sessions
es: ¥300 / 5 sesiones
ja: ¥300 / 5回

# subscription_Firestoreからプラン取得_プレミアムプラン_UID_useruid_匿名_userisAno
source: ✅ Get plan from Firestore: Premium Plan (UID: ${user.uid}, Anonymous: ${user.isAnonymous})
es: ✅ Obtén el plan de Firestore: Plan Premium (UID: ${user.uid}, Anónimo: ${user.isAnonymous})
ja: ✅ Firestoreからプラン取得: プレミアムプラン (UID: ${user.uid}, 匿名: ${user.isAnonymous})

# general_推奨バージョン_recommendedVersion_Build_recommendedBuildN
source: 🔍 Recommended version: $recommendedVersion (Build: $recommendedBuildNumber)
es: 🔍 Versión recomendada: $recommendedVersion (Compilación: $recommendedBuildNumber)
ja: 🔍 推奨バージョン: $recommendedVersion (Build: $recommendedBuildNumber)

# general_位置情報権限が永久に拒否されています
source: ❌ Location permission permanently denied
es: ❌ Permiso de ubicación denegado permanentemente
ja: ❌ 位置情報権限が永久に拒否されています

# general_温泉
source: hot spring
es: fuente termal
ja: 温泉

# profile_あなた
source: you
es: tú
ja: あなた

# general_前回_lastWeightkg_lastReps回
source: Last time: ${lastWeight}kg × ${lastReps}
es: Última vez: ${lastWeight}kg × ${lastReps}
ja: 前回: ${lastWeight}kg × ${lastReps}回

# general_トレーニング目標を設定しましょう
source: Set your training goals
es: Establece tus objetivos de entrenamiento
ja: トレーニング目標を設定しましょう

# general_friendNameさんがGYM_MATCHに参加しました
source: $friendName has joined GYM MATCH!
es: ¡$friendName se ha unido a GYM MATCH!
ja: $friendNameさんがGYM MATCHに参加しました！

# general_1_フェーズ1_フェーズ2
source: 1. Phase 1 → Phase 2
es: 1. Fase 1 → Fase 2
ja: 1. フェーズ1 → フェーズ2

# subscription_ダウングレード申請エラー_e
source: ❌ Downgrade request error: $e
es: ❌ Error en solicitud de degradación: $e
ja: ❌ ダウングレード申請エラー: $e

# general_平均ボリューム回
source: Average volume/time
es: Volumen/tiempo promedio
ja: 平均ボリューム/回

# general_ダークブルー_エナジーオレンジ_活力とモチベーションを刺激
source: Dark Blue x Energy Orange - Stimulates vitality and motivation
es: Azul oscuro x Naranja energético: estimula la vitalidad y la motivación.
ja: ダークブルー × エナジーオレンジ 活力とモチベーションを刺激

# general_町役場
source: Town Hall
es: Ayuntamiento
ja: 町役場

# workout_value_selectedLevel_items_levels_onChanged_value_s
source: , value: _selectedLevel, items: _levels, onChanged: (value) { setState(() { _selectedLevel = value!; }); }, ), const SizedBox(height: 16), // gender Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ _buildDropdownField( label: AppLocalizations.of(context)!.gender, value: _selectedGender, items: [AppLocalizations.of(context)!.genderMale, AppLocalizations.of(context)!.genderFemale], onChanged: (value) { setState(() { _selectedGender = value!; }); }, ), const SizedBox(height: 4), Padding( padding: const EdgeInsets.only(left: 4), child: Text(
es: , valor: _nivelSeleccionado, elementos: _niveles, onChanged: (valor) { setState(() { _nivelSeleccionado = valor!; }); }, ), const SizedBox(altura: 16), // género Columna( crossAxisAlignment: CrossAxisAlignment.start, hijos: [ _buildDropdownField( etiqueta: AppLocalizations.of(contexto)!.género, valor: _selectedGender, elementos: [AppLocalizations.of(contexto)!.géneroMasculino, AppLocalizations.of(contexto)!.géneroFemenino], onChanged: (valor) { setState(() { _selectedGender = valor!; }); }, ), const SizedBox(altura: 4), Padding( padding: const EdgeInsets.only(izquierda: 4), hijo: Texto(
ja: , value: _selectedLevel, items: _levels, onChanged: (value) { setState(() { _selectedLevel = value!; }); }, ), const SizedBox(height: 16), // 性別 Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ _buildDropdownField( label: AppLocalizations.of(context)!.gender, value: _selectedGender, items: [AppLocalizations.of(context)!.genderMale, AppLocalizations.of(context)!.genderFemale], onChanged: (value) { setState(() { _selectedGender = value!; }); }, ), const SizedBox(height: 4), Padding( padding: const EdgeInsets.only(left: 4), child: Text(

# general_ネットワーク接続を確認してください
source: Check your network connection
es: Comprueba tu conexión de red
ja: ネットワーク接続を確認してください

# general_キャンペーンタイトル
source: Campaign Title
es: Título de la campaña
ja: キャンペーンタイトル

# subscription_プラン取得エラー_e
source: ❌ Error getting plan: $e
es: ❌ Error al obtener el plan: $e
ja: ❌ プラン取得エラー: $e

# general_自動化スクリプトの利用が検出されました
source: Use of automated scripts detected.
es: Se detectó uso de scripts automatizados.
ja: 自動化スクリプトの利用が検出されました。

# exercise_3_デッドリフト
source: ### 3. Deadlift
es: ### 3. Peso muerto
ja: ### 3. デッドリフト

# workout_IMPORT_成功_SnackBar表示_画面遷移
source: ✅ [IMPORT] Success - SnackBar display + screen transition
es: ✅ [IMPORTACIÓN] Éxito - Visualización de SnackBar + transición de pantalla
ja: ✅ [IMPORT] 成功 - SnackBar表示 + 画面遷移

# general_目標を設定
source: Set goals
es: Establecer metas
ja: 目標を設定

# workout_AIコーチ_selectedExerciseslength種目をトレーニング記録画面に渡します
source: ✅ AI Coach: Send ${selectedExercises.length} exercises to the training record screen
es: ✅ AI Coach: Envía ${selectedExercises.length} ejercicios a la pantalla de registro de entrenamiento
ja: ✅ AIコーチ: ${selectedExercises.length}種目をトレーニング記録画面に渡します

# workout_AIコーチの推奨
source: AI Coach Recommendations
es: Recomendaciones de AI Coach
ja: AIコーチの推奨

# general_アクティブ会員です
source: I'm an active member
es: Soy un miembro activo
ja: アクティブ会員です

# general_科学的根拠に基づく疲労度分析
source: Scientifically based fatigue analysis
es: Análisis de fatiga con base científica
ja: 科学的根拠に基づく疲労度分析

# subscription_新しいジムが見つかるまで一時停止しませんか
source: Want to pause until you find a new gym?
es: ¿Quieres hacer una pausa hasta encontrar un nuevo gimnasio?
ja: 新しいジムが見つかるまで一時停止しませんか？

# error_管理者データの取得に失敗しました
source: Failed to get administrator data
es: No se pudieron obtener los datos del administrador
ja: 管理者データの取得に失敗しました

# subscription_永年プラン検出_メモリキャッシュ更新
source: 🔄 Long-term plan detection - memory cache update
es: 🔄 Detección de plan a largo plazo: actualización de caché de memoria
ja: 🔄 永年プラン検出 - メモリキャッシュ更新

# profile_マッチングリクエスト
source: Matching Request
es: Solicitud de coincidencia
ja: マッチングリクエスト

# general_サポートされていない言語コード_languageCode_デフォルト_ja
source: ⚠️ Unsupported language code: $languageCode (default: ja)
es: ⚠️ Código de idioma no compatible: $languageCode (predeterminado: ja)
ja: ⚠️ サポートされていない言語コード: $languageCode (デフォルト: ja)

# general_MPS上昇期間48時間
source: MPS increase period: 48 hours
es: Periodo de aumento de MPS: 48 horas
ja: MPS上昇期間：48時間

# workout_パース結果_exerciseslength種目抽出
source: 📝 Parsing result: ${exercises.length} exercises extracted
es: Resultado del análisis: ${exercises.length} ejercicios extraídos
ja: 📝 パース結果: ${exercises.length}種目抽出

# workout_カスタム種目を保存_customOnlykeyslength部位
source: ✅ Save custom events: ${customOnly.keys.length} parts
es: ✅ Guardar eventos personalizados: ${customOnly.keys.length} partes
ja: ✅ カスタム種目を保存: ${customOnly.keys.length}部位

# general_現在の1RM
source: Current 1RM
es: 1RM actual
ja: 現在の1RM

# personalFactor_84g12gkg_110x_112g16gkg_095x_体重70kg想定
source: <84g (1.2g/kg): 1.10x, 112+g (1.6g/kg): 0.95x (assuming a 70kg body weight)
es: <84 g (1,2 g/kg): 1,10x, 112+ g (1,6 g/kg): 0,95x (suponiendo un peso corporal de 70 kg)
ja: <84g(1.2g/kg): 1.10x, 112+g(1.6g/kg): 0.95x (体重70kg想定)

# general_queryquery_ジム
source: ?query=$query Jim
es: ?consulta=$consulta Jim
ja: ?query=$query ジム

# subscription_一時停止エラー_e
source: ❌ Pause Error: $e
es: ❌ Error de pausa: $e
ja: ❌ 一時停止エラー: $e

# gym_クーポン_gymcampaignCouponCode
source: Coupon: ${gym.campaignCouponCode!}
es: Cupón: ${gym.campaignCouponCode!}
ja: クーポン: ${gym.campaignCouponCode!}

# general_既存workout_id_workoutId
source: Existing workout_id: $workoutId
es: ID de entrenamiento existente: $workoutId
ja: 既存workout_id: $workoutId

# general_AI分析_キャッシュヒット即座に応答
source: ✅ AI analysis: cache hit (instant response)
es: ✅ Análisis de IA: acierto de caché (respuesta instantánea)
ja: ✅ AI分析: キャッシュヒット（即座に応答）

# general_京都
source: Kyoto
es: Kioto
ja: 京都

# workout_メニューを保存しました
source: Menu saved
es: Menú guardado
ja: メニューを保存しました

# general_累計
source: Cumulative total
es: Total acumulado
ja: 累計

# gym_24時間営業のフィットネスジム初心者から上級者まで幅広く対応
source: A 24-hour fitness gym that caters to a wide range of fitness levels, from beginners to advanced athletes.
es: Un gimnasio abierto las 24 horas que atiende a una amplia gama de niveles de condición física, desde principiantes hasta atletas avanzados.
ja: 24時間営業のフィットネスジム。初心者から上級者まで幅広く対応。

# general_Firestoreクエリスキップキャッシュヒット_cacheKey
source: ✅ Firestore query skip (cache hit): $cacheKey
es: ✅ Omisión de consulta de Firestore (acceso a caché): $cacheKey
ja: ✅ Firestoreクエリスキップ（キャッシュヒット）: $cacheKey

# workout_テクニックのポイント
source: Technique points
es: Puntos técnicos
ja: テクニックのポイント

# general_01_休息_23_軽い運動_46_中程度の運動_78_きつい運動_910_最大努力
source: 0-1: Rest 2-3: Light exercise 4-6: Moderate exercise 7-8: Hard exercise 9-10: Maximum effort
es: 0-1: Descanso 2-3: Ejercicio ligero 4-6: Ejercicio moderado 7-8: Ejercicio intenso 9-10: Esfuerzo máximo
ja: 0-1: 休息 2-3: 軽い運動 4-6: 中程度の運動 7-8: きつい運動 9-10: 最大努力

# profile_返品返金について
source: Returns and Refunds
es: Devoluciones y reembolsos
ja: 返品・返金について

# general_GYM_MATCH_へようこそ
source: Welcome to GYM MATCH!
es: ¡Bienvenido a GYM MATCH!
ja: GYM MATCH へようこそ！

# gym_東京都台東区上野121212
source: 12-12-12 Ueno, Taito-ku, Tokyo
es: 12-12-12 Ueno, Taito-ku, Tokio
ja: 東京都台東区上野12-12-12

# subscription_App_Store設定からtargetPlanNameへ変更してください
source: Please change it to $targetPlanName in App Store settings
es: Cámbielo a $targetPlanName en la configuración de la App Store.
ja: App Store設定から$targetPlanNameへ変更してください

# general_GeolocatorgetCurrentPosition_呼び出し中
source: 🔄 Calling Geolocator.getCurrentPosition()...
es: 🔄 Llamando a Geolocator.getCurrentPosition()...
ja: 🔄 Geolocator.getCurrentPosition() 呼び出し中...

# general_30日間で5記録達成で習慣化継続率80
source: Achieve 5 records in 30 days and make it a habit! (80% retention rate)
es: ¡Consigue 5 récords en 30 días y conviértelo en un hábito! (Tasa de retención del 80%)
ja: 30日間で5記録達成で習慣化！（継続率80%）

# workout_は除く_回数表記から数値のみ抽出してください
source: ) - Extract only the numerical value from the frequency notation (
es: ) - Extraer únicamente el valor numérico de la notación de frecuencia (
ja: は除く） - 回数表記から数値のみ抽出してください（

# workout_タイムアウト_科学的根拠ベースのメニューを生成
source: Time Out - Evidence-Based Menu Generation
es: Tiempo de espera: generación de menús basada en evidencia
ja: タイムアウト - 科学的根拠ベースのメニューを生成

# workout_オフ日を保存_selectedDate
source: 📴 Save the off date: $_selectedDate
es: 📴 Guarda la fecha de cierre: $_selectedDate
ja: 📴 オフ日を保存: $_selectedDate

# general_セット追加で筋肥大効果が向上しますSchoenfeld_2017
source: ]}Adding sets increases the hypertrophy effect (Schoenfeld 2017).
es: ]}Añadir series aumenta el efecto de hipertrofia (Schoenfeld 2017).
ja: ]}セット追加で、筋肥大効果が向上します（Schoenfeld 2017）。

# profile_お問い合わせへの回答には数日かかる場合がございます予めご了承ください
source: *Please note that it may take several days for us to respond to your inquiry.
es: *Tenga en cuenta que puede llevar varios días para que respondamos a su consulta.
ja: ※お問い合わせへの回答には数日かかる場合がございます。予めご了承ください。
