Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# subscription_7日間プレミアムトライアル開始
source: ✅ Start your 7-day premium trial
es: ✅ Comienza tu prueba premium de 7 días
ja: ✅ 7日間プレミアムトライアル開始

# workout_return_Step_4_AI分析処理クレジット消費含む_setState_isLoading_t
source: ); } return; } } / ======================================= / 🤖 Step 4: AI analysis processing (including credit consumption) / =========================================== setState(() { _isLoading = true; _analysisResult = null; }); try { print(
es: ); } return; } } / ========================================= / 🤖 Paso 4: Procesamiento del análisis de IA (incluido el consumo de crédito) / =============================================== setState(() { _isLoading = true; _analysisResult = null; }); try { print(
ja: ); } return; } } // ======================================== // 🤖 Step 4: AI分析処理(クレジット消費含む) // ======================================== setState(() { _isLoading = true; _analysisResult = null; }); try { print(

# error_メッセージ送信に失敗しました
source: Message sending failed
es: Error en el envío del mensaje
ja: メッセージ送信に失敗しました

# workout_トレーニング日
source: Training Day
es: Día de entrenamiento
ja: トレーニング日

# subscription_4_GYM_MATCHを選択
source: 4. Select "GYM MATCH"
es: 4. Selecciona "GYM MATCH"
ja: 4. 「GYM MATCH」を選択

# general_福岡_24時間
source: Fukuoka 24 hours
es: Fukuoka 24 horas
ja: 福岡 24時間

# general_エネルギッシュ系
source: Energetic
es: Energético
ja: エネルギッシュ系

# general_バージョン管理ドキュメントが存在しません
source: ⚠️ No version control documentation exists
es: ⚠️ No existe documentación de control de versiones
ja: ⚠️ バージョン管理ドキュメントが存在しません

# general_この地域にはジムが見つかりませんでした
source: No gyms found in this area
es: No se encontraron gimnasios en esta zona
ja: この地域にはジムが見つかりませんでした

# general_4872時間
source: 48-72 hours
es: 48-72 horas
ja: 48-72時間

# general_最新バージョンに更新
source: Update to the latest version
es: Actualizar a la última versión
ja: 最新バージョンに更新

# workout_基本種目
source: Basic Events
es: Eventos básicos
ja: 基本種目

# workout_ds回
source: (\d+)\s* times
es: (\d+)\s* veces
ja: (\d+)\s*回

# general_Firestore_保留中の書き込みありオフライン_durationms
source: 📴 [Firestore] Pending writes (offline) - ${duration}ms
es: 📴 [Firestore] Escrituras pendientes (sin conexión): ${duration}ms
ja: 📴 [Firestore] 保留中の書き込みあり（オフライン） - ${duration}ms

# workout_バイブレーション成功
source: ✅ Vibration successful
es: ✅ Vibración exitosa
ja: ✅ バイブレーション成功

# workout_recordweightkg_recordreps回
source: ${record.weight}kg × ${record.reps} times
es: ${record.weight}kg × ${record.reps} veces
ja: ${record.weight}kg × ${record.reps}回

# profile_第3条禁止事項
source: Article 3 (Prohibited matters)
es: Artículo 3 (Materias prohibidas)
ja: 第3条（禁止事項）

# general_統計計算完了
source: ✅ Statistical calculation completed:
es: ✅ Cálculo estadístico completado:
ja: ✅ 統計計算完了:

# workout_オフライン保存エラー_e_1
source: ❌ Offline save error: $e
es: ❌ Error al guardar sin conexión: $e
ja: ❌ オフライン保存エラー: $e

# general_前回のトレーニングから2日経過しました_今日もトレーニングしませんか
source: It's been two days since your last workout. Would you like to workout again today?
es: Han pasado dos días desde tu último entrenamiento. ¿Te gustaría volver a entrenar hoy?
ja: 前回のトレーニングから2日経過しました。 今日もトレーニングしませんか？

# general_動画を見てAI機能を使う
source: Watch videos and use AI features
es: Mira videos y usa funciones de IA
ja: 動画を見てAI機能を使う

# general_AI回数を追加
source: Add AI count
es: Añadir recuento de IA
ja: AI回数を追加

# general_canUseAI_Premium残回数_remaining
source: 🔍 [canUseAI] Premium remaining: $remaining
es: 🔍 [canUseAI] Prima restante: $restante
ja: 🔍 [canUseAI] Premium残回数: $remaining

# general_週3回
source: 3 times a week
es: 3 veces por semana
ja: 週3回

# general_プレート不要_バーのみ
source: No plate required (bar only)
es: No se requiere plato (solo barra)
ja: プレート不要 (バーのみ)

# general_今月のAI利用回数3回を使い切りました
source: I have used up all my AI usage times for this month (3 times).
es: He agotado todos mis tiempos de uso de IA para este mes (3 veces).
ja: 今月のAI利用回数（3回）を使い切りました

# workout_exerciseNameの一括入力
source: Bulk input of $exerciseName
es: Entrada masiva de $exerciseName
ja: $exerciseNameの一括入力

# general_トレーニングを記録して_進捗を可視化しましょう
source: Record your training and visualize your progress
es: Registra tu entrenamiento y visualiza tu progreso
ja: トレーニングを記録して、 進捗を可視化しましょう

# workout_成長予測
source: Growth forecast
es: Previsión de crecimiento
ja: 成長予測

# workout_あなたはプロのパーソナルトレーナーです筋トレ上級者向けのtargetPartsisEmpty
source: You are a professional personal trainer. "${targetParts.isEmpty ?
es: Eres un entrenador personal profesional. "${targetParts.isEmpty ?
ja: あなたはプロのパーソナルトレーナーです。筋トレ上級者向けの「${targetParts.isEmpty ?

# error_GPS取得失敗_デフォルト位置東京駅を使用
source: ⚠️ GPS acquisition failed → Use default location (Tokyo Station)
es: ⚠️ Error en la adquisición de GPS → Usar ubicación predeterminada (estación de Tokio)
ja: ⚠️ GPS取得失敗 → デフォルト位置（東京駅）を使用

# gym_フリーウェイトエリア
source: Free Weight Area
es: Área de peso libre
ja: フリーウェイトエリア

# workout_WorkoutLogScreen_認証初期化開始
source: 📱 [WorkoutLogScreen] Authentication initialization started
es: 📱 [WorkoutLogScreen] Se inició la inicialización de la autenticación
ja: 📱 [WorkoutLogScreen] 認証初期化開始

# workout_duration秒
source: ${duration} seconds
es: ${duration} segundos
ja: ${duration}秒

# workout_AIコーチデータ初期化完了_setslengthセット生成
source: ✅ AI coach data initialization completed: ${_sets.length} sets generated
es: ✅ Inicialización de datos del entrenador de IA completada: ${_sets.length} conjuntos generados
ja: ✅ AIコーチデータ初期化完了: ${_sets.length}セット生成

# general_ℹ_Web環境のため広告なし
source: ℹ️ No ads due to web environment
es: ℹ️ Sin anuncios debido al entorno web
ja: ℹ️ Web環境のため広告なし

# error_購入処理に失敗しました_もう一度お試しください
source: Purchase failed. Please try again.
es: Compra fallida. Inténtalo de nuevo.
ja: 購入処理に失敗しました。 もう一度お試しください。

# general_今月のKPI
source: This month's KPI
es: KPI de este mes
ja: 今月のKPI

# workout_JSONパースエラー_e
source: ❌ JSON Parse Error: $e
es: ❌ Error de análisis de JSON: $e
ja: ❌ JSONパースエラー: $e

# error_統計データの計算エラー_e
source: ❌ Statistical data calculation error: $e
es: ❌ Error de cálculo de datos estadísticos: $e
ja: ❌ 統計データの計算エラー: $e

# general_アップロード完了_url
source: ✅ Upload completed: $url
es: ✅ Carga completada: $url
ja: ✅ アップロード完了: $url

# personalFactor_トレーニング経験年数
source: Years of training experience
es: Años de experiencia en formación
ja: トレーニング経験年数

# general_削除対象の記録が見つかりませんでした
source: No records found to delete
es: No se encontraron registros para eliminar
ja: 削除対象の記録が見つかりませんでした

# general_時空間スコアでソート完了_profileslength件
source: ✅ Sorted by spatiotemporal score: ${profiles.length}
es: ✅ Ordenado por puntuación espaciotemporal: ${profiles.length}
ja: ✅ 時空間スコアでソート完了: ${profiles.length}件

# profile_販売価格以外の必要料金
source: Required fees other than the sales price
es: Tarifas requeridas distintas al precio de venta
ja: 販売価格以外の必要料金

# workout_minutes分remainingSeconds_0
source: $minutes minutes${remainingSeconds > 0 ?
es: $minutos minutos${segundosrestantes > 0 ?
ja: $minutes分${remainingSeconds > 0 ?

# gym_オレンジセオリーフィットネス_赤坂
source: Orange Theory Fitness Akasaka
es: Gimnasio Orange Theory Akasaka
ja: オレンジセオリーフィットネス 赤坂

# subscription_一時停止チェックエラー_e
source: ❌ Pause check error: $e
es: ❌ Error de comprobación de pausa: $e
ja: ❌ 一時停止チェックエラー: $e

# workout_種目1種目名
source: **Event 1: Event name**
es: **Evento 1: Nombre del evento**
ja: **種目1：種目名**

# workout_サーバーからserverSnapshotdocslength件読み込み
source: ✅ Loaded ${serverSnapshot.docs.length} documents from the server
es: ✅ Se cargaron ${serverSnapshot.docs.length} documentos desde el servidor
ja: ✅ サーバーから${serverSnapshot.docs.length}件読み込み

# general_高頻度回復時間に注意ボリューム統制すれば問題なし
source: High frequency: Be careful of recovery time. Control your volume and you'll be fine.
es: Alta frecuencia: Ten cuidado con el tiempo de recuperación. Controla el volumen y todo irá bien.
ja: 高頻度：回復時間に注意。ボリューム統制すれば問題なし

# profile_有料サブスクリプションプランPremiumPro
source: • Paid subscription plans (Premium, Pro)
es: • Planes de suscripción de pago (Premium, Pro)
ja: • 有料サブスクリプションプラン（Premium、Pro）

# gym_個室トレーニングルーム
source: Private training room
es: Sala de entrenamiento privada
ja: 個室トレーニングルーム

# workout_Phase_7_年齢取得エラー_e
source: ⚠️ [Phase 7] Error getting age: $e
es: ⚠️ [Fase 7] Error al obtener la edad: $e
ja: ⚠️ [Phase 7] 年齢取得エラー: $e

# general_愛媛
source: Ehime
ja: 愛媛

# general_フィットネス
source: Fitness
es: Aptitud física
ja: フィットネス

# workout_プラトー検出が有効な場合Firestoreから履歴を取得_Phase_75_必須データのバリデーショ
source: ); / If plateau detection is enabled, retrieve history from Firestore. / 🆕 Phase 7.5: Validate required data. if (_userAge == null) { ScaffoldMessenger.of(context).showSnackBar( SnackBar( content: Text(
es: ); / Si la detección de meseta está habilitada, recuperar el historial de Firestore. / 🆕 Fase 7.5: Validar los datos requeridos. if (_userAge == null) { ScaffoldMessenger.of(context).showSnackBar( SnackBar( content: Text(
ja: ); // プラトー検出が有効な場合、Firestoreから履歴を取得 // 🆕 Phase 7.5: 必須データのバリデーション if (_userAge == null) { ScaffoldMessenger.of(context).showSnackBar( SnackBar( content: Text(

# error_Firestoreからのクレジット取得失敗ローカルを使用_e
source: ⚠️ Failed to get credit from Firestore, using local: $e
es: ⚠️ No se pudo obtener crédito de Firestore al usar local: $e
ja: ⚠️ Firestoreからのクレジット取得失敗、ローカルを使用: $e

# general_AI追加パック消費_1_残り_addonUsage_1
source: ✅ AI add-on pack consumed: -1 (remaining: ${addonUsage - 1})
es: ✅ Paquete complementario de IA consumido: -1 (restante: ${addonUsage - 1})
ja: ✅ AI追加パック消費: -1 (残り: ${addonUsage - 1})

# general_位置情報サービス_有効
source: ✅ Location Services: Enabled
es: ✅ Servicios de ubicación: habilitados
ja: ✅ 位置情報サービス: 有効

# workout_重量s男性sddddkg
source: Weight [::]?\s*(?:Male [::]?\s*)?(\d+(?:\.\d+)?)(?:-\d+(?:\.\d+)?)?(?:kg)?
es: Peso [::]?\s*(?:Hombre [::]?\s*)?(\d+(?:\.\d+)?)(?:-\d+(?:\.\d+)?)?(?:kg)?
ja: 重量[:：]?\s*(?:男性[:：]?\s*)?(\d+(?:\.\d+)?)(?:-\d+(?:\.\d+)?)?(?:kg)?

# general_購入履歴を復元しました
source: ✅ Your purchase history has been restored
es: ✅ Tu historial de compras ha sido restaurado
ja: ✅ 購入履歴を復元しました

# general_HomeScreen_対象日付を受信_targetDateyeartargetDatemonthta
source: 📅 [HomeScreen] Receive target dates: ${targetDate.year}/${targetDate.month}/${targetDate.day}
es: 📅 [Pantalla de inicio] Recibir fechas objetivo: ${targetDate.year}/${targetDate.month}/${targetDate.day}
ja: 📅 [HomeScreen] 対象日付を受信: ${targetDate.year}/${targetDate.month}/${targetDate.day}

# general_1時間の利用上限MAX_AI_CALLS_PER_HOUR回に達しました_しばらくお待ちください
source: You have reached your hourly call limit (${MAX_AI_CALLS_PER_HOUR}). Please wait a moment.
es: Has alcanzado tu límite de llamadas por hora (${MAX_AI_CALLS_PER_HOUR}). Por favor, espera un momento.
ja: 1時間の利用上限（${MAX_AI_CALLS_PER_HOUR}回）に達しました。 しばらくお待ちください。

# general_オンボーディングをリセットしました_アプリを再起動してください
source: ✅ Onboarding has been reset. Please restart the app.
es: ✅ Se ha restablecido la incorporación. Reinicia la aplicación.
ja: ✅ オンボーディングをリセットしました アプリを再起動してください

# general_達成率
source: Achievement rate
es: Tasa de logros
ja: 達成率

# workout_筋トレのため有酸素時間集計から除外
source: 💪 Excluded from cardio time calculation due to strength training
es: 💪 Excluido del cálculo del tiempo de cardio debido al entrenamiento de fuerza
ja: 💪 筋トレのため有酸素時間集計から除外

# general_1RM_1_Rep_Max_は1回だけ持ち上げられる最大重量です
source: 1RM (1 Rep Max) is the maximum weight that can be lifted just once.
es: 1RM (1 repetición máxima) es el peso máximo que se puede levantar una sola vez.
ja: 1RM (1 Rep Max) は、1回だけ持ち上げられる最大重量です。

# error_報告状況読み込みエラー_e
source: ❌ Error loading report status: $e
es: ❌ Error al cargar el estado del informe: $e
ja: ❌ 報告状況読み込みエラー: $e

# profile_トレーニング記録の管理
source: • Training record management
es: • Gestión de registros de formación
ja: • トレーニング記録の管理

# gym_総合スポーツクラブプールやスタジオプログラムも充実
source: A comprehensive sports club with a pool and a full range of studio programs.
es: Un club deportivo integral con piscina y una gama completa de programas de estudio.
ja: 総合スポーツクラブ。プールやスタジオプログラムも充実。

# general_プラン変更機能を無効化
source: ⚠️ Disable plan change feature
es: ⚠️ Deshabilitar la función de cambio de plan
ja: ⚠️ プラン変更機能を無効化

# general_AI科学的トレーニングコーチ
source: AI Scientific Training Coach
es: Entrenador de formación científica en IA
ja: AI科学的トレーニングコーチ

# general_Firestore更新完了
source: ✅ Firestore update complete
es: ✅ Actualización de Firestore completada
ja: ✅ Firestore更新完了

# workout_トレーニング記録_匿名認証成功
source: ✅ Training Record: Anonymous Authentication Successful
es: ✅ Registro de entrenamiento: Autenticación anónima exitosa
ja: ✅ トレーニング記録: 匿名認証成功

# general_トライアル状態確認完了
source: ✅ Trial status confirmed
es: ✅ Estado de prueba confirmado
ja: ✅ トライアル状態確認完了

# general_Firestore_サーバー接続成功_durationms
source: 🌐 [Firestore] Server connection successful ✅ - ${duration}ms
es: 🌐 [Firestore] Conexión al servidor exitosa ✅ - ${duration}ms
ja: 🌐 [Firestore] サーバー接続成功 ✅ - ${duration}ms

# general_高信頼性
source: High reliability
es: Alta confiabilidad
ja: 高信頼性

# gym_ボディメイクジム24_上野
source: Body Make Gym 24 Ueno
es: Gimnasio Body Make 24 Ueno
ja: ボディメイクジム24 上野

# error_テキストシェアエラー_e
source: ❌ Text Share Error: $e
es: ❌ Error al compartir texto: $e
ja: ❌ テキストシェアエラー: $e

# general_達成済み
source: Completed
es: Terminado
ja: 達成済み

# general_10回の自己記録更新
source: 10 new personal records
es: 10 nuevos récords personales
ja: 10回の自己記録更新

# profile_マッチングリクエスト送信は_Proプラン限定機能です
source: Sending a matching request is a feature exclusive to the Pro plan.
es: Enviar una solicitud de coincidencia es una función exclusiva del plan Pro.
ja: マッチングリクエスト送信は Proプラン限定機能です

# workout_setactualReps_settargetReps秒
source: ${set.actualReps ?? set.targetReps} seconds
es: ${set.actualReps ?? set.targetReps} segundos
ja: ${set.actualReps ?? set.targetReps}秒

# workout_成長予測開始
source: 🚀 Growth prediction begins...
es: 🚀 Comienza la predicción de crecimiento...
ja: 🚀 成長予測開始...

# general_非常に高強度のトレーニングでした_今日は完全休養を推奨します睡眠8時間以上高タンパク質食ストレッチを
source: This was a very intense workout. Today, I recommend complete rest. Make sure to get at least 8 hours of sleep, eat a high-protein diet, and focus on stretching.
es: Este fue un entrenamiento muy intenso. Hoy recomiendo descansar completamente. Asegúrate de dormir al menos 8 horas, seguir una dieta rica en proteínas y concentrarte en los estiramientos.
ja: 非常に高強度のトレーニングでした。 今日は完全休養を推奨します。睡眠8時間以上、高タンパク質食、ストレッチを重視してください。

# general_投稿手順
source: Submission Procedure
es: Procedimiento de presentación
ja: 投稿手順

# gym_清潔さ
source: Cleanliness
es: Limpieza
ja: 清潔さ

# gym_minutesAgo分前更新
source: Updated $minutesAgo minutes ago
es: Actualizado hace $minutesAgo minutos atrás
ja: $minutesAgo分前更新

# general_マッサージ
source: massage
es: masaje
ja: マッサージ

# error_アラート設定更新エラー_e
source: ❌ Alert settings update error: $e
es: ❌ Error de actualización de la configuración de alertas: $e
ja: ❌ アラート設定更新エラー: $e

# personalFactor_024の範囲で入力してください
source: Please enter a number between 0 and 24
es: Por favor, introduzca un número entre 0 y 24
ja: 0〜24の範囲で入力してください

# general_改善の余地があります以下の推奨事項に従うことでより効果的なトレーニングが可能です
source: There is room for improvement. By following these suggestions, you can make your training more effective.
es: Hay margen de mejora. Siguiendo estas sugerencias, podrás mejorar tu entrenamiento.
ja: 改善の余地があります。以下の推奨事項に従うことで、より効果的なトレーニングが可能です。

# error_ワークアウトログ保存エラー_e
source: ❌ Workout log save error: $e
es: ❌ Error al guardar el registro de entrenamiento: $e
ja: ❌ ワークアウトログ保存エラー: $e

# general_メッセージを送信して会話を始めましょう
source: Send a message and start a conversation
es: Envía un mensaje e inicia una conversación.
ja: メッセージを送信して会話を始めましょう

# general_日付範囲
source: Date range
es: Rango de fechas
ja: 日付範囲

# profile_自己紹介やトレーニングの希望を書いてください
source: Please introduce yourself and your training needs.
es: Por favor, preséntese y explique sus necesidades de formación.
ja: 自己紹介やトレーニングの希望を書いてください

# workout_bodyPart_PR記録
source: $bodyPart - PR record
es: $bodyPart - Registro de relaciones públicas
ja: $bodyPart - PR記録

# error_混雑度監視開始エラー_e
source: ❌ Error starting congestion monitoring: $e
es: ❌ Error al iniciar la monitorización de congestión: $e
ja: ❌ 混雑度監視開始エラー: $e

# general_セッション履歴を見る
source: View session history
es: Ver el historial de sesiones
ja: セッション履歴を見る

# subscription_残り_remainingDays日間プレミアム機能をお楽しみください
source: Enjoy premium features for $_remainingDays remaining
es: Disfrute de funciones premium por $_remainingDays restantes
ja: 残り$_remainingDays日間、プレミアム機能をお楽しみください

# general_PO管理者専用のログイン画面です_アクセスコードをお持ちの方はアクセスコードタブから_ログインしてく
source: This is the login screen for PO administrators only. If you have an access code, please log in from the "Access Code" tab.
es: Esta es la pantalla de inicio de sesión exclusiva para administradores de órdenes de compra. Si tiene un código de acceso, inicie sesión desde la pestaña "Código de acceso".
ja: PO管理者専用のログイン画面です アクセスコードをお持ちの方は「アクセスコード」タブから ログインしてください

# general_goalnameを編集
source: Edit ${goal.name}
es: Editar ${goal.name}
ja: ${goal.name}を編集

# general_経過日数_totalDaysFromStart日
source: 📅 Number of days elapsed: $totalDaysFromStart
es: 📅 Número de días transcurridos: $totalDaysFromStart
ja: 📅 経過日数: $totalDaysFromStart日

# general_バナー広告が開かれました
source: 📱 Banner ad opened
es: 📱 Anuncio de banner abierto
ja: 📱 バナー広告が開かれました

# general_ディロード週を実施ボリューム3050削減
source: Deload week (30-50% reduction in volume)
es: Semana de descarga (reducción del volumen del 30-50%)
ja: ディロード週を実施（ボリューム30-50%削減）

# gym_家族で通える総合スポーツクラブキッズスクールも充実
source: A comprehensive sports club that the whole family can attend. There is also a comprehensive kids' school.
es: Un club deportivo integral al que puede asistir toda la familia. También hay una escuela infantil integral.
ja: 家族で通える総合スポーツクラブ。キッズスクールも充実。

# general_RevenueCatキャッシュを無効化中
source: 🔄 Invalidating RevenueCat cache...
es: 🔄 Invalidando caché de RevenueCat...
ja: 🔄 RevenueCatキャッシュを無効化中...

# workout_ネットワークチェックエラー_e
source: ⚠️ Network check error: $e
es: ⚠️ Error de comprobación de red: $e
ja: ⚠️ ネットワークチェックエラー: $e

# gym_レビュー投稿はPremiumProプラン限定機能です
source: Posting reviews is a feature available only to Premium/Pro plans.
es: Publicar reseñas es una función disponible solo para los planes Premium/Pro.
ja: レビュー投稿はPremium/Proプラン限定機能です。
