Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# error_紹介バナーチェックエラー_e
source: Referral banner check error: $e
es: Error de verificación del banner de referencia: $e
ja: 紹介バナーチェックエラー: $e

# general_今日のAI提案
source: 💡 Today's AI Suggestion
es: 💡 Sugerencia de IA de hoy
ja: 💡 今日のAI提案

# general_currentStreak日連続
source: $currentStreak consecutive days
es: $currentStreak días consecutivos
ja: $currentStreak日連続

# general_バナー広告ID_iosBannerAdUnitId
source: 📱 Banner Ad ID: $_iosBannerAdUnitId
es: 📱 ID de anuncio de banner: $_iosBannerAdUnitId
ja: 📱 バナー広告ID: $_iosBannerAdUnitId

# error_Web位置情報エラー_webError
source: ❌ Web location error: $webError
es: ❌ Error de ubicación web: $webError
ja: ❌ Web位置情報エラー: $webError

# workout_休憩_restSeconds秒
source: Rest $_restSeconds seconds
es: Descanso $_restSeconds segundos
ja: 休憩 $_restSeconds秒

# general_既存ユーザー_authcurrentUseruid
source: ✅ Existing user: ${auth.currentUser?.uid}
es: ✅ Usuario existente: ${auth.currentUser?.uid}
ja: ✅ 既存ユーザー: ${auth.currentUser?.uid}

# general_栃木
source: Tochigi
ja: 栃木

# general_activeMembers名
source: $activeMembers name
es: $nombre de miembros activos
ja: $activeMembers名

# subscription_条件を達成してプレミアム7日間無料体験
source: Meet the conditions and get a 7-day free premium trial
es: Cumpla las condiciones y obtenga una prueba premium gratuita de 7 días
ja: 条件を達成してプレミアム7日間無料体験

# general_canEarnCreditFromAd_有料プランのため広告不要
source: 🔍 [canEarnCreditFromAd] Paid plan, no ads required
es: 🔍 [canEarnCreditFromAd] Plan pago, no requiere anuncios
ja: 🔍 [canEarnCreditFromAd] 有料プランのため広告不要

# subscription_メッセージング機能_1
source: Messaging Features
es: Funciones de mensajería
ja: メッセージング機能

# workout_WorkoutLogScreen_自動ログイン成功_userCredentialuseruid
source: ✅ [WorkoutLogScreen] Auto login successful: ${userCredential.user?.uid}
es: ✅ [WorkoutLogScreen] Inicio de sesión automático exitoso: ${userCredential.user?.uid}
ja: ✅ [WorkoutLogScreen] 自動ログイン成功: ${userCredential.user?.uid}

# workout_as_Listdynamic_if_exercises_null_指定種目を探す_for_final
source: ] as List<dynamic>?; if (exercises != null) { // Search for the specified exercise for (final exercise in exercises) { final exerciseMap = exercise as Map<String, dynamic>; if (exerciseMap[
es: ] como Lista<dinámica>?; if (ejercicios != null) { // Buscar el ejercicio especificado for (ejercicio final en ejercicios) { ejercicio finalMap = ejercicio como Mapa<Cadena, dinámico>; if (ejercicioMap[
ja: ] as List<dynamic>?; if (exercises != null) { // 指定種目を探す for (final exercise in exercises) { final exerciseMap = exercise as Map<String, dynamic>; if (exerciseMap[

# workout_成長予測_広告視聴可能_canEarnFromAd
source: 🔍 [Growth Forecast] Ad Earnable: $canEarnFromAd
es: 🔍 [Pronóstico de crecimiento] Anuncios obtenibles: $canEarnFromAd
ja: 🔍 [成長予測] 広告視聴可能: $canEarnFromAd

# general_AI使用回数をリセット
source: Reset AI usage count
es: Restablecer el recuento de uso de IA
ja: AI使用回数をリセット

# gym_東京都渋谷区恵比寿888
source: 8-8-8 Ebisu, Shibuya-ku, Tokyo
es: 8-8-8 Ebisu, Shibuya-ku, Tokio
ja: 東京都渋谷区恵比寿8-8-8

# general_営業時間臨時休業のお知らせ
source: Notice of business hours and temporary closures
es: Aviso de horario comercial y cierres temporales
ja: 営業時間・臨時休業のお知らせ

# general_システムをONにしてください
source: Turn on the system
es: Encienda el sistema
ja: システムをONにしてください

# general_累計10000kg達成
source: Achieved a cumulative total of 10,000kg
es: Se logró un total acumulado de 10.000 kg.
ja: 累計10,000kg達成

# general_友達の紹介コードを入力して_特典をゲットしよう
source: Enter your friend's referral code to receive special rewards!
es: ¡Ingresa el código de referencia de tu amigo para recibir recompensas especiales!
ja: 友達の紹介コードを入力して 特典をゲットしよう！

# general_歯科
source: dentistry
es: odontología
ja: 歯科

# subscription_ℹ_トライアル既に開始済み
source: ℹ️ Trial has already started
es: ℹ️ El juicio ya ha comenzado
ja: ℹ️ トライアル既に開始済み

# general_テンプレートをコピー
source: Copy Template
es: Copiar plantilla
ja: テンプレートをコピー

# profile_Proプランにアップグレード
source: Upgrade to Pro plan
es: Actualizar al plan Pro
ja: Proプランにアップグレード

# workout_ユーザーが未ログイン
source: ❌ User not logged in
es: ❌ Usuario no conectado
ja: ❌ ユーザーが未ログイン

# profile_本アプリのトレーニング提案は参考情報であり医学的アドバイスではありません運動を始める前に医師に相談し
source: • The training suggestions in this app are for informational purposes only and are not medical advice. Consult your doctor before beginning any exercise program.
es: Las sugerencias de entrenamiento de esta aplicación son solo informativas y no constituyen asesoramiento médico. Consulte a su médico antes de comenzar cualquier programa de ejercicios.
ja: • 本アプリのトレーニング提案は参考情報であり、医学的アドバイスではありません。運動を始める前に医師に相談してください。

# gym_ヨガルーム
source: Yoga Room
es: Sala de yoga
ja: ヨガルーム

# profile_タップして画像を変更
source: Tap to change image
es: Toque para cambiar la imagen
ja: タップして画像を変更

# general_今月の実績
source: This month's results
es: Resultados de este mes
ja: 今月の実績

# workout_提案形式_各種目について以下の情報を含めてください_種目名_セット数_回数_休憩時間_ポイント注意事
source: )} [Proposal Format] Please include the following information for each exercise: - Exercise name - Number of sets - Repetitions - Rest time - Important points and notes [Requirements] - For beginners to intermediate exercisers - Can be done at the gym - Can be completed in 45-60 minutes - Effective training - Brief in Japanese Please propose a menu.
es: )} [Formato de propuesta] Incluya la siguiente información para cada ejercicio: - Nombre del ejercicio - Número de series - Repeticiones - Tiempo de descanso - Puntos y notas importantes [Requisitos] - Para usuarios de nivel principiante a intermedio - Se puede realizar en el gimnasio - Se puede completar en 45-60 minutos - Entrenamiento efectivo - Resumen en japonés Proponga un menú.
ja: )} 【提案形式】 各種目について以下の情報を含めてください： - 種目名 - セット数 - 回数 - 休憩時間 - ポイント・注意事項 【条件】 - 初心者〜中級者向け - ジムで実施可能 - 45-60分で完了 - 効率的に鍛えられる - 日本語で簡潔に メニューを提案してください。

# general_体育館
source: gym
es: gimnasia
ja: 体育館

# error_広告の読み込みに失敗しましたもう一度お試しください
source: Ad failed to load. Please try again.
es: No se pudo cargar el anuncio. Inténtalo de nuevo.
ja: 広告の読み込みに失敗しました。もう一度お試しください。

# workout_新規記録を作成
source: ➕ Create a new record
es: ➕ Crear un nuevo registro
ja: ➕ 新規記録を作成

# general_ユーザーエンゲージメント向上
source: ✅ Increased user engagement
es: ✅ Mayor participación del usuario
ja: ✅ ユーザーエンゲージメント向上

# workout_カーディオ
source: Cardio
ja: カーディオ

# general_1_上記のボタンで任意のプランに変更できます
source: 1. You can change to any plan using the button above.
es: 1. Puedes cambiar a cualquier plan usando el botón de arriba.
ja: 1. 上記のボタンで任意のプランに変更できます

# general_以前使っていた筋トレアプリを教えてください
source: Please tell me what workout app you used before.
es: Por favor, dime qué aplicación de entrenamiento usaste antes.
ja: 以前使っていた筋トレアプリを教えてください

# gym_営業中2300まで
source: Open (until 23:00)
es: Abierto (hasta las 23:00)
ja: 営業中（23:00まで）

# general_ℹ_有料プランのため広告なし
source: ℹ️ No ads due to paid plan
es: ℹ️ Sin anuncios gracias al plan pago
ja: ℹ️ 有料プランのため広告なし

# general_ヒント_端末の設定で位置情報サービスを有効にしてください
source: 💡 Tip: Enable location services in your device settings
es: 💡 Consejo: Habilita los servicios de ubicación en la configuración de tu dispositivo
ja: 💡 ヒント: 端末の設定で位置情報サービスを有効にしてください

# general_青森
source: Aomori
ja: 青森

# gym_専属トレーナー
source: Personal trainer
es: Entrenador personal
ja: 専属トレーナー

# gym_GYM_MATCHアプリで詳細を見る
source: 📱 Learn more on the GYM MATCH app
es: 📱Obtén más información en la aplicación GYM MATCH
ja: 📱 GYM MATCHアプリで詳細を見る

# workout_AI機能1回分を獲得しました
source: 🎁 You've earned one AI feature!
es: ¡Has ganado una función de IA!
ja: 🎁 AI機能1回分を獲得しました!

# general_申込済
source: Application completed
es: Solicitud completada
ja: 申込済

# general_今月の上限に達しました
source: This month's limit has been reached
es: Se ha alcanzado el límite de este mes.
ja: 今月の上限に達しました

# subscription_永年Proプラン保持者
source: ✅ Lifetime Pro plan holder
es: ✅ Titular del plan Lifetime Pro
ja: ✅ 永年Proプラン保持者

# general_7日間
source: 7 days
es: 7 días
ja: 7日間

# general_カレンダー表示とセッション予約管理
source: Calendar view and session reservation management
es: Vista de calendario y gestión de reservas de sesiones
ja: カレンダー表示とセッション予約管理

# profile_プラン内容
source: Plan details
es: Detalles del plan
ja: プラン内容

# gym_画像をアップロードしました
source: Image uploaded
es: Imagen cargada
ja: 画像をアップロードしました

# gym_タイトル
source: title
es: título
ja: タイトル

# general_ドキュメントが見つかりません
source: ❌ No documentation found
es: ❌ No se encontró documentación
ja: ❌ ドキュメントが見つかりません

# general_あなたがよく行くジムで同じ時間帯2時間にトレーニングする人のみ表示
source: Show only people who train at the same time (±2 hours) at your favorite gym
es: Mostrar solo personas que entrenan al mismo tiempo (±2 horas) en tu gimnasio favorito
ja: あなたがよく行くジムで、同じ時間帯（±2時間）にトレーニングする人のみ表示

# general_回復時間_bodyPartはScientificDatabasegetRecommendedRest
source: * Recovery time: $bodyPart should be separated by ${ScientificDatabase.getRecommendedRestDays(level, bodyPart)} days
es: * Tiempo de recuperación: $bodyPart debe estar separado por ${ScientificDatabase.getRecommendedRestDays(level, bodyPart)} días
ja: * 回復時間: $bodyPartは${ScientificDatabase.getRecommendedRestDays(level, bodyPart)}日空ける

# error_トライアルチェックエラー_e
source: ❌ Trial check error: $e
es: ❌ Error de comprobación de prueba: $e
ja: ❌ トライアルチェックエラー: $e

# workout_エラー_e
source: Error: $e
ja: エラー: $e

# general_完全に力尽きるまで
source: Until I'm completely exhausted
es: Hasta que esté completamente exhausto
ja: 完全に力尽きるまで

# subscription_他のアプリに移行
source: Switch to another app
es: Cambiar a otra aplicación
ja: 他のアプリに移行

# workout_あなたはプロのパーソナルトレーナーです筋トレ中級者向けのtargetPartsisEmpty
source: You are a professional personal trainer. "${targetParts.isEmpty ?
es: Eres un entrenador personal profesional. "${targetParts.isEmpty ?
ja: あなたはプロのパーソナルトレーナーです。筋トレ中級者向けの「${targetParts.isEmpty ?

# workout_一括入力完了_result
source: Bulk input complete: ${result[
es: Entrada masiva completa: ${result[
ja: 一括入力完了: ${result[

# general_自動確認中
source: Automatic checking
es: Comprobación automática
ja: 自動確認中

# general_ℹ_ユーザー_userId_PR記録なし
source: ℹ️ User $userId: No PR record
es: ℹ️ Usuario $userId: Sin registro de relaciones públicas
ja: ℹ️ ユーザー $userId: PR記録なし

# error_バナー広告エラー_e
source: ❌ Banner Ad Error: $e
es: ❌ Error en el anuncio de banner: $e
ja: ❌ バナー広告エラー: $e

# general_近くにジムが見つかりませんでした
source: No gyms found nearby
es: No se encontraron gimnasios cerca
ja: 近くにジムが見つかりませんでした

# subscription_トライアル特典
source: Trial Benefits
es: Beneficios de la prueba
ja: トライアル特典

# workout_ベントオーバーロー
source: Bent Over Row
es: Remo inclinado
ja: ベントオーバーロー

# general_筋トレMEMO
source: Muscle training MEMO
es: Entrenamiento muscular MEMO
ja: 筋トレMEMO

# general_一致_matchCount_workoutDateyearworkoutDatemonthworko
source: ✅ Match [$matchCount]: ${workoutDate.year}/${workoutDate.month}/${workoutDate.day} - ${workout[
es: ✅ Coincidencia [$matchCount]: ${workoutDate.year}/${workoutDate.month}/${workoutDate.day} - ${workout[
ja: ✅ 一致 [$matchCount]: ${workoutDate.year}/${workoutDate.month}/${workoutDate.day} - ${workout[

# general_100clamp0_100toInt_達成
source: ]!) * 100).clamp(0, 100).toInt()}% achieved
es: ]!) * 100).clamp(0, 100).toInt()}% logrado
ja: ]!) * 100).clamp(0, 100).toInt()}% 達成

# general_初心者は4ヶ月で約30の筋力向上
source: Beginners improve their strength by about 30% in 4 months
es: Los principiantes mejoran su fuerza aproximadamente un 30% en 4 meses
ja: 初心者は4ヶ月で約30%の筋力向上

# workout_yyyy年M月d日E
source: yyyy year M month d day (E)
es: aaaa año M mes d día (E)
ja: yyyy年M月d日(E)

# workout_画像解析に失敗しました最大試行回数_maxRetries
source: Image analysis failed (max retries: $maxRetries)
es: Error en el análisis de la imagen (máximo de reintentos: $maxRetries)
ja: 画像解析に失敗しました（最大試行回数: $maxRetries）

# profile_サービス利用条件サブスクリプション
source: Terms of Service/Subscription
es: Condiciones de servicio/suscripción
ja: サービス利用条件・サブスクリプション

# general_ブラウザのメニューを開く
source: Open the browser menu
es: Abra el menú del navegador
ja: ブラウザのメニューを開く

# error_Firestore更新エラー_updateError
source: ❌ Firestore update error: $updateError
es: ❌ Error de actualización de Firestore: $updateError
ja: ❌ Firestore更新エラー: $updateError

# general_招待コードを入力してください
source: Enter your invitation code
es: Introduce tu código de invitación
ja: 招待コードを入力してください

# error_匿名認証エラー_authError
source: ❌ Anonymous authentication error: $authError
es: ❌ Error de autenticación anónima: $authError
ja: ❌ 匿名認証エラー: $authError

# workout_exerciseslength種目のトレーニング記録を取り込みました
source: ✅ Training records for ${exercises.length} exercises have been imported
es: ✅ Se han importado los registros de entrenamiento para los ejercicios ${exercises.length}
ja: ✅ ${exercises.length}種目のトレーニング記録を取り込みました

# general_岩手
source: Iwate
ja: 岩手

# workout_メモ一覧の読み込みエラー_e
source: ❌ Error loading note list: $e
es: ❌ Error al cargar la lista de notas: $e
ja: ❌ メモ一覧の読み込みエラー: $e

# workout_1RM取得成功_oneRMtoStringAsFixed1kg
source: ✅ Successful acquisition of 1RM: ${oneRM.toStringAsFixed(1)}kg
es: ✅ Adquisición exitosa de 1RM: ${oneRM.toStringAsFixed(1)}kg
ja: ✅ 1RM取得成功: ${oneRM.toStringAsFixed(1)}kg

# general_疲労度分析結果_1
source: 🔬 Fatigue analysis results
es: 🔬 Resultados del análisis de fatiga
ja: 🔬 疲労度分析結果

# workout_RMについて
source: About RM
es: Acerca de RM
ja: RMについて

# workout_ストリーク
source: Streak
es: Racha
ja: ストリーク

# general_かなり混んでいます
source: It's quite crowded
es: Hay bastante gente
ja: かなり混んでいます

# profile_トレーニングユーザー
source: Training Users
es: Capacitación de usuarios
ja: トレーニングユーザー

# workout_まだ週次レポートがありません
source: No weekly reports yet
es: Aún no hay informes semanales
ja: まだ週次レポートがありません

# gym_最新設備を完備した都心型フィットネスクラブ
source: An urban fitness club equipped with the latest facilities.
es: Un club de fitness urbano equipado con las últimas instalaciones.
ja: 最新設備を完備した都心型フィットネスクラブ。

# general_ハムストリングスを意識
source: Focus on the hamstrings
es: Concéntrese en los isquiotibiales
ja: ハムストリングスを意識

# workout_統計読み込みエラー_e
source: ❌ Error loading statistics: $e
es: ❌ Error al cargar estadísticas: $e
ja: ❌ 統計読み込みエラー: $e

# general_ROI_56734万円月
source: 📊 ROI 567% (+¥340,000/month)
es: 📊 ROI 567% (+¥340,000/mes)
ja: 📊 ROI 567%（+34万円/月）

# general_AI分析_30回月
source: AI analysis 30 times/month
es: Análisis de IA 30 veces al mes
ja: AI分析 30回/月

# profile_メッセージを入力してください
source: Please enter your message
es: Por favor ingrese su mensaje
ja: メッセージを入力してください

# workout_両側に同じ組み合わせを装着
source: Same combination on both sides
es: Misma combinación en ambos lados
ja: 両側に同じ組み合わせを装着

# error_デバイスID取得エラー_e
source: ❌ Error getting device ID: $e
es: ❌ Error al obtener el ID del dispositivo: $e
ja: ❌ デバイスID取得エラー: $e

# profile_誤って購入した場合購入後すぐに申請が必要
source: • If you made an accidental purchase (you must apply immediately after purchase)
es: Si realizó una compra accidental (debe solicitarla inmediatamente después de la compra)
ja: • 誤って購入した場合（購入後すぐに申請が必要）

# workout_今週の概要
source: This week's overview
es: Resumen de esta semana
ja: 今週の概要

# general_現在のボリュームは最適範囲内です
source: Current volume is within optimal range
es: El volumen actual está dentro del rango óptimo
ja: 現在のボリュームは最適範囲内です

# general_バー_barWeight_kg_プレート_totalWeight_barWeighttoString
source: Bar: $_barWeight kg + Plate: ${(_totalWeight! - _barWeight).toStringAsFixed(1)} kg
es: Barra: $_barWeight kg + Plato: ${(_totalWeight! - _barWeight).toStringAsFixed(1)} kg
ja: バー: $_barWeight kg + プレート: ${(_totalWeight! - _barWeight).toStringAsFixed(1)} kg

# workout_exerciseNameの過去記録
source: Past records of $exerciseName
es: Registros anteriores de $exerciseName
ja: $exerciseNameの過去記録

# general_下半身の王道種目
source: The classic lower body exercise
es: El clásico ejercicio para la parte inferior del cuerpo
ja: 下半身の王道種目

# gym_月金_10002300_土日祝_10002100
source: Mon-Fri 10:00-23:00, Sat, Sun, and holidays 10:00-21:00
es: Lunes a viernes de 10:00 a 23:00, sábados, domingos y festivos de 10:00 a 21:00
ja: 月-金 10:00-23:00, 土日祝 10:00-21:00

# error_報告回数取得エラー_e
source: ❌ Error getting report count: $e
es: ❌ Error al obtener el recuento de informes: $e
ja: ❌ 報告回数取得エラー: $e

# personalFactor_動的要因_1
source: Dynamic Factors
es: Factores dinámicos
ja: 動的要因

# workout_目標_週rectargetFrequency回
source: Target: ${rec.targetFrequency} times per week
es: Objetivo: ${rec.targetFrequency} veces por semana
ja: 目標: 週${rec.targetFrequency}回

# profile_GYM_MATCH_トレーニング管理アプリ
source: GYM MATCH - Training Management App
es: GYM MATCH - App de gestión de entrenamiento
ja: GYM MATCH - トレーニング管理アプリ

# general_今月の利用上限MAX_AI_CALLS_PER_MONTH回に達しました
source: You have reached your usage limit for this month (${MAX_AI_CALLS_PER_MONTH}).
es: Has alcanzado tu límite de uso para este mes (${MAX_AI_CALLS_PER_MONTH}).
ja: 今月の利用上限（${MAX_AI_CALLS_PER_MONTH}回）に達しました。

# workout_例_100
source: Example: 100
es: Ejemplo: 100
ja: 例: 100

# error_Google_Places_API検索失敗_Firestoreからジムを取得
source: ⚠️ Google Places API search failed → Get gym from Firestore
es: ⚠️ Error en la búsqueda de la API de Google Places → Obtener gimnasio desde Firestore
ja: ⚠️ Google Places API検索失敗 → Firestoreからジムを取得

# subscription_残りremaining回_currentUsagebaseLimit回使用
source: ${remaining} remaining (${currentUsage}/${baseLimit} used)
es: ${remaining} restantes (${currentUsage}/${baseLimit} usados)
ja: 残り${remaining}回 (${currentUsage}/${baseLimit}回使用)

# profile_UI更新完了
source: ✅ UI update completed
es: ✅ Actualización de la interfaz de usuario completada
ja: ✅ UI更新完了

# general_コードをコピーしました
source: I copied the code
es: Copié el código
ja: コードをコピーしました

# general_今すぐはじめよう
source: Get started now!
es: ¡Empieza ahora!
ja: 今すぐはじめよう！

# personalFactor_Personal_Factor_Multiplier_PFM_は年齢経験睡眠栄養アルコールの5要素を
source: The Personal Factor Multiplier (PFM) adjusts an individual's susceptibility to fatigue by integrating five factors: age, experience, sleep, nutrition, and alcohol.
es: El Multiplicador de Factores Personales (PFM) ajusta la susceptibilidad de una persona a la fatiga integrando cinco factores: edad, experiencia, sueño, nutrición y consumo de alcohol.
ja: Personal Factor Multiplier (PFM) は、年齢・経験・睡眠・栄養・アルコールの5要素を統合して個人の疲労感受性を補正します。

# workout_タイマー終了通知開始
source: 🔔 Timer end notification begins
es: 🔔 Comienza la notificación de fin de temporizador
ja: 🔔 タイマー終了通知開始

# general_キャンペーン期限
source: Campaign deadline
es: Fecha límite de campaña
ja: キャンペーン期限

# workout_回数_1015回
source: - Number of repetitions: 10-15
es: - Número de repeticiones: 10-15
ja: - 回数: 10-15回

# profile_プラン詳細画面は近日公開予定です
source: The plan details screen will be released soon.
es: La pantalla de detalles del plan se publicará pronto.
ja: プラン詳細画面は近日公開予定です

# workout_90日
source: 90 days
es: 90 días
ja: 90日

# subscription_料金_price_billingPeriod
source: Price: $price ($billingPeriod)
es: Precio: $precio ($período de facturación)
ja: 料金: $price ($billingPeriod)

# general_非常に混雑しています
source: It's very crowded
es: Hay mucha gente
ja: 非常に混雑しています

# general_Offline_ネットワーク接続なし
source: 📴 [Offline] No network connection
es: 📴 [Sin conexión] Sin conexión de red
ja: 📴 [Offline] ネットワーク接続なし

# gym_平日_9002300_土日_9002100
source: Weekdays 9:00-23:00, Saturdays and Sundays 9:00-21:00
es: Días laborables 9:00-23:00, sábados y domingos 9:00-21:00
ja: 平日 9:00-23:00, 土日 9:00-21:00

# general_千葉
source: Chiba
ja: 千葉

# general_RevenueCat初期化開始_1
source: 💰 RevenueCat initialization started...
es: 💰 Se inició la inicialización de RevenueCat...
ja: 💰 RevenueCat初期化開始...

# general_リワード広告初期化
source: 🎬 Rewarded ads initialization...
es: 🎬 Inicialización de anuncios recompensados...
ja: 🎬 リワード広告初期化...

# general_Premium_1ヶ月無料_2
source: 1 month free Premium
es: 1 mes Premium gratis
ja: Premium 1ヶ月無料

# general_AdMob初期化開始
source: 📱 AdMob initialization starts...
es: 📱 Comienza la inicialización de AdMob...
ja: 📱 AdMob初期化開始...

# general_お久しぶりです_1
source: It's been a while!
es: ¡Ya pasó un tiempo!
ja: お久しぶりです！

# general_benefit獲得条件
source: $benefit acquisition conditions
es: Condiciones de adquisición de beneficios
ja: $benefit獲得条件

# error_バッチ書き込みエラー_e
source: ❌ Batch write error: $e
es: ❌ Error de escritura por lotes: $e
ja: ❌ バッチ書き込みエラー: $e

# general_今月あと_remainingAds回視聴できます
source: You have $_remainingAds remaining to watch this month
es: Te quedan $_remainingAds para ver este mes
ja: 今月あと$_remainingAds回視聴できます

# general_コミュニティドリブンなデータ
source: ✅ Community-driven data
es: ✅ Datos impulsados por la comunidad
ja: ✅ コミュニティドリブンなデータ

# profile_有料プランに加入すると以下の機能が利用可能になります
source: A paid plan unlocks the following features:
es: Un plan pago desbloquea las siguientes funciones:
ja: 有料プランに加入すると以下の機能が利用可能になります：

# general_全トレーニング終了ボタンを押すと本日のトレーニング記録を分析し
source: 💡 When you press the End All Training button, your training record for today will be analyzed and
es: 💡 Cuando presiones el botón Finalizar todo el entrenamiento, se analizará tu registro de entrenamiento de hoy y
ja: 💡 全トレーニング終了ボタンを押すと、本日のトレーニング記録を分析し、

# general_新規予約機能は開発中です
source: New reservation features are under development
es: Se están desarrollando nuevas funciones de reserva.
ja: 新規予約機能は開発中です

# workout_画像形式_mimeType_サイズ_imageByteslength_bytes
source: 📷 Image format: $mimeType (size: ${imageBytes.length} bytes)
es: 📷 Formato de imagen: $mimeType (tamaño: ${imageBytes.length} bytes)
ja: 📷 画像形式: $mimeType (サイズ: ${imageBytes.length} bytes)

# subscription_トレーニングパートナー検索_1
source: 👥Find a training partner
es: 👥Encuentra un compañero de entrenamiento
ja: 👥 トレーニングパートナー検索

# workout_成長予測_現在のプラン_currentPlan
source: 🔍 [Growth forecast] Current plan: $currentPlan
es: 🔍 [Pronóstico de crecimiento] Plan actual: $currentPlan
ja: 🔍 [成長予測] 現在のプラン: $currentPlan

# profile_Apple_App_Storeサポートへ直接お問い合わせください
source: Please contact Apple App Store Support directly.
es: Comuníquese directamente con el soporte técnico de la App Store de Apple.
ja: Apple App Storeサポートへ直接お問い合わせください。

# subscription_プレミアムトライアル中
source: Premium trial
es: Prueba premium
ja: プレミアムトライアル中

# general_目標_nextMilestonetarget回
source: Target: ${_nextMilestone!.target} times
es: Objetivo: ${_nextMilestone!.target} veces
ja: 目標: ${_nextMilestone!.target}回

# workout_部位別実施状況
source: Implementation status by body part
es: Estado de implementación por parte del cuerpo
ja: 部位別実施状況

# general_Web位置情報取得成功_positionlatitude_positionlongitude
source: ✅ Successful acquisition of web location information: ${position.latitude}, ${position.longitude}
es: ✅ Adquisición exitosa de información de ubicación web: ${position.latitude}, ${position.longitude}
ja: ✅ Web位置情報取得成功: ${position.latitude}, ${position.longitude}

# general_パートナー検索
source: Partner Search 🆕
es: Búsqueda de pareja 🆕
ja: パートナー検索 🆕

# workout_履歴データなし
source: ⚠️ No historical data
es: ⚠️ Sin datos históricos
ja: ⚠️ 履歴データなし

# workout_毎週月曜日に自動生成されます_デモモードではCloud_Function未実装のため手動データが必要
source: It's automatically generated every Monday. (In demo mode, manual data is required due to the lack of Cloud Functions.)
es: Se genera automáticamente todos los lunes. (En el modo de demostración, se requieren datos manuales debido a la falta de Cloud Functions).
ja: 毎週月曜日に自動生成されます （デモモードではCloud Function未実装のため手動データが必要です）

# error_会話データの取得に失敗しました
source: Failed to retrieve conversation data
es: No se pudieron recuperar los datos de la conversación
ja: 会話データの取得に失敗しました

# general_テンプレートをコピーをタップ
source: Tap "Copy template"
es: Toca "Copiar plantilla"
ja: 「テンプレートをコピー」をタップ

# general_アクセスコード検証成功
source: ✅ Access code verification successful
es: ✅ Verificación del código de acceso exitosa
ja: ✅ アクセスコード検証成功

# profile_Freeプランは無料です
source: *The Free plan is free.
es: *El plan gratuito es gratuito.
ja: ※Freeプランは無料です
