Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# subscription_トライアル終了後自動的に有料プランに移行します
source: • After the trial ends, you will automatically be transferred to a paid plan.
es: • Una vez finalizada la prueba, se te transferirá automáticamente a un plan de pago.
ja: • トライアル終了後、自動的に有料プランに移行します

# general_アクセスコードは担当者から発行されたコードです
source: The access code is the code issued by the person in charge.
es: El código de acceso es el código emitido por el responsable.
ja: アクセスコードは担当者から発行されたコードです

# workout_削除後のセット数_afterDeleteSetslength
source: 📊 Number of sets after deletion: ${afterDeleteSets.length}
es: 📊 Número de conjuntos después de la eliminación: ${afterDeleteSets.length}
ja: 📊 削除後のセット数: ${afterDeleteSets.length}

# general_Firestore_サーバー接続テスト開始
source: 🔍 [Firestore] Server connection test starting...
es: 🔍 [Firestore] Prueba de conexión al servidor iniciando...
ja: 🔍 [Firestore] サーバー接続テスト開始...

# error_パートナー統合失敗_mergeError
source: ⚠️ Partner integration failed: $mergeError
es: ⚠️ Error en la integración del socio: $mergeError
ja: ⚠️ パートナー統合失敗: $mergeError

# subscription_Firestore取得エラー_firestoreError
source: ⚠️ Firestore get error: $firestoreError
es: ⚠️ Error de obtención de Firestore: $firestoreError
ja: ⚠️ Firestore取得エラー: $firestoreError

# general_セット_bodyPart_のトレーニング頻度週recommendedFreq
source: ]}set) - Training frequency for $bodyPart: Weekly ${recommendedFreq[
es: ]}set) - Frecuencia de entrenamiento para $bodyPart: Semanal ${recommendedFreq[
ja: ]}セット） ・$bodyPart のトレーニング頻度：週${recommendedFreq[

# general_回_1
source: ]}times)
es: ]}veces)
ja: ]}回)

# general_報告を送信
source: Submit a report
es: Presentar un informe
ja: 報告を送信

# workout_画像解析エラー最大試行回数到達_e
source: ❌ Image analysis error (maximum number of attempts reached): $e
es: ❌ Error de análisis de imagen (número máximo de intentos alcanzado): $e
ja: ❌ 画像解析エラー（最大試行回数到達）: $e

# workout_メモはまだありません
source: There are no notes yet
es: No hay notas todavía
ja: メモはまだありません

# workout_広告なしで快適に利用
source: • Enjoy a comfortable experience without ads
es: • Disfruta de una experiencia cómoda sin anuncios.
ja: • 広告なしで快適に利用

# error_マッチング拒否エラー_e
source: Matching refusal error: $e
es: Error de rechazo de coincidencia: $e
ja: マッチング拒否エラー: $e

# subscription_サブスクリプション情報
source: === Subscription Information ===
es: === Información de suscripción ===
ja: === サブスクリプション情報 ===

# workout_合計_calculateTotalWeighttoStringAsFixed1kg
source: Total: ${_calculateTotalWeight().toStringAsFixed(1)}kg
ja: 合計: ${_calculateTotalWeight().toStringAsFixed(1)}kg

# profile_アカウント名
source: Account Name *
es: Nombre de la cuenta *
ja: アカウント名 *

# error_トレーニング効果分析に失敗しました_e
source: Training effect analysis failed: $e
es: El análisis del efecto del entrenamiento falló: $e
ja: トレーニング効果分析に失敗しました: $e

# error_達成済みチェックエラー_e
source: ❌ Achieved check error: $e
es: ❌ Error de verificación logrado: $e
ja: ❌ 達成済みチェックエラー: $e

# general_Analytics初回イベント送信完了
source: ✅ Analytics first event sent successfully
es: ✅ Primer evento de Analytics enviado correctamente
ja: ✅ Analytics初回イベント送信完了

# general_セット内に短い休憩1530秒を挟む
source: Take short breaks (15-30 seconds) between sets
es: Tome descansos cortos (15-30 segundos) entre series.
ja: セット内に短い休憩（15-30秒）を挟む

# error_エラーメッセージ
source: Error Message
es: Mensaje de error
ja: エラーメッセージ

# general_習慣化達成
source: 🎉 Achieved habit formation!
es: ¡Se logró la formación del hábito!
ja: 🎉 習慣化達成！

# workout_週次レコメンデーション
source: Weekly Recommendations
es: Recomendaciones semanales
ja: 週次レコメンデーション

# workout_この筋トレアプリのトレーニング記録画像から以下の情報を抽出してJSON形式で返してください_1_日付
source: Extract the following information from the training record image of this muscle training app and return it in JSON format: 1. Date: YYYY-MM-DD format 2. Exercise list: The following information for each exercise: - Exercise name: String - Set information: For each set - Set number: Numeric value - Weight: Numeric value (0 for bodyweight) - Reps: Numeric value JSON format example: {
es: Extraiga la siguiente información de la imagen del registro de entrenamiento de esta aplicación de entrenamiento muscular y devuélvala en formato JSON: 1. Fecha: Formato AAAA-MM-DD 2. Lista de ejercicios: La siguiente información para cada ejercicio: - Nombre del ejercicio: Cadena - Información de la serie: Para cada serie - Número de serie: Valor numérico - Peso: Valor numérico (0 para el peso corporal) - Repeticiones: Valor numérico Ejemplo de formato JSON: {
ja: この筋トレアプリのトレーニング記録画像から、以下の情報を抽出してJSON形式で返してください： 1. 日付（date）: YYYY-MM-DD形式 2. トレーニング種目リスト（exercises）: 各種目ごとに以下の情報 - 種目名（name）: 文字列 - セット情報（sets）: 各セットごとに - セット番号（set_number）: 数値 - 重量（weight_kg）: 数値（自重の場合は0） - 回数（reps）: 数値 JSON形式例: {

# general_最頻出ジム_mostFrequentGymId_よく行く時間_preferredHours
source: ✅ Most frequent gym: $mostFrequentGymId, Preferred time: $preferredHours
es: ✅ Gimnasio más frecuente: $mostFrequentGymId, Hora preferida: $preferredHours
ja: ✅ 最頻出ジム: $mostFrequentGymId, よく行く時間: $preferredHours

# gym_要予約制
source: Reservations required
es: Se requieren reservaciones
ja: 要予約制

# workout_WorkoutLogScreen_現在のユーザー_useruid
source: 📱 [WorkoutLogScreen] Current user: ${user?.uid ??
es: 📱 [WorkoutLogScreen] Usuario actual: ${user?.uid ??
ja: 📱 [WorkoutLogScreen] 現在のユーザー: ${user?.uid ??

# general_DUPが上級者に効果的4ヶ月で約5成長
source: DUP is effective for advanced users (growth of about 5% in 4 months)
es: DUP es eficaz para usuarios avanzados (crecimiento de alrededor del 5% en 4 meses)
ja: DUPが上級者に効果的（4ヶ月で約5%成長）

# profile_サブスクリプションは自動更新されます解約しない限り毎月自動的に課金されます
source: Your subscription will auto-renew and you will be automatically charged every month unless you cancel.
es: Su suscripción se renovará automáticamente y se le cobrará automáticamente cada mes a menos que la cancele.
ja: サブスクリプションは自動更新されます。解約しない限り、毎月自動的に課金されます。

# general_GYM_MATCH_乗り換え体験
source: GYM MATCH Transfer Experience
es: Experiencia de transferencia GYM MATCH
ja: GYM MATCH 乗り換え体験

# workout_RM計算結果120RM
source: RM calculation result (1~20RM)
es: Resultado del cálculo de RM (1~20RM)
ja: RM計算結果（1～20RM）

# general_大和町
source: Yamato Town
es: Ciudad de Yamato
ja: 大和町

# profile_本アプリは以下の機能を提供します
source: This app provides the following features:
es: Esta aplicación ofrece las siguientes funciones:
ja: 本アプリは、以下の機能を提供します：

# error_Firestore取得エラー_e
source: ❌ Firestore get error: $e
es: ❌ Error de obtención de Firestore: $e
ja: ❌ Firestore取得エラー: $e

# general_鹿児島
source: Kagoshima
ja: 鹿児島

# general_総会員数
source: Total number of members
es: Número total de miembros
ja: 総会員数

# workout_部位検出_currentBodyPart_行_line
source: 📍 Body part detection: $currentBodyPart (line: $line)
es: 📍 Detección de partes del cuerpo: $currentBodyPart (línea: $line)
ja: 📍 部位検出: $currentBodyPart (行: $line)

# gym_レビュー投稿に失敗しました_e
source: Review submission failed: $e
es: Error en el envío de la revisión: $e
ja: レビュー投稿に失敗しました: $e

# general_累計50000kg達成
source: Achieved a cumulative total of 50,000kg
es: Se logró un total acumulado de 50.000 kg.
ja: 累計50,000kg達成

# general_ヒント_アプリの権限設定で位置情報を許可してください
source: 💡 Tip: Allow location access in the app permissions
es: 💡 Consejo: Permitir el acceso a la ubicación en los permisos de la aplicación
ja: 💡 ヒント: アプリの権限設定で位置情報を許可してください

# general_訪問履歴削除成功
source: ✅ Successfully deleted visit history
es: ✅ Historial de visitas eliminado correctamente
ja: ✅ 訪問履歴削除成功

# workout_as_Listlength_0種目
source: ] as List?)?.length ?? 0}Item
es: ] como Lista?)?.longitud ?? 0}Elemento
ja: ] as List?)?.length ?? 0}種目

# workout_exerciseNameを削除しました残りexerciseslength種目
source: "$exerciseName" has been deleted (${exercises.length} exercises remaining)
es: "$exerciseName" ha sido eliminado (quedan ${exercises.length} ejercicios)
ja: 「$exerciseName」を削除しました（残り${exercises.length}種目）

# personalFactor_保存完了現在のPFM_newPFMtoStringAsFixed2x
source: ✅ Saved! Current PFM: ${newPFM.toStringAsFixed(2)}x
es: ✅ ¡Guardado! PFM actual: ${newPFM.toStringAsFixed(2)}x
ja: ✅ 保存完了！現在のPFM: ${newPFM.toStringAsFixed(2)}x

# workout_API過負荷検出retryDelayinSeconds秒後に再試行
source: ⚠️ API overload detection. Retrying after ${retryDelay.inSeconds} seconds...
es: ⚠️ Detección de sobrecarga de la API. Reintentando después de ${retryDelay.inSeconds} segundos...
ja: ⚠️ API過負荷検出。${retryDelay.inSeconds}秒後に再試行...

# general_AI機能
source: AI function
es: Función de IA
ja: AI機能

# general_三重
source: triple
ja: 三重

# general_キャンペーン特典
source: Campaign Benefits
es: Beneficios de la campaña
ja: キャンペーン特典

# error_チェックイン失敗_e
source: ❌ Check-in failed: $e
es: ❌ Error en el check-in: $e
ja: ❌ チェックイン失敗: $e

# gym_ジム画像
source: Gym Images
es: Imágenes de gimnasio
ja: ジム画像

# workout_説明
source: explanation:
es: explicación:
ja: 説明：

# workout_休憩_34分
source: - Break: 3-4 minutes
es: - Descanso: 3-4 minutos
ja: - 休憩: 3-4分

# gym_本格的なトレーニング環境を提供する老舗ジム
source: A long-established gym that provides a professional training environment.
es: Un gimnasio con larga trayectoria que ofrece un entorno de entrenamiento profesional.
ja: 本格的なトレーニング環境を提供する老舗ジム。

# error_言語設定の読み込みに失敗_e_デフォルト_ja
source: ⚠️ Failed to load language setting: $e (default: ja)
es: ⚠️ Error al cargar la configuración de idioma: $e (predeterminado: ja)
ja: ⚠️ 言語設定の読み込みに失敗: $e (デフォルト: ja)

# general_あなたの招待コード_referralCode
source: Your referral code: $_referralCode
es: Su código de referencia: $_referralCode
ja: あなたの招待コード: $_referralCode

# general_無効なアクセスコードです
source: Invalid access code
es: Código de acceso no válido
ja: 無効なアクセスコードです

# workout_重量kg
source: Weight (kg)
es: Peso (kg)
ja: 重量(kg)

# general_肩甲骨を寄せるイメージで
source: Imagine bringing your shoulder blades together
es: Imagina juntar tus omóplatos
ja: 肩甲骨を寄せるイメージで

# error_predictGrowth全体エラー_e
source: ❌❌❌ predictGrowth Global Error: $e
es: ❌❌❌ Error global de predictGrowth: $e
ja: ❌❌❌ predictGrowth全体エラー: $e

# workout_荷重
source: load
es: carga
ja: 荷重

# subscription_ジムレビュー投稿_2
source: 📝 Gym Review Posting
es: 📝 Publicación de reseñas del gimnasio
ja: 📝 ジムレビュー投稿

# gym_お知らせタイプ
source: Notification Type
es: Tipo de notificación
ja: お知らせタイプ

# gym_東京都豊島区東池袋333
source: 3-3-3 Higashi-Ikebukuro, Toshima-ku, Tokyo
es: 3-3-3 Higashi-Ikebukuro, Toshima-ku, Tokio
ja: 東京都豊島区東池袋3-3-3

# general_科学的根拠に基づく詳細分析機能は近日実装予定
source: *Detailed analysis function based on scientific evidence will be implemented soon.
es: *Próximamente se implementará una función de análisis detallado basada en evidencia científica.
ja: ※ 科学的根拠に基づく詳細分析機能は近日実装予定

# workout_exerciseのPR記録_recordslength件_確認したセット数_totalSetsChe
source: ✅ PR records for ${exercise}: ${records.length} (Sets checked: $totalSetsChecked, Matched exercises: $matchedSets)
es: ✅ Registros de PR para ${exercise}: ${records.length} (Conjuntos comprobados: $totalSetsChecked, Ejercicios coincidentes: $matchedSets)
ja: ✅ ${exercise}のPR記録: ${records.length}件 (確認したセット数: $totalSetsChecked, マッチした種目: $matchedSets)

# general_gymcampaignValidUntilmonthgymcampaignValidUntilday
source: Until ${gym.campaignValidUntil!.month}/${gym.campaignValidUntil!.day}
es: Hasta ${gym.campaignValidUntil!.month}/${gym.campaignValidUntil!.day}
ja: ${gym.campaignValidUntil!.month}/${gym.campaignValidUntil!.day}まで

# subscription_トライアル達成進捗_progress
source: Trial completion progress: $progress%
es: Progreso de finalización de la prueba: $progress%
ja: トライアル達成進捗: $progress%

# workout_標準セット
source: Standard set
es: Conjunto estándar
ja: 標準セット

# subscription_AI機能月20回AIコーチ成長予測効果分析合計
source: 🤖 AI function 20 times per month (AI coaching, growth prediction, and effectiveness analysis)
es: 🤖 Función de IA 20 veces al mes (entrenamiento de IA, predicción de crecimiento y análisis de efectividad)
ja: 🤖 AI機能月20回（AIコーチ・成長予測・効果分析合計）

# general_ブロックしました
source: Blocked
es: Obstruido
ja: ブロックしました

# general_詳細任意
source: Details (optional)
es: Detalles (opcional)
ja: 詳細（任意）

# workout_ユーザーレベル_userLevel
source: 🎯 User level: $userLevel
es: 🎯 Nivel de usuario: $userLevel
ja: 🎯 ユーザーレベル: $userLevel

# general_今すぐトレーニングを記録してAIコーチングを試してみましょう
source: 💪 Record your workout and experience AI coaching now!
es: ¡Graba tu entrenamiento y experimenta el entrenamiento con IA ahora!
ja: 💪 今すぐトレーニングを記録して、AIコーチングを試してみましょう！

# general_パートナージム優先ソート完了_partnerCount件のパートナージムを最上位に配置
source: 🏆 Partner Gym Priority Sorting Completed: ${partnerCount} partner gyms at the top
es: 🏆 Clasificación prioritaria de gimnasios asociados completada: ${partnerCount} gimnasios asociados en la parte superior
ja: 🏆 パートナージム優先ソート完了: ${partnerCount}件のパートナージムを最上位に配置

# workout_bodyPartExerciseslength種目
source: ${bodyPartExercises.length}Event
es: Evento ${bodyPartExercises.length}
ja: ${bodyPartExercises.length}種目

# gym_スカッシュ
source: squash
es: calabaza
ja: スカッシュ

# error_紹介ボーナスクレジット消費失敗_e
source: ⚠️ Referral bonus credit consumption failed: $e
es: ⚠️ Error en el consumo del crédito de bonificación por recomendación: $e
ja: ⚠️ 紹介ボーナスクレジット消費失敗: $e

# general_あなたの習慣
source: 🔥 Your habits
es: 🔥Tus hábitos
ja: 🔥 あなたの習慣

# subscription_キャッシュ読み込みエラー_e
source: ⚠️ Cache load error: $e
es: ⚠️ Error de carga de caché: $e
ja: ⚠️ キャッシュ読み込みエラー: $e

# subscription_トライアル期間終了
source: Trial period expired
es: El período de prueba ha expirado
ja: トライアル期間終了

# general_ショルダー
source: shoulder
es: hombro
ja: ショルダー

# general_素晴らしい継続力です_さらに快適なトレーニング体験をお楽しみください
source: Great continuity! Enjoy a more comfortable training experience.
es: ¡Gran continuidad! Disfruta de un entrenamiento más cómodo.
ja: 素晴らしい継続力です！ さらに快適なトレーニング体験をお楽しみください

# error_バージョンチェックエラー_e
source: ❌ Version check error: $e
es: ❌ Error de comprobación de versión: $e
ja: ❌ バージョンチェックエラー: $e

# workout_セット詳細
source: Set Details
es: Detalles del conjunto
ja: セット詳細

# profile_複数店舗を運営されている場合は各店舗ごとに異なるメールアドレスを設定してください_予約通知は現在Fi
source: *If you operate multiple stores, please set a different email address for each store. *Reservation notifications are currently sent via Firebase Functions (separate setup required).
es: *Si opera varias tiendas, configure una dirección de correo electrónico diferente para cada una. *Las notificaciones de reserva se envían actualmente mediante Firebase Functions (se requiere configuración aparte).
ja: ※ 複数店舗を運営されている場合は、各店舗ごとに異なるメールアドレスを設定してください。 ※ 予約通知は現在Firebase Functions経由で送信されます（別途設定が必要です）。

# workout_トレーニング日数_workoutDateslength日
source: Training days: ${workoutDates.length} days
es: Días de entrenamiento: ${workoutDates.length} días
ja: トレーニング日数: ${workoutDates.length}日

# workout_体組成
source: Body composition
es: Composición corporal
ja: 体組成

# subscription_Premiumプランの全機能
source: ✨ All features of the Premium plan
es: ✨ Todas las funcionalidades del plan Premium
ja: ✨ Premiumプランの全機能

# general_このアプリに戻って投稿しましたをタップ
source: Return to the app and tap "Posted"
es: Regresa a la aplicación y toca "Publicado".
ja: このアプリに戻って「投稿しました」をタップ

# profile_プロフィール詳細画面ビルドエラー_e
source: ❌ Profile Detail Screen Build Error: $e
es: ❌ Error de creación de la pantalla de detalles del perfil: $e
ja: ❌ プロフィール詳細画面ビルドエラー: $e

# general_今月のAI利用回数20回を使い切りました
source: I have used up all my AI usages for this month (20 times).
es: He agotado todos mis usos de IA para este mes (20 veces).
ja: 今月のAI利用回数（20回）を使い切りました

# general_パーソナル会員数
source: Number of personal members
es: Número de miembros personales
ja: パーソナル会員数

# profile_主な機能
source: Main features:
es: Características principales:
ja: 主な機能:

# workout_前回記録ロード完了_lastWorkoutDatalength種目
source: 🎯Last record loaded: ${_lastWorkoutData.length} exercises
es: 🎯Último registro cargado: ${_lastWorkoutData.length} ejercicios
ja: 🎯 前回記録ロード完了: ${_lastWorkoutData.length}種目

# bodyPart_セット追加_exerciseName_有酸素_isCardio_腹筋_isAbs
source: ➕ Add set: $exerciseName (cardio: $isCardio, abdominals: $isAbs)
es: ➕ Agregar conjunto: $exerciseName (cardio: $isCardio, abdominales: $isAbs)
ja: ➕ セット追加: $exerciseName (有酸素: $isCardio, 腹筋: $isAbs)

# profile_他アプリのスクリーンショット
source: Screenshots of other apps
es: Capturas de pantalla de otras aplicaciones
ja: 他アプリのスクリーンショット

# general_レビュー依頼ダイアログ
source: • Review Request Dialog
es: • Diálogo de solicitud de revisión
ja: • レビュー依頼ダイアログ

# general_トレーニング記録日付を取得中
source: 📅 Getting training record dates...
es: 📅Obteniendo fechas de registro de entrenamiento...
ja: 📅 トレーニング記録日付を取得中...

# gym_女性専用エリア
source: Women-only area
es: Área solo para mujeres
ja: 女性専用エリア

# general_GPS検索は通常通り継続されますパートナージム情報なし
source: GPS search will continue as normal (no partner gym information)
es: La búsqueda de GPS continuará de forma normal (sin información del gimnasio asociado)
ja: GPS検索は通常通り継続されます（パートナージム情報なし）

# error_混雑度報告エラー_e
source: ❌ Congestion report error: $e
es: ❌ Error en el informe de congestión: $e
ja: ❌ 混雑度報告エラー: $e

# general_報告回数_userReportCount回
source: Number of reports: $_userReportCount
es: Número de informes: $_userReportCount
ja: 報告回数: $_userReportCount回

# workout_v10230_RPE説明文を取得_String_getRPEDescriptionint_rpe_i
source: ; } } /// 🆕 v1.0.230: Get RPE description String _getRPEDescription(int rpe) { if (rpe <= 7) { return
es: ; } } /// 🆕 v1.0.230: Obtener la descripción de RPE String _getRPEDescription(int rpe) { if (rpe <= 7) { return
ja: ; } } /// 🆕 v1.0.230: RPE説明文を取得 String _getRPEDescription(int rpe) { if (rpe <= 7) { return

# workout_ワンハンドロウ
source: One-Hand Row
es: Remo con una mano
ja: ワンハンドロウ

# workout_全身をバランスよく鍛える初心者向けテンプレート
source: A template for beginners to train the whole body in a balanced way
es: Una plantilla para principiantes para entrenar todo el cuerpo de forma equilibrada.
ja: 全身をバランスよく鍛える初心者向けテンプレート

# general_お久しぶりです
source: It's been a while 🏋️
es: Ha pasado un tiempo 🏋️
ja: お久しぶりです 🏋️

# general_表示_setExerciseName_isTimeMode_isTimeMode_reps_reps
source: 📊 Display: $setExerciseName - isTimeMode: $isTimeMode, reps: $reps, is_time_mode field: ${set[
es: 📊 Pantalla: $setExerciseName - isTimeMode: $isTimeMode, repeticiones: $reps, campo is_time_mode: ${set[
ja: 📊 表示: $setExerciseName - isTimeMode: $isTimeMode, reps: $reps, is_time_mode field: ${set[

# general_週weeklyGrowthtoStringAsFixed1順調に成長中
source: Weekly + ${weeklyGrowth.toStringAsFixed(1)}%: Steady growth
es: Semanal + ${weeklyGrowth.toStringAsFixed(1)}%: Crecimiento constante
ja: 週+${weeklyGrowth.toStringAsFixed(1)}%：順調に成長中

# workout_ds回reps
source: (\d+)\s*(?:times|reps?)
es: (\d+)\s*(?:veces|repeticiones?)
ja: (\d+)\s*(?:回|reps?)

# profile_widgetprofileage歳
source: ${widget.profile.age} years old
es: ${widget.profile.age} años
ja: ${widget.profile.age}歳

# gym_器具名
source: Equipment name
es: Nombre del equipo
ja: 器具名

# general_チェックイン成功_gymname
source: ✅ Check-in successful: ${gym.name}
es: ✅ Check-in exitoso: ${gym.name}
ja: ✅ チェックイン成功: ${gym.name}

# general_検索開始_GPS_currentPosition_null_Query
source: 🔍 Start Search: GPS=${_currentPosition != null}, Query=
es: 🔍 Iniciar búsqueda: GPS=${_currentPosition != null}, Consulta=
ja: 🔍 検索開始: GPS=${_currentPosition != null}, Query=

# subscription_トライアル期間中はいつでもキャンセル可能です
source: You can cancel anytime during the trial period
es: Puedes cancelar en cualquier momento durante el período de prueba.
ja: トライアル期間中はいつでもキャンセル可能です

# subscription_プラン保存エラー_e
source: ❌ Error saving plan: $e
es: ❌ Error al guardar el plan: $e
ja: ❌ プラン保存エラー: $e

# workout_メールアドレスが設定されていません
source: Email address not set
es: Dirección de correo electrónico no establecida
ja: メールアドレスが設定されていません

# general_承認済み
source: approved
es: aprobado
ja: 承認済み

# subscription_お気に入り無制限制限あり
source: Unlimited favorites → Limited
es: Favoritos ilimitados → Limitados
ja: お気に入り無制限→制限あり

# profile_第1条適用
source: Article 1 (Application)
es: Artículo 1 (Aplicación)
ja: 第1条（適用）

# general_ジム監視停止_gymId
source: ✅ Gym monitoring stopped: $gymId
es: ✅ Se detuvo el monitoreo del gimnasio: $gymId
ja: ✅ ジム監視停止: $gymId

# general_達成日_goalcompletedAtmonthgoalcompletedAtday
source: Completion date: ${goal.completedAt!.month}/${goal.completedAt!.day}
es: Fecha de finalización: ${goal.completedAt!.month}/${goal.completedAt!.day}
ja: 達成日: ${goal.completedAt!.month}/${goal.completedAt!.day}

# general_保存された言語設定を読み込み_languageCode
source: ✅ Load saved language setting: $languageCode
es: ✅ Cargar configuración de idioma guardada: $languageCode
ja: ✅ 保存された言語設定を読み込み: $languageCode

# general_profileage歳
source: ${profile.age} years old
es: ${profile.age} años
ja: ${profile.age}歳

# general_FitSync_起動中
source: FitSync is starting...
es: FitSync está comenzando...
ja: FitSync 起動中...

# workout_Phase_7_最新データ特定_IDlatestDocid_体重weightkg_日付recordD
source: ✅ [Phase 7] Identify latest data: ID=${latestDoc.id}, weight=${weight}kg, date=${recordDate?.toDate()}
es: ✅ [Fase 7] Identificar los últimos datos: ID=${latestDoc.id}, peso=${weight}kg, fecha=${recordDate?.toDate()}
ja: ✅ [Phase 7] 最新データ特定: ID=${latestDoc.id}, 体重=${weight}kg, 日付=${recordDate?.toDate()}

# gym_セントラルスポーツ_銀座
source: Central Sports Ginza
es: Deportes centrales de Ginza
ja: セントラルスポーツ 銀座

# general_AI分析_10回月
source: AI analysis 10 times/month
es: Análisis de IA 10 veces al mes
ja: AI分析 10回/月

# workout_フォームのポイント
source: Form Points
es: Puntos de formulario
ja: フォームのポイント

# general_病院
source: hospital
ja: 病院

# profile_注意事項
source: Notes:
es: Notas:
ja: 注意事項:

# workout_トレーニングメニューを提案してください
source: )}Please suggest a training menu.
es: )}Por favor, sugiera un menú de entrenamiento.
ja: )}トレーニングメニューを提案してください。

# general_dormantMembers名
source: $dormantMembers name
es: $dormantMembers nombre
ja: $dormantMembers名

# general_公民館
source: community center
es: centro comunitario
ja: 公民館

# error_バッジ解除エラー_e
source: ❌ Badge removal error: $e
es: ❌ Error al eliminar la insignia: $e
ja: ❌ バッジ解除エラー: $e

# general_招待された側
source: The invited party
es: La fiesta invitada
ja: 招待された側

# workout_休憩_6090秒
source: - Rest: 60-90 seconds
es: - Descanso: 60-90 segundos
ja: - 休憩: 60-90秒

# general_お名前を入力してください
source: Please enter your name
es: Por favor, introduzca su nombre
ja: お名前を入力してください

# general_canUseAI_無料プラン_AIクレジット_credits
source: 🔍 [canUseAI] Free Plan AI Credits: $credits
es: 🔍 [canUseAI] Créditos de IA del plan gratuito: $créditos
ja: 🔍 [canUseAI] 無料プラン AIクレジット: $credits

# general_よろしければApp_Store_でレビューをお願いします_あなたのフィードバックがアプリの改善に役立
source: If you like it, please leave a review on the App Store. Your feedback will help us improve the app!
es: Si te gusta, deja una reseña en la App Store. ¡Tus comentarios nos ayudarán a mejorar la app!
ja: よろしければ、App Store でレビューをお願いします。 あなたのフィードバックがアプリの改善に役立ちます！

# workout_style_TextStyle_fontSize_11_color_Colorsgreyshade6_4
source: , style: TextStyle( fontSize: 11, color: Colors.grey.shade600, fontStyle: FontStyle.italic, ), ), ), ], ), const SizedBox(height: 16), // training frequency Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ _buildSliderField( label:
es: , style: TextStyle( fontSize: 11, color: Colors.grey.shade600, fontStyle: FontStyle.italic, ), ), ), ], ), const SizedBox(height: 16), // frecuencia de entrenamiento Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ _buildSliderField( etiqueta:
ja: , style: TextStyle( fontSize: 11, color: Colors.grey.shade600, fontStyle: FontStyle.italic, ), ), ), ], ), const SizedBox(height: 16), // トレーニング頻度 Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ _buildSliderField( label:

# general_予約状況機能は開発中です
source: Booking status feature is under development
es: La función de estado de reserva está en desarrollo
ja: 予約状況機能は開発中です

# general_100回の自己記録更新
source: 100 new personal records
es: 100 nuevos récords personales
ja: 100回の自己記録更新

# error_アラート送信記録エラー_e
source: ❌ Alert sending record error: $e
es: ❌ Error de registro de envío de alerta: $e
ja: ❌ アラート送信記録エラー: $e

# general_Firestoreキャッシュ全削除完了
source: ✅ All Firestore caches deleted
es: ✅ Se eliminaron todos los cachés de Firestore
ja: ✅ Firestoreキャッシュ全削除完了

# error_お気に入り詳細取得エラー_e
source: ❌ Error getting favorite details: $e
es: ❌ Error al obtener detalles de favoritos: $e
ja: ❌ お気に入り詳細取得エラー: $e

# subscription_Firestoreにユーザー情報が存在しません
source: ❌ User information does not exist in Firestore
es: ❌ La información del usuario no existe en Firestore
ja: ❌ Firestoreにユーザー情報が存在しません
