Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# workout_トレーニングメニューを提案してください_beginnerExerciseDatabase_histo
source: )}" Please suggest a training menu. $_beginnerExerciseDatabase $historyInfo [Target Audience] - Beginners to strength training (1-3 months into gym visits) - ${targetParts.join(
es: )}" Sugiera un menú de entrenamiento. $_beginnerExerciseDatabase $historyInfo [Público objetivo] - Principiantes en entrenamiento de fuerza (1-3 meses de experiencia en el gimnasio) - ${targetParts.join(
ja: )}」トレーニングメニューを提案してください。 $_beginnerExerciseDatabase $historyInfo 【対象者】 - 筋トレ初心者（ジム通い始めて1〜3ヶ月程度） - ${targetParts.join(

# workout_全身バランストレーニング
source: ## Whole-body balance training
es: ## Entrenamiento de equilibrio de cuerpo completo
ja: ## 全身バランストレーニング

# general_警戒
source: Vigilance
es: Vigilancia
ja: 警戒

# workout_画像解析に失敗しました_HTTP_responsestatusCodeもう一度お試しください
source: Image analysis failed (HTTP ${response.statusCode}). Please try again.
es: Error en el análisis de la imagen (HTTP ${response.statusCode}). Inténtalo de nuevo.
ja: 画像解析に失敗しました (HTTP ${response.statusCode})。もう一度お試しください。

# workout_ヒント_より小さい画像を使用するかスクリーンショットの品質を下げてください
source: 💡 Tip: Use a smaller image or lower the quality of your screenshot
es: 💡 Consejo: usa una imagen más pequeña o reduce la calidad de tu captura de pantalla
ja: 💡 ヒント: より小さい画像を使用するか、スクリーンショットの品質を下げてください

# gym_月会費初月500体験無料
source: Monthly fee: ¥500 for the first month, trial free
es: Tarifa mensual: ¥500 por el primer mes, prueba gratuita
ja: 月会費初月¥500・体験無料

# gym_詳細評価
source: Detailed evaluation
es: Evaluación detallada
ja: 詳細評価

# general_購入状態が更新されました
source: 📱 Purchase status updated
es: 📱 Estado de compra actualizado
ja: 📱 購入状態が更新されました

# general_セット削減で回復時間を確保しましょう
source: ]} Reduce your sets to allow for recovery time.
es: ]} Reduce tus series para permitir tiempo de recuperación.
ja: ]}セット削減で回復時間を確保しましょう。

# subscription_最大3ヶ月の一時停止で復帰時もスムーズに再開できます
source: You can suspend your service for up to three months, allowing you to resume smoothly when you return.
es: Puedes suspender tu servicio por hasta tres meses, lo que te permitirá reanudarlo sin problemas cuando regreses.
ja: 最大3ヶ月の一時停止で、復帰時もスムーズに再開できます

# general_3_異なるユーザーアカウントでログインしている
source: 3. You are logged in with a different user account
es: 3. Has iniciado sesión con una cuenta de usuario diferente.
ja: 3. 異なるユーザーアカウントでログインしている

# workout_XX回
source: XX times
es: XX veces
ja: XX回

# general_島根
source: Shimane
ja: 島根

# workout_は除く_すべての種目とセットを正確に抽出してください_JSON以外の説明文は不要です_画像から読み取
source: (excluding ) - Accurately extract all exercises and sets. - No descriptions other than the JSON are required. Return the training records read from the image in the above JSON format.
es: (excluyendo) - Extraer con precisión todos los ejercicios y series. - No se requieren descripciones aparte del formato JSON. Devolver los registros de entrenamiento leídos de la imagen en el formato JSON indicado anteriormente.
ja: は除く） - すべての種目とセットを正確に抽出してください - JSON以外の説明文は不要です 画像から読み取ったトレーニング記録を上記のJSON形式で返してください。

# general_50回の自己記録更新
source: 50 new personal records
es: 50 nuevos récords personales
ja: 50回の自己記録更新

# workout_削除後の種目_afterDeleteExerciseNamesjoin
source: 📊 Exercises after deletion: ${afterDeleteExerciseNames.join(
es: 📊 Ejercicio después de la eliminación: ${afterDeleteExerciseNames.join(
ja: 📊 削除後の種目: ${afterDeleteExerciseNames.join(

# subscription_プラン種別
source: Plan Type:
es: Tipo de plan:
ja: プラン種別:

# general_お得_1
source: 💰 Great Deals
es: 💰 Grandes ofertas
ja: 💰 お得

# subscription_このプランに変更
source: Change to this plan
es: Cambiar a este plan
ja: このプランに変更

# general_exerciseName_で新記録を達成しました
source: You've set a new record in $exerciseName!
es: ¡Has establecido un nuevo récord en $exerciseName!
ja: $exerciseName で新記録を達成しました！

# error_マッチング承認エラー_e
source: Matching approval error: $e
es: Error de aprobación coincidente: $e
ja: マッチング承認エラー: $e

# workout_トレーニング記録完了_匿名認証エラー_e
source: ❌ Training recording complete: Anonymous authentication error: $e
es: ❌ Grabación de entrenamiento completada: Error de autenticación anónima: $e
ja: ❌ トレーニング記録完了: 匿名認証エラー: $e

# error_既読処理失敗_e
source: ❌ Read process failed: $e
es: ❌ Error en el proceso de lectura: $e
ja: ❌ 既読処理失敗: $e

# workout_テンプレートデータを渡す_templateData
source: 📋 Passing template data: $templateData
es: 📋 Pasando datos de plantilla: $templateData
ja: 📋 テンプレートデータを渡す: $templateData

# gym_お知らせ画像
source: Announcement image
es: Imagen de anuncio
ja: お知らせ画像

# profile_AI_x5回_紹介された人もAI_x3回
source: AI x5 + AI x3 for introduced people
es: IA x5 + IA x3 para personas presentadas
ja: AI x5回 + 紹介された人もAI x3回

# general_トレーニング記録日付_workoutDateslength日
source: ✅ Training Record Date: ${workoutDates.length} days
es: ✅ Fecha del registro de entrenamiento: ${workoutDates.length} días
ja: ✅ トレーニング記録日付: ${workoutDates.length}日

# general_マッチングリクエスト送信成功_userId_targetUserId
source: ✅ Matching request sent successfully: $userId -> $targetUserId
es: ✅ Solicitud de coincidencia enviada exitosamente: $userId -> $targetUserId
ja: ✅ マッチングリクエスト送信成功: $userId -> $targetUserId

# general_トレーニング部位
source: Training area
es: Área de entrenamiento
ja: トレーニング部位

# general_パートナー詳細
source: Partner Details
es: Detalles del socio
ja: パートナー詳細

# general_ログをクリップボードにコピーしました
source: Log copied to clipboard
es: Registro copiado al portapapeles
ja: ログをクリップボードにコピーしました

# subscription_Firestoreにプラン保存_plan_UID_useruid_匿名_userisAnonymou
source: ✅ Save plan to Firestore: $plan (UID: ${user.uid}, Anonymous: ${user.isAnonymous})
es: ✅ Guardar plan en Firestore: $plan (UID: ${user.uid}, Anónimo: ${user.isAnonymous})
ja: ✅ Firestoreにプラン保存: $plan (UID: ${user.uid}, 匿名: ${user.isAnonymous})

# general_該当するパートナーが見つかりませんでした
source: No matching partners found
es: No se encontraron socios coincidentes
ja: 該当するパートナーが見つかりませんでした

# workout_キャッシュからcacheSnapshotdocslength件読み込み
source: ✅ Loaded ${cacheSnapshot.docs.length} items from cache
es: ✅ Se cargaron ${cacheSnapshot.docs.length} elementos del caché
ja: ✅ キャッシュから${cacheSnapshot.docs.length}件読み込み

# error_広告の表示に失敗しましたもう一度お試しください
source: Ad display failed, please try again.
es: Error en la visualización del anuncio, inténtelo de nuevo.
ja: 広告の表示に失敗しました。もう一度お試しください。

# workout_説明_1
source: explanation:
es: explicación:
ja: 説明:

# general_全て
source: all
es: todo
ja: 全て

# general_鳥栖市
source: Tosu City
es: Ciudad de Tosu
ja: 鳥栖市

# general_ボリュームが王様頻度は手段
source: Volume is king, frequency is the means
es: El volumen es el rey, la frecuencia es el medio.
ja: ボリュームが王様、頻度は手段

# general_動画を見る
source: Watch the video
es: Mira el video
ja: 動画を見る

# workout_トレーニング履歴読み込みエラー_e
source: ❌ Error loading training history: $e
es: ❌ Error al cargar el historial de entrenamiento: $e
ja: ❌ トレーニング履歴読み込みエラー: $e

# general_記録を削除しました
source: Record deleted
es: Registro eliminado
ja: 記録を削除しました

# general_危険
source: danger
es: peligro
ja: 危険

# gym_東京都新宿区西新宿111
source: 1-1-1 Nishi-Shinjuku, Shinjuku-ku, Tokyo
es: 1-1-1 Nishi-Shinjuku, Shinjuku-ku, Tokio
ja: 東京都新宿区西新宿1-1-1

# gym_Firebase設定が必要です
source: Firebase configuration required
es: Se requiere configuración de Firebase
ja: Firebase設定が必要です

# profile_お問い合わせ先
source: Contact Information
es: Información del contacto
ja: お問い合わせ先

# general_スパム宣伝
source: Spam/Advertising
es: Spam/Publicidad
ja: スパム・宣伝

# general_マッチングリクエスト送信はProプラン限定機能です_Proプランにアップグレードしてパートナーとつな
source: Sending a match request is a Pro plan exclusive feature. Upgrade to the Pro plan to connect with your partner!
es: Enviar una solicitud de coincidencia es una función exclusiva del plan Pro. ¡Actualízate al plan Pro para conectar con tu pareja!
ja: マッチングリクエスト送信はProプラン限定機能です。 Proプランにアップグレードしてパートナーとつながりましょう！

# general_村役場
source: Village Office
es: Oficina del pueblo
ja: 村役場

# general_あなたの近くのジム_nearbyGymslength件を表示中
source: Showing ${_nearbyGyms.length} gyms near you
es: Mostrando ${_nearbyGyms.length} gimnasios cerca de ti
ja: あなたの近くのジム ${_nearbyGyms.length}件を表示中

# workout_AIコーチからexerciseslength種目を読み込みました
source: Loaded ${exercises.length} exercises from AI coach
es: Se cargaron ${exercises.length} ejercicios del entrenador de IA
ja: AIコーチから${exercises.length}種目を読み込みました

# gym_ジョイフィット24_品川
source: Joyfit 24 Shinagawa
ja: ジョイフィット24 品川

# workout_保存エラー_e
source: Save error: $e
es: Error de guardado: $e
ja: 保存エラー: $e

# gym_現在の混雑度_gymcrowdLevelText
source: Current crowd level: ${gym.crowdLevelText}
es: Nivel de público actual: ${gym.crowdLevelText}
ja: 現在の混雑度: ${gym.crowdLevelText}

# general_商品が見つかりません
source: Product not found
es: Producto no encontrado
ja: 商品が見つかりません

# workout_一括入力完了_自重_result
source: Bulk input complete: Self-response × ${result[
es: Entrada masiva completa: Autorrespuesta × ${result[
ja: 一括入力完了: 自重 × ${result[

# general_AI追加パック獲得数_discountCredits個
source: Number of AI additional packs acquired: $_discountCredits
es: Número de paquetes adicionales de IA adquiridos: $_discountCredits
ja: AI追加パック獲得数: $_discountCredits個

# general_30日連続達成
source: Achieved 30 days in a row!
es: ¡Lo conseguí durante 30 días seguidos!
ja: 30日連続達成！

# workout_正しい数値を入力してください
source: Please enter a valid number
es: Por favor, introduzca un número válido
ja: 正しい数値を入力してください

# profile_技術的な問題により正常にサービスが提供されない場合
source: • If the service is not provided properly due to technical issues.
es: • Si el servicio no se presta correctamente debido a problemas técnicos.
ja: • 技術的な問題により正常にサービスが提供されない場合

# general_ログをクリア
source: Clear Log
es: Borrar registro
ja: ログをクリア

# profile_通知は端末の設定でも管理できます_設定アプリ_通知_からご確認ください
source: You can also manage notifications in your device settings. Go to Settings app > Notifications.
es: También puedes administrar las notificaciones en la configuración de tu dispositivo. Ve a Ajustes > Notificaciones.
ja: 通知は端末の設定でも管理できます。 設定アプリ > 通知 からご確認ください。

# workout_オフラインモード_ローカルに保存開始
source: 📴 Offline mode: Start saving locally
es: 📴 Modo sin conexión: comienza a ahorrar localmente
ja: 📴 オフラインモード: ローカルに保存開始

# general_頻度
source: frequency
es: frecuencia
ja: 頻度

# workout_RM_Repetition_Maximum特定の回数で挙上可能な最大重量
source: • RM (Repetition Maximum): The maximum weight that can be lifted in a specific number of repetitions.
es: • RM (Repetición Máxima): El peso máximo que se puede levantar en un número específico de repeticiones.
ja: • RM (Repetition Maximum)：特定の回数で挙上可能な最大重量

# profile_運営統括責任者
source: Operations Manager
es: Gerente de Operaciones
ja: 運営統括責任者

# general_スコア_fatigueScoretoInt_100
source: Score: ${fatigueScore.toInt()} / 100
es: Puntuación: ${fatigueScore.toInt()} / 100
ja: スコア: ${fatigueScore.toInt()} / 100

# subscription_自動的にプレミアム7日間トライアルが開始されました
source: Your 7-day Premium trial will automatically start.
es: Su prueba Premium de 7 días comenzará automáticamente.
ja: 自動的にプレミアム7日間トライアルが開始されました

# workout_初回記録_今日の記録が次回の目標になります全力で挑戦しましょう
source: First Record Today's record will be your next goal. Give it your all!
es: Primer récord El récord de hoy será tu próximo objetivo. ¡Dalo todo!
ja: 初回記録 今日の記録が次回の目標になります。全力で挑戦しましょう！

# workout_自重モード反映_setexerciseName_userBodyweightkg_体重_setwei
source: ✅ Bodyweight mode reflected: ${set.exerciseName} = ${_userBodyweight}kg (weight) + ${set.weight}kg (added) = ${effectiveWeight}kg
es: ✅ Modo de peso corporal reflejado: ${set.exerciseName} = ${_userBodyweight}kg (peso) + ${set.weight}kg (agregado) = ${effectiveWeight}kg
ja: ✅ 自重モード反映: ${set.exerciseName} = ${_userBodyweight}kg (体重) + ${set.weight}kg (追加) = ${effectiveWeight}kg

# workout_セット詳細_1
source: 🔍 Set Details:
es: 🔍 Detalles del conjunto:
ja: 🔍 セット詳細:

# bodyPart_PPL_Pull_Day背中二頭
source: PPL - Pull Day (back/two heads)
es: PPL - Día de tirón (espalda/dos cabezas)
ja: PPL - Pull Day（背中・二頭）

# workout_プリーチャーカール
source: Preacher Curl
es: Predicador Curl
ja: プリーチャーカール

# general_種目を変更角度器具を変える
source: Change the exercise (change the angle or equipment)
es: Cambiar el ejercicio (cambiar el ángulo o el equipo)
ja: 種目を変更（角度・器具を変える）

# general_今月のアクティブ日数_monthlyActiveDays日
source: 📅 Active days this month: $monthlyActiveDays
es: 📅 Días activos este mes: $monthlyActiveDays
ja: 📅 今月のアクティブ日数: $monthlyActiveDays日

# general_強制アップデートが必要_currentBuildNumber_minBuildNumber
source: 🚨 Force update required: $currentBuildNumber < $minBuildNumber
es: 🚨 Se requiere actualización forzada: $currentBuildNumber < $minBuildNumber
ja: 🚨 強制アップデートが必要: $currentBuildNumber < $minBuildNumber

# gym_有酸素エリア
source: Aerobic Area
es: Área aeróbica
ja: 有酸素エリア

# profile_ユーザーは本アプリの利用にあたり以下の行為をしてはなりません
source: Users are prohibited from engaging in the following actions when using this app:
es: Los usuarios tienen prohibido realizar las siguientes acciones al usar esta aplicación:
ja: ユーザーは、本アプリの利用にあたり、以下の行為をしてはなりません：

# subscription_達成進捗
source: Achievement progress
es: Progreso en los logros
ja: 達成進捗

# general_位置情報権限をリクエスト中
source: 🔔 Requesting location permissions...
es: 🔔 Solicitando permisos de ubicación...
ja: 🔔 位置情報権限をリクエスト中...

# gym_タイトルを入力してください
source: Please enter a title
es: Por favor, introduzca un título
ja: タイトルを入力してください

# gym_期限をクリア
source: Clear deadline
es: Fecha límite clara
ja: 期限をクリア

# profile_リクエストを送る
source: Send a request
es: Enviar una solicitud
ja: リクエストを送る

# workout_統計ダッシュボード_自動リフレッシュ実行
source: 📊 Statistics Dashboard: Auto-refresh
es: 📊 Panel de estadísticas: actualización automática
ja: 📊 統計ダッシュボード: 自動リフレッシュ実行

# general_パートナージム優先ソート完了_partnerCount件を最上位に配置
source: 🏆 Partner Gym Priority Sorting Completed: ${partnerCount} Gyms at the top
es: 🏆 Clasificación prioritaria de gimnasios asociados completada: ${partnerCount} gimnasios en la parte superior
ja: 🏆 パートナージム優先ソート完了: ${partnerCount}件を最上位に配置

# general_購入履歴を復元中
source: 🔄 Restoring purchase history...
es: 🔄Restaurando historial de compras...
ja: 🔄 購入履歴を復元中...

# general_memberplanName_残りmemberremainingSessions回
source: ${member.planName} (${member.remainingSessions} remaining)
es: ${member.planName} (${member.remainingSessions} restantes)
ja: ${member.planName} (残り${member.remainingSessions}回)

# error_お気に入りジム取得エラー_e
source: ❌ Error getting favorite gym: $e
es: ❌ Error al obtener el gimnasio favorito: $e
ja: ❌ お気に入りジム取得エラー: $e

# general_同じジム時間帯の人のみ2時間
source: Only people at the same gym and time zone (± 2 hours)
es: Solo personas del mismo gimnasio y zona horaria (± 2 horas)
ja: 同じジム・時間帯の人のみ（±2時間）

# general_生理心理的疲労を軽減し回復を促進する期間
source: A period to reduce physiological and psychological fatigue and promote recovery
es: Un período para reducir la fatiga fisiológica y psicológica y promover la recuperación.
ja: 生理・心理的疲労を軽減し、回復を促進する期間

# general_現在の権限ステータス_permission
source: 📋 Current permission status: $permission
es: 📋 Estado actual del permiso: $permiso
ja: 📋 現在の権限ステータス: $permission

# general_広島
source: Hiroshima
ja: 広島

# general_疲労管理システム
source: 🔬 Fatigue Management System
es: 🔬 Sistema de gestión de la fatiga
ja: 🔬 疲労管理システム

# workout_部位
source: Part:
es: Parte:
ja: 部位:

# general_図書館
source: library
es: biblioteca
ja: 図書館

# gym_ボディビル専門
source: Bodybuilding specialist
es: Especialista en culturismo
ja: ボディビル専門

# gym_混雑度の正確さ
source: Accuracy of crowding
es: Precisión del hacinamiento
ja: 混雑度の正確さ

# general_あとremaining記録この調子で続けましょう
source: Just $100 left to record! Let's keep it up 💪
es: ¡Solo quedan $100 para grabar! ¡Sigamos así! 💪
ja: あと$remaining記録！この調子で続けましょう💪

# general_現在のフェーズ
source: Current Phase
es: Fase actual
ja: 現在のフェーズ

# workout_Gemini_API_エラー_responsestatusCode_フォールバックを使用
source: Gemini API Error: ${response.statusCode} - Use fallback
es: Error de API de Gemini: ${response.statusCode} - Usar respaldo
ja: Gemini API エラー: ${response.statusCode} - フォールバックを使用

# general_上記のフォームに入力すると_ここにプレビューが表示されます
source: Fill out the form above and you'll see a preview here
es: Complete el formulario de arriba y verá una vista previa aquí
ja: 上記のフォームに入力すると ここにプレビューが表示されます

# workout_統計ダッシュボード_匿名認証成功
source: ✅ Statistics Dashboard: Anonymous Authentication Success
es: ✅ Panel de estadísticas: Autenticación anónima exitosa
ja: ✅ 統計ダッシュボード: 匿名認証成功

# general_紹介成功
source: Introduction successful!
es: Introducción exitosa!
ja: 紹介成功！

# general_Firestoreクエリ実行_cacheKey
source: ⏳ Query Firestore: $cacheKey
es: ⏳ Consulta Firestore: $cacheKey
ja: ⏳ Firestoreクエリ実行: $cacheKey

# workout_月間上限到達_アップグレードダイアログ表示
source: Monthly limit reached → Upgrade dialog displayed
es: Límite mensual alcanzado → Se muestra el cuadro de diálogo de actualización
ja: 月間上限到達 → アップグレードダイアログ表示

# general_AI分析_成功キャッシュ保存完了
source: ✅ AI analysis: Success (caching completed)
es: ✅ Análisis de IA: Éxito (almacenamiento en caché completado)
ja: ✅ AI分析: 成功（キャッシュ保存完了）

# subscription_ジム検索記録エラー_e
source: ❌ Gym search record error: $e
es: ❌ Error en el registro de búsqueda del gimnasio: $e
ja: ❌ ジム検索記録エラー: $e

# personalFactor_最終更新_currentProfilelastUpdated_null_formatDateTime
source: Last updated: ${_currentProfile?.lastUpdated != null ? _formatDateTime(_currentProfile!.lastUpdated) : AppLocalizations.of(context)!.notSet}
es: Última actualización: ${_currentProfile?.lastUpdated != null ? _formatDateTime(_currentProfile!.lastUpdated) : AppLocalizations.of(context)!.notSet}
ja: 最終更新: ${_currentProfile?.lastUpdated != null ? _formatDateTime(_currentProfile!.lastUpdated) : AppLocalizations.of(context)!.notSet}
