Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# general_キャンペーン保存完了
source: ✅ Campaign saved successfully
es: ✅ Campaña guardada exitosamente
ja: ✅ キャンペーン保存完了

# general_体重_kg
source: Weight (kg)
es: Peso (kg)
ja: 体重 (kg)

# profile_マッチングリクエスト送信はProプラン限定機能です
source: Sending a matching request is a feature exclusive to the Pro plan.
es: Enviar una solicitud de coincidencia es una función exclusiva del plan Pro.
ja: マッチングリクエスト送信はProプラン限定機能です。

# general_限界到達後即座に負荷を下げて継続
source: Once you reach your limit, immediately reduce the load and continue.
es: Una vez que alcances tu límite, reduce inmediatamente la carga y continúa.
ja: 限界到達後、即座に負荷を下げて継続

# general_GPS検索_Lat_currentPositionlatitude_Lng_currentPosit
source: 📍 GPS search: Lat=${_currentPosition!.latitude}, Lng=${_currentPosition!.longitude}, Radius=${_searchRadius}km
es: Búsqueda GPS: Lat=${_currentPosition!.latitude}, Lng=${_currentPosition!.longitude}, Radio=${_searchRadius}km
ja: 📍 GPS検索: Lat=${_currentPosition!.latitude}, Lng=${_currentPosition!.longitude}, Radius=${_searchRadius}km

# personalFactor_静的要因_1
source: Static Factors
es: Factores estáticos
ja: 静的要因

# gym_平日_10002300_土日_10002100
source: Weekdays 10:00-23:00, Saturdays and Sundays 10:00-21:00
es: Días laborables 10:00-23:00, sábados y domingos 10:00-21:00
ja: 平日 10:00-23:00, 土日 10:00-21:00

# general_もうすぐ達成
source: Almost achieved!
es: ¡Casi logrado!
ja: もうすぐ達成！

# general_表示は片側のプレート数です_両側に同じ構成をセットしてください
source: The number of plates shown is for one side. Please set the same configuration on both sides.
es: El número de placas que se muestra corresponde a un lado. Por favor, configure la misma configuración en ambos lados.
ja: 表示は片側のプレート数です。 両側に同じ構成をセットしてください。

# subscription_プランをnewPlan_SubscriptionTypefree
source: Plan ${newPlan == SubscriptionType.free ?
ja: プランを${newPlan == SubscriptionType.free ?

# bodyPart_PPL_Legs_Day脚
source: PPL - Legs Day
es: PPL - Día de piernas
ja: PPL - Legs Day（脚）

# subscription_3_サブスクリプションをタップ
source: 3. Tap "Subscriptions"
es: 3. Toca "Suscripciones".
ja: 3. 「サブスクリプション」をタップ

# general_愛知
source: Aichi
ja: 愛知

# general_同一部位はrestDays日空けるMPS上昇期間48時間
source: Wait ${restDays} days between treatments on the same area (MPS increase period: 48 hours)
es: Espere ${restDays} días entre tratamientos en la misma área (período de aumento de MPS: 48 horas)
ja: 同一部位は${restDays}日空ける（MPS上昇期間：48時間）

# workout_exerciseNameの履歴がありません
source: No history for $exerciseName
es: No hay historial para $exerciseName
ja: $exerciseNameの履歴がありません

# general_今すぐシェア
source: Share now
es: Comparte ahora
ja: 今すぐシェア

# general_exerciseName_weighttoInt_0分_repstoInt_0km
source: • $exerciseName: ${weight?.toInt() ?? 0} minutes × ${reps?.toInt() ?? 0}km
es: • $exerciseName: ${weight?.toInt() ?? 0} minutos × ${reps?.toInt() ?? 0}km
ja: • $exerciseName: ${weight?.toInt() ?? 0}分 × ${reps?.toInt() ?? 0}km

# workout_value_selectedLevel_items_levels_onChanged_value_s_1
source: , value: _selectedLevel, items: _levels, onChanged: (value) { setState(() { _selectedLevel = value!; }); }, ), const SizedBox(height: 16), // training frequency Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ _buildSliderField( label:
es: , valor: _nivelSeleccionado, elementos: _niveles, onChanged: (valor) { setState(() { _nivelSeleccionado = valor!; }); }, ), const SizedBox(altura: 16), // frecuencia de entrenamiento Columna( crossAxisAlignment: CrossAxisAlignment.start, hijos: [ _buildSliderField( etiqueta:
ja: , value: _selectedLevel, items: _levels, onChanged: (value) { setState(() { _selectedLevel = value!; }); }, ), const SizedBox(height: 16), // トレーニング頻度 Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ _buildSliderField( label:

# subscription_3760お得
source: Save ¥3,760!
es: ¡Ahorre ¥3,760!
ja: ¥3,760お得！

# workout_未完了
source: incomplete
es: incompleto
ja: 未完了

# subscription_お気に入り保存
source: Save as favorite
es: Guardar como favorito
ja: お気に入り保存

# workout_セット数_setslength_1
source: Number of sets: ${sets.length}
es: Número de conjuntos: ${sets.length}
ja: セット数: ${sets.length}

# workout_説明_2
source: explanation
es: explicación
ja: 説明

# general_App_Store_で入手
source: 📱 Get it on the App Store
es: 📱 Consíguelo en la App Store
ja: 📱 App Store で入手

# general_女性の上半身は男性より20高い成長率
source: Women's upper bodies grow 20% faster than men's
es: La parte superior del cuerpo de las mujeres crece un 20% más rápido que la de los hombres.
ja: 女性の上半身は男性より20%高い成長率

# profile_毎日のトレーニングを通知
source: Daily training notifications
es: Notificaciones diarias de entrenamiento
ja: 毎日のトレーニングを通知

# gym_上級者向け
source: For advanced users
es: Para usuarios avanzados
ja: 上級者向け

# general_AI残回数
source: AI remaining times: ∞
es: Tiempos restantes de IA: ∞
ja: AI残回数: ∞

# general_目標を更新しました_goalId
source: ✏️ Goal updated: $goalId
es: ✏️ Objetivo actualizado: $goalId
ja: ✏️ 目標を更新しました: $goalId

# workout_バイブレーションエラー_e
source: ❌ Vibration Error: $e
es: ❌ Error de vibración: $e
ja: ❌ バイブレーションエラー: $e

# general_整体
source: Chiropractic
es: Quiropráctica
ja: 整体

# general_近日公開予定
source: Coming soon
es: Muy pronto
ja: 近日公開予定

# gym_恵比寿駅直結の便利な総合フィットネスクラブ
source: A convenient comprehensive fitness club directly connected to Ebisu Station.
es: Un cómodo y completo gimnasio conectado directamente con la estación Ebisu.
ja: 恵比寿駅直結の便利な総合フィットネスクラブ。

# workout_isInitialized_true_現在選択中の部位の種目リスト_ListString_get_a
source: ], }; _isInitialized = true; } } / List of exercises for the currently selected body part List<String> get _availableExercises => _exercisesByBodyPart[_selectedBodyPart] ?? []; // ========================================= // 🆕 Phase 7.5: Automatic Data Acquisition Logic // ============================================ /// Obtain age from personal factor settings Future<void> _loadUserAge() async { try { final advancedFatigueService = AdvancedFatigueService(); final userProfile = await advancedFatigueService.getUserProfile(); if (mounted) { setState(() { _userAge = userProfile.age; }); } } catch (e) { debugPrint(
es: ], }; _isInitialized = true; } } / Lista de ejercicios para la parte del cuerpo seleccionada List<String> get _availableExercises => _exercisesByBodyPart[_selectedBodyPart] ?? []; // =========================================== // 🆕 Fase 7.5: Lógica de adquisición automática de datos // =============================================== /// Obtener la edad a partir de la configuración de factores personales Future<void> _loadUserAge() async { try { final advancedFatigueService = AdvancedFatigueService(); PerfilUsuario final = await advancedFatigueService.getUserProfile(); if (montado) { setState(() { _userAge = userProfile.age; }); } } catch(e) { debugPrint(
ja: ], }; _isInitialized = true; } } // 現在選択中の部位の種目リスト List<String> get _availableExercises => _exercisesByBodyPart[_selectedBodyPart] ?? []; // ======================================== // 🆕 Phase 7.5: データ自動取得ロジック // ======================================== /// 個人要因設定から年齢を取得 Future<void> _loadUserAge() async { try { final advancedFatigueService = AdvancedFatigueService(); final userProfile = await advancedFatigueService.getUserProfile(); if (mounted) { setState(() { _userAge = userProfile.age; }); } } catch (e) { debugPrint(

# subscription_月換算_667
source: Monthly equivalent ¥667
es: Equivalente mensual ¥667
ja: 月換算 ¥667

# general_30日間で5記録を達成しました_あなたは継続できる人です_このペースを維持すれば_80の確率で習慣化
source: You've achieved 5 milestones in 30 days! You're a consistent person 💪 If you keep this pace, you have an 80% chance of making it a habit!
es: ¡Has alcanzado 5 hitos en 30 días! Eres una persona constante 💪 Si mantienes este ritmo, ¡tienes un 80 % de posibilidades de convertirlo en un hábito!
ja: 30日間で5記録を達成しました！ あなたは継続できる人です💪 このペースを維持すれば、 80%の確率で習慣化できます！

# general_いいスタートですあとmagicNumberRecords_count記録で習慣化達成
source: That's a good start! Just ${magicNumberRecords - count} more records to make it a habit!
es: ¡Buen comienzo! ¡Solo ${magicNumberRecords - count} registros más para que se convierta en un hábito!
ja: いいスタートです！あと${magicNumberRecords - count}記録で習慣化達成！

# general_トレーニング分析_キャッシュヒット即座に応答
source: ✅ Training analysis: Cache hit (instant response)
es: ✅ Análisis de entrenamiento: Impacto de caché (respuesta instantánea)
ja: ✅ トレーニング分析: キャッシュヒット（即座に応答）

# general_月額コスト_CrowdDataConfigestimatedMonthlyCost
source: Monthly cost: ${CrowdDataConfig.estimatedMonthlyCost}
es: Costo mensual: ${CrowdDataConfig.estimatedMonthlyCost}
ja: 月額コスト: ${CrowdDataConfig.estimatedMonthlyCost}

# general_ℹ_復元可能な購入履歴がありません
source: ℹ️ No recoverable purchase history
es: ℹ️ No hay historial de compras recuperable
ja: ℹ️ 復元可能な購入履歴がありません

# general_このコードを投稿に必ず含めてください
source: ⚠️ Please make sure to include this code in your post
es: ⚠️ Asegúrate de incluir este código en tu publicación.
ja: ⚠️ このコードを投稿に必ず含めてください

# profile_iOS_120以降のiPhoneiPad_安定した動作にはiOS_140以降を推奨
source: iPhone/iPad running iOS 12.0 or later *iOS 14.0 or later is recommended for stable operation.
es: iPhone/iPad con iOS 12.0 o posterior *Se recomienda iOS 14.0 o posterior para un funcionamiento estable.
ja: iOS 12.0以降のiPhone/iPad ※安定した動作にはiOS 14.0以降を推奨

# general_プログレッシブオーバーロード漸進的過負荷の実践
source: * Practice progressive overload
es: * Practica la sobrecarga progresiva
ja: * プログレッシブオーバーロード（漸進的過負荷）の実践

# subscription_利用規約を開けませんでした
source: Could not open terms of use
es: No se pudieron abrir los términos de uso
ja: 利用規約を開けませんでした

# general_招待された側_AI無料利用3回
source: Invited party: Free AI use x 3 times
es: Fiesta invitada: uso gratuito de IA x 3 veces
ja: 招待された側: AI無料利用×3回

# subscription_進捗を確認する
source: Check your progress
es: Comprueba tu progreso
ja: 進捗を確認する

# personalFactor_0500の範囲で入力してください
source: Please enter a value between 0 and 500.
es: Introduzca un valor entre 0 y 500.
ja: 0〜500の範囲で入力してください

# general_記録を削除しました_1
source: ✅ Recording deleted
es: ✅ Grabación eliminada
ja: ✅ 記録を削除しました

# error_検索キャッシュサービス初期化エラー_e
source: ❌ Search Cache Service Initialization Error: $e
es: ❌ Error de inicialización del servicio de caché de búsqueda: $e
ja: ❌ 検索キャッシュサービス初期化エラー: $e

# personalFactor_現在の_Personal_Factor_Multiplier
source: Current Personal Factor Multiplier
es: Multiplicador de factores personales actuales
ja: 現在の Personal Factor Multiplier

# general_メッセージング機能
source: Messaging Features 🆕
es: Funciones de mensajería 🆕
ja: メッセージング機能 🆕

# workout_まだbodyPartの記録がありません
source: No record of $bodyPart yet
es: Aún no hay registro de $bodyPart
ja: まだ$bodyPartの記録がありません

# general_成功のカギ
source: ## Key to success
es: ## Clave del éxito
ja: ## 成功のカギ

# subscription_混雑度アラート通知_1
source: • Congestion Alert Notifications
es: • Notificaciones de alerta de congestión
ja: • 混雑度アラート通知

# general_削除対象
source: 🎯 Remove:
es: 🎯 Eliminar:
ja: 🎯 削除対象:

# workout_時間_timeMinutes分_距離_distancekm
source: - Time: ${timeMinutes} minutes, Distance: ${distance}km
es: - Tiempo: ${timeMinutes} minutos, Distancia: ${distance}km
ja: - 時間: ${timeMinutes}分, 距離: ${distance}km

# subscription_targetPlanName_に変更すると以下の機能が制限されます
source: Changing to $targetPlanName restricts the following functionality:
es: Cambiar a $targetPlanName restringe la siguiente funcionalidad:
ja: $targetPlanName に変更すると、以下の機能が制限されます：

# general_混雑度監視停止
source: ✅ Crowding monitoring stopped
es: ✅ Se detuvo el control de aglomeraciones
ja: ✅ 混雑度監視停止

# general_佐賀市
source: Saga City
es: Ciudad Saga
ja: 佐賀市

# general_AI使用回数をリセットしました
source: ✅ AI usage count reset
es: ✅ Restablecimiento del recuento de uso de IA
ja: ✅ AI使用回数をリセットしました

# general_フィルタ後_filteredWorkoutslength件
source: ✅ Filtered: ${filteredWorkouts.length} workouts
es: ✅ Filtrados: ${filteredWorkouts.length} entrenamientos
ja: ✅ フィルタ後: ${filteredWorkouts.length}件

# general_50回の報告ありがとうございます
source: Thank you for reporting 50 times
es: Gracias por reportar 50 veces
ja: 50回の報告ありがとうございます

# workout_カスタム種目をロード_decodedkeyslength部位
source: ✅ Load custom event: ${decoded.keys.length} part
es: ✅ Cargar evento personalizado: parte ${decoded.keys.length}
ja: ✅ カスタム種目をロード: ${decoded.keys.length}部位

# general_料金_300
source: Price: ¥300
es: Precio: ¥300
ja: 料金: ¥300

# workout_履歴データから最適な重量回数を推奨しています
source: Optimal weight and number of repetitions are recommended based on historical data
es: Se recomienda el peso óptimo y el número de repeticiones según datos históricos.
ja: 履歴データから最適な重量・回数を推奨しています

# general_あなたのトレーニングパターン
source: 💡 Your training patterns
es: 💡Tus patrones de entrenamiento
ja: 💡 あなたのトレーニングパターン

# workout_durationinMinutes分
source: ${duration.inMinutes} minutes
es: ${duration.inMinutes} minutos
ja: ${duration.inMinutes}分

# general_孤独なトレーニングから卒業_同じジム同じ目標の仲間と一緒に成長
source: Graduate from training alone and grow with friends at the same gym and with the same goals.
es: Deja de entrenar solo y crece con amigos en el mismo gimnasio y con los mismos objetivos.
ja: 孤独なトレーニングから卒業 同じジム・同じ目標の仲間と一緒に成長

# workout_AIクレジット消費_consumeSuccess
source: ✅ AI credit consumption: $consumeSuccess
es: ✅ Consumo de créditos de IA: $consumeSuccess
ja: ✅ AIクレジット消費: $consumeSuccess

# general_24ヶ月以上
source: 24 months or older
es: 24 meses o más
ja: 24ヶ月以上

# general_メッセージを送信
source: Send a message
es: Enviar un mensaje
ja: メッセージを送信

# general_検索タイプ_searchQueryisNotEmpty_AppLocalizationsofcont
source: Search type: ${_searchQuery.isNotEmpty ? AppLocalizations.of(context)!.textSearch :
es: Tipo de búsqueda: ${_searchQuery.isNotEmpty ? AppLocalizations.of(context)!.textSearch :
ja: 検索タイプ: ${_searchQuery.isNotEmpty ? AppLocalizations.of(context)!.textSearch :

# workout_利用可能なプレート
source: Available Plates
es: Platos disponibles
ja: 利用可能なプレート

# profile_過去のトレーニング履歴閲覧
source: • View past training history
es: • Ver historial de entrenamiento anterior
ja: • 過去のトレーニング履歴閲覧

# profile_動作環境
source: Operating environment
es: Entorno operativo
ja: 動作環境

# general_必須アップデートがあります_アプリを最新版に更新してください
source: A required update is available. Please update the app to the latest version.
es: Hay una actualización necesaria disponible. Actualiza la aplicación a la última versión.
ja: 必須アップデートがあります。 アプリを最新版に更新してください。

# workout_保存データ_setexerciseName_isTimeMode_setisTimeMode_isC
source: 💾 Saved data: ${set.exerciseName} - isTimeMode: ${set.isTimeMode}, isCardio: ${set.isCardio}, reps: ${set.reps}
es: 💾 Datos guardados: ${set.exerciseName} - isTimeMode: ${set.isTimeMode}, isCardio: ${set.isCardio}, repeticiones: ${set.reps}
ja: 💾 保存データ: ${set.exerciseName} - isTimeMode: ${set.isTimeMode}, isCardio: ${set.isCardio}, reps: ${set.reps}

# gym_東京都中野区中野444
source: 4-4-4 Nakano, Nakano Ward, Tokyo
es: 4-4-4 Nakano, distrito de Nakano, Tokio
ja: 東京都中野区中野4-4-4

# general_Firebase初期化成功
source: ✅ Firebase initialization successful
es: ✅ Inicialización de Firebase exitosa
ja: ✅ Firebase初期化成功

# general_申請受付中
source: Applications are currently being accepted
es: Actualmente se están aceptando solicitudes.
ja: 申請受付中

# general_lastユーザー_Pro非対称_isProUser
source: ).last}User (ProAsymmetric: ${isProUser ?
es: ).last}Usuario (ProAsimétrico: ${isProUser ?
ja: ).last}ユーザー (Pro非対称: ${isProUser ?

# general_Web位置情報取得タイムアウト10秒
source: ⏱️ Web location timeout (10 seconds)
es: ⏱️ Tiempo de espera de ubicación web (10 segundos)
ja: ⏱️ Web位置情報取得タイムアウト（10秒）

# workout_表示されるのは片側の枚数です両側に装着
source: • The number displayed is for one side (attached to both sides)
es: • El número que se muestra es para un lado (adjunto a ambos lados)
ja: • 表示されるのは片側の枚数です（両側に装着）

# general_Firebase認証成功_userId
source: ✅ Firebase authentication successful: $userId
es: ✅ Autenticación de Firebase exitosa: $userId
ja: ✅ Firebase認証成功: $userId

# general_ユーザーが未ログインです
source: ❌ User is not logged in
es: ❌ El usuario no ha iniciado sesión
ja: ❌ ユーザーが未ログインです

# gym_女性専用30分フィットネス気軽に通える環境
source: A 30-minute fitness center for women only. A casual and easy-to-access environment.
es: Gimnasio de 30 minutos solo para mujeres. Ambiente informal y de fácil acceso.
ja: 女性専用30分フィットネス。気軽に通える環境。

# gym_目黒駅徒歩3分充実した設備とプログラム
source: 3 minutes walk from Meguro Station. Fully equipped facilities and programs.
es: A 3 minutos a pie de la estación de Meguro. Instalaciones y programas totalmente equipados.
ja: 目黒駅徒歩3分。充実した設備とプログラム。

# general_休息レベル
source: Rest level
es: Nivel de descanso
ja: 休息レベル

# general_統計分析
source: Statistics/Analysis
es: Estadísticas/Análisis
ja: 統計・分析

# general_トレーニング記録を読み込み開始
source: 🔍 Training record loading...
es: 🔍Cargando registro de entrenamiento...
ja: 🔍 トレーニング記録を読み込み開始...

# general_位置情報取得開始
source: 📍 Start acquiring location information...
es: 📍Comienza a adquirir información de ubicación...
ja: 📍 位置情報取得開始...

# gym_例_春の入会キャンペーン開催中
source: Example: Spring membership campaign underway
es: Ejemplo: Campaña de membresía de primavera en marcha
ja: 例: 春の入会キャンペーン開催中

# general_コメント任意
source: Comments (optional)
es: Comentarios (opcional)
ja: コメント（任意）

# general_あと少しで達成今週中にいこう
source: We're almost there! Let's do it this week!
es: ¡Ya casi llegamos! ¡Hagámoslo esta semana!
ja: あと少しで達成！今週中にいこう！

# workout_カスタム種目名
source: Custom Event Name
es: Nombre de evento personalizado
ja: カスタム種目名

# general_ユーザーの全記録を取得中
source: 🔍 Retrieving all user records...
es: 🔍Recuperando todos los registros de usuarios...
ja: 🔍 ユーザーの全記録を取得中...

# error_マジックナンバー進捗取得エラー_e
source: ❌ Error getting magic number progress: $e
es: ❌ Error al obtener el progreso del número mágico: $e
ja: ❌ マジックナンバー進捗取得エラー: $e

# workout_取得件数_snapshotdocslength
source: 📊 Number of retrieved items: ${snapshot.docs.length}
es: 📊 Número de elementos recuperados: ${snapshot.docs.length}
ja: 📊 取得件数: ${snapshot.docs.length}

# workout_今週のレコメンデーション
source: This week's recommendations
es: Recomendaciones de esta semana
ja: 今週のレコメンデーション

# workout_10kg_軽量
source: 10kg (Lightweight)
es: 10 kg (peso ligero)
ja: 10kg (軽量)

# general_達成バッジ
source: Achievement badges
es: Insignias de logros
ja: 達成バッジ

# general_あなたの成長予測が待っています
source: Your growth forecast awaits
es: Tu pronóstico de crecimiento te espera
ja: あなたの成長予測が待っています

# profile_AIによるトレーニングメニュー提案
source: • AI-powered training menu suggestions
es: • Sugerencias de menú de entrenamiento basadas en IA
ja: • AIによるトレーニングメニュー提案

# profile_月額980年間プラン32_OFF
source: ¥980/month (32% off annual plan)
es: ¥980/mes (32% de descuento en el plan anual)
ja: 月額¥980（年間プラン32% OFF）

# workout_あなたはプロのパーソナルトレーナーです筋トレ初心者向けの全身トレーニングメニューを提案してください
source: You are a professional personal trainer. Please suggest a full-body training menu for beginners. $_beginnerExerciseDatabase $historyInfo [Target Audience] - Beginners to strength training (1-3 months into gym visits) - Those looking to build basic fitness - Those looking to learn training form [Proposal Format] **Please output in this format:** ``` ## Body Part Training Menu **Exercise 1: Exercise Name** * Weight: XX kg * Reps: XX * Sets: X * Rest Time: XX seconds * Form Points: Description **Exercise 2: Exercise Name** * Weight: XX kg * Reps: XX * Sets: X ``` Include the following information for each exercise: - Exercise Name (select from the exercise database) - **Specific Weight (kg)** ← Refer to your exercise history if available. If not, use the recommended weight for beginners. * For aerobic exercise, enter "Weight: 0 kg" and "Time: XX minutes" instead of "Reps." - **Repetitions (10-15 repetitions)** ← For aerobic exercises, enter "Time: 20-30 minutes" - Number of sets (2-3 sets) ← For aerobic exercises, enter "1 set" - Rest time (90-120 seconds) - Form tips for beginners [Conditions] - Balanced full-body training - Focus on basic exercises - Complete in 30-45 minutes - $languageInstruction **Important: Be sure to include the specific weight and repetitions for each exercise. For aerobic exercises, enter the weight as 0kg and the time in the format of XX minutes.**
ja: あなたはプロのパーソナルトレーナーです。筋トレ初心者向けの全身トレーニングメニューを提案してください。 $_beginnerExerciseDatabase $historyInfo 【対象者】 - 筋トレ初心者（ジム通い始めて1〜3ヶ月程度） - 基礎体力づくりを目指す方 - トレーニングフォームを学びたい方 【提案形式】 **必ずこの形式で出力してください：** ``` ## 部位トレーニングメニュー **種目1：種目名** * 重量：XXkg * 回数：XX回 * セット数：Xセット * 休憩時間：XX秒 * フォームのポイント：説明文 **種目2：種目名** * 重量：XXkg * 回数：XX回 * セット数：Xセット ``` 各種目について以下の情報を含めてください： - 種目名（種目データベースから選択） - **具体的な重量（kg）** ← 履歴があればそれを参考に、なければ初心者向けの推奨重量 ※有酸素運動の場合は「重量：0kg」とし、回数の代わりに「時間：XX分」を記載 - **回数（10-15回）** ← 有酸素の場合は「時間：20-30分」 - セット数（2-3セット）← 有酸素の場合は「1セット」 - 休憩時間（90-120秒） - 初心者向けフォームのポイント 【条件】 - 全身をバランスよく鍛える - 基本種目中心 - 30-45分で完了 - $languageInstruction **重要: 各種目に具体的な重量と回数を必ず記載してください。有酸素運動の場合は重量0kg、時間をXX分形式で記載してください。**

# workout_isLoading_false_override_Widget_buildBuildContext
source: , }; _isLoading = false; }); } } } @override Widget build(BuildContext context) { super.build(context); return SingleChildScrollView( padding: const EdgeInsets.all(16.0), child: Form( key: _formKey, child: Column( crossAxisAlignment: CrossAxisAlignment.stretch, children: [ // Header _buildHeader(), const SizedBox(height: 24), // Input Form _buildInputForm(), const SizedBox(height: 24), // Prediction Button _buildPredictButton(), const SizedBox(height: 32), // Prediction Result if (_isLoading) _buildLoadingIndicator() else if (_predictionResult != null) _buildPredictionResult(), ], ), ), ); } /// header Widget _buildHeader() { return Card( color: Colors.purple.shade50, child: Padding( padding: const EdgeInsets.all(16.0), child: Row( children: [ Icon(Icons.timeline, size: 40, color: Colors.purple.shade700), SizedBox(width: 16), Expanded( child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Text( AppLocalizations.of(context)!.aiGrowthPrediction, style: TextStyle( fontSize: 20, fontWeight: FontWeight.bold, color: Colors.purple.shade900, ), ), SizeBox(height: 4), Text( AppLocalizations.of(context)!.scientificPrediction, style: TextStyle( fontSize: 13, color: Colors.grey.shade700, ), ), ], ), ), ], ), ), ); } /// Input form Widget _buildInputForm() { return Card( child: Padding( padding: const EdgeInsets.all(16.0), child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ const Text(
ja: , }; _isLoading = false; }); } } } @override Widget build(BuildContext context) { super.build(context); return SingleChildScrollView( padding: const EdgeInsets.all(16.0), child: Form( key: _formKey, child: Column( crossAxisAlignment: CrossAxisAlignment.stretch, children: [ // ヘッダー _buildHeader(), const SizedBox(height: 24), // 入力フォーム _buildInputForm(), const SizedBox(height: 24), // 予測実行ボタン _buildPredictButton(), const SizedBox(height: 32), // 予測結果 if (_isLoading) _buildLoadingIndicator() else if (_predictionResult != null) _buildPredictionResult(), ], ), ), ); } /// ヘッダー Widget _buildHeader() { return Card( color: Colors.purple.shade50, child: Padding( padding: const EdgeInsets.all(16.0), child: Row( children: [ Icon(Icons.timeline, size: 40, color: Colors.purple.shade700), SizedBox(width: 16), Expanded( child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ Text( AppLocalizations.of(context)!.aiGrowthPrediction, style: TextStyle( fontSize: 20, fontWeight: FontWeight.bold, color: Colors.purple.shade900, ), ), SizedBox(height: 4), Text( AppLocalizations.of(context)!.scientificPrediction, style: TextStyle( fontSize: 13, color: Colors.grey.shade700, ), ), ], ), ), ], ), ), ); } /// 入力フォーム Widget _buildInputForm() { return Card( child: Padding( padding: const EdgeInsets.all(16.0), child: Column( crossAxisAlignment: CrossAxisAlignment.start, children: [ const Text(

# general_DUPDaily_Undulating_Periodizationに変更Williams_2017
source: Changed to DUP (Daily Undulating Periodization) (Williams 2017, ES=0.68)
ja: DUP（Daily Undulating Periodization）に変更（Williams 2017, ES=0.68）

# workout_name_targetSetsセット_targetReps回_targetWeightkg_有酸素
source: ✅ $name: ${targetSets} sets × ${targetReps} @ ${targetWeight}kg (Aerobic: $isCardio)
ja: ✅ $name: ${targetSets}セット × ${targetReps}回 @ ${targetWeight}kg (有酸素: $isCardio)
