Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

# general_科学的根拠データベース_1_筋力向上率の基準値_初心者_06ヶ月_月1525_根拠_Effect_o_1
source: [Scientific Evidence Database] ## 1. Baseline Strength Improvement Rate - Beginner (0-6 months): +15-25% per month (Based on: Effect of High Intensity - +31.2% in 6 weeks) - Intermediate (6-24 months): +5-10% per month (Based on: ACSM 2009 - Estimates from experienced exercisers and models) - Advanced (24 months and older): +1-3% per month (Based on: ACSM 2009 - Periodization Model) - Progression Rule: Increase load by +2-10% after exceeding target repetitions by 1-2 times (Based on: ACSM 2009) ## 2. Optimal Training Frequency - Principle: Total volume is paramount. For volume-equivalent exercises, there was no significant difference in strength gains by frequency (p = 0.421) (Source: Grgic et al. 2018 Sports Medicine). - Non-volume-equivalent exercises: 2 times per week (ES 0.82), 3 times per week (ES 0.93). Increased frequency allows for increased volume (Evidence: Grgic et al. 2018) - Hypertrophy: Twice a week is superior to once a week (Evidence: Schoenfeld et al. 2016 Sports Medicine) - Recommendations by Body Part: * Upper body/multi-joint exercises: 3 or more times a week is effective (p = 0.004) * Lower body: 2-3 times a week * Chest: 2 times a week * Back: 2 times a week * Legs: 2-3 times a week * Shoulders: 2 times a week * Arms: 2-3 times a week ## 3. Plateau Definition and Countermeasures - Definition: A state in which progress in a major exercise has stagnated for 3-4 weeks. - Breakthrough Method 1 (New Stimulus): Introducing Advanced Techniques * Drop Sets: Reducing Load After Limitation and Continuing * Supersets: Combining Antagonistic Muscles * Cluster Sets: Improving Quality with Inter-Set Rest * AEL: Emphasis on Negative Movements (Source: Krzysztofik et al. 2019 Int J Environ Res Public Health) - Breakthrough 2 (Fatigue Management): Deload * Reduce volume (number of sets) by 30-50% * Maintain intensity (weight) * Duration: 1 week (Source: Bell et al. 2023 BMC Sports Sci Med Rehabil) ## 4. Recommended Training Volume (by Body Part, per Week) - General Principle: There is a "gradual dose-response relationship" for both strength and hypertrophy. The higher the volume, the greater the effect. - Hypertrophy (Effect of Additional Sets): Each additional set increases hypertrophy by +0.37% (p = 0.002) (Source: Schoenfeld et al. 2017 J Sports Sci) - Beginners: 10-12 sets per week per body part (Source: Ralston et al. 2017 - 5 sets per week or less is ineffective) - Intermediate/Advanced: 12-20 sets per week per body part (Source: Baz-Valle et al. 2022 J Hum Kinet) - Overtraining Threshold: The effect plateaus at 20 sets per week or more, depending on the body part. * Triceps: Effective with 20 sets per week or more (p = 0.01) * Quadriceps/Biceps: 12-20 sets per week is sufficient (p = 0.19, p = 0.59) ## 5. Optimal Rest Days (Same Muscle Group) - Large Muscle Groups (Legs, Back, Chest): 48-72 hours * Beginners: 72 hours (3 days) * Intermediate/Advanced: 48 hours (2 days) - Small Muscle Groups (Shoulders/Arms): 24-48 hours * Beginners: 48 hours (2 days) * Intermediate/Advanced: 24-48 hours (1-2 days) - Physiological Rationale: Muscle Protein Synthesis (MPS) can last up to 48 hours (Source: Davies et al. 2024 Transl Sports Med) - Level-Specific: Beginners have a longer MPS duration (48+ hours), while advanced athletes have a shorter MPS duration (<24 hours) (Source: Damas et al. 2016 Sports Med) ## 6. Recommended Training Intensity - Strength Improvement: High intensity (>60% 1RM) is essential. Significantly better than low intensities. * Beginner: 65-75% of 1RM x 8-12 repetitions * Intermediate: 70-80% of 1RM x 6-10 repetitions * Advanced: 75-85% of 1RM x 4-8 repetitions (Source: Schoenfeld et al. 2017 J Strength Cond Res; ACSM 2009) - Purpose-specific (muscle hypertrophy): "Exerting to the limit" is important. High-intensity and low-intensity training produces similar muscle hypertrophy if performed to failure. (Source: Schoenfeld et al. 2017) - Need for failure: * Strength: Not required (ES = -0.09, not significant) * Hypertrophy (experienced users only): Performing to failure is more effective (ES = 0.15, p < 0.05) (Source: Grgic et al. 2022 J Sport Health Sci) - RIR (Remaining Repetitions): Beginners and intermediates should achieve RIR 2-3, while advanced users (targeting hypertrophy) should achieve RIR 0-1. ## 7. Age, Gender, and Genetic Factors - Age: Even those over 50 can achieve significant strength gains with high-intensity training. * Leg press: +29% * Chest press: +24% * Knee extension: +33% (Source: Peterson et al. 2010 Med Sci Sports Exerc) - Gender (Hypertrophy): No gender differences in relative hypertrophy rates (Evidence: 2024 PeerJ Meta-Analysis) - Gender (Strength): * Lower body (relative): No gender differences (p = 0.20) * **Upper body (relative): Women showed significantly higher improvement rates than men (ES = -0.60, p = 0.002)** (Evidence: Roberts et al. 2020 J Strength Cond Res) - Genetics (Individual Differences): "Global Non-Responders" are unlikely to exist * Stagnation is due to "program mismatch" rather than "genetic limitations" * AI should suggest changes in volume, intensity, and frequency (Evidence: Pickering & Kiely 2019 Sports Med)
es: [Base de datos de evidencia científica] ## 1. Tasa de mejora de la fuerza inicial - Principiante (0-6 meses): +15-25 % al mes (Basado en: Efecto de alta intensidad: +31,2 % en 6 semanas) - Intermedio (6-24 meses): +5-10 % al mes (Basado en: ACSM 2009 - Estimaciones de usuarios experimentados y modelos) - Avanzado (24 meses o más): +1-3 % al mes (Basado en: ACSM 2009 - Modelo de periodización) - Regla de progresión: Aumentar la carga entre un 2 % y un 10 % después de superar las repeticiones objetivo entre 1 y 2 veces (Basado en: ACSM 2009) ## 2. Frecuencia óptima de entrenamiento - Principio: El volumen total es primordial. Para ejercicios de volumen equivalente, no se observaron diferencias significativas en las ganancias de fuerza según la frecuencia (p = 0,421) (Fuente: Grgic et al., 2018 Sports Medicine). - Ejercicios no equivalentes al volumen: 2 veces por semana (ES 0,82), 3 veces por semana (ES 0,93). Aumentar la frecuencia permite aumentar el volumen (Evidencia: Grgic et al. 2018). - Hipertrofia: Dos veces por semana es superior a una vez por semana (Evidencia: Schoenfeld et al. 2016 Sports Medicine). - Recomendaciones por parte del cuerpo: * Ejercicios de tren superior/multiarticulares: 3 o más veces por semana es efectivo (p = 0,004). * Tren inferior: 2-3 veces por semana. * Pecho: 2 veces por semana. * Espalda: 2 veces por semana. * Piernas: 2-3 veces por semana. * Hombros: 2 veces por semana. * Brazos: 2-3 veces por semana. ## 3. Definición de estancamiento y contramedidas - Definición: Estado en el que el progreso en un ejercicio importante se ha estancado durante 3-4 semanas. - Método Innovador 1 (Nuevo Estímulo): Introducción de Técnicas Avanzadas * Series Descendentes: Reducción de la Carga Tras la Limitación y Continuación * Superseries: Combinación de Músculos Antagónicos * Series Cluster: Mejora de la Calidad con Descanso Interseries * AEL: Énfasis en Movimientos Negativos (Fuente: Krzysztofik et al. 2019 Int J Environ Res Public Health) - Método Innovador 2 (Manejo de la Fatiga): Descarga * Reducir el volumen (número de series) entre un 30% y un 50% * Mantener la intensidad (peso) * Duración: 1 semana (Fuente: Bell et al. 2023 BMC Sports Sci Med Rehabil) ## 4. Volumen de Entrenamiento Recomendado (por Parte Corporal, por Semana) - Principio General: Existe una relación dosis-respuesta gradual tanto para la fuerza como para la hipertrofia. A mayor volumen, mayor efecto. Hipertrofia (Efecto de las series adicionales): Cada serie adicional aumenta la hipertrofia en un +0,37 % (p = 0,002) (Fuente: Schoenfeld et al. 2017 J Sports Sci) Principiantes: 10-12 series semanales por grupo muscular (Fuente: Ralston et al. 2017 - 5 series semanales o menos son ineficaces) Intermedio/Avanzado: 12-20 series semanales por grupo muscular (Fuente: Baz-Valle et al. 2022 J Hum Kinet) Umbral de sobreentrenamiento: El efecto se estabiliza en 20 series semanales o más, dependiendo del grupo muscular. * Tríceps: Eficaz con 20 series semanales o más (p = 0,01) * Cuádriceps/Bíceps: 12-20 series semanales son suficientes (p = 0,19, p = 0,59) ## 5. Días de descanso óptimos (mismo grupo muscular) - Grupos musculares grandes (piernas, espalda, pecho): 48-72 horas * Principiantes: 72 horas (3 días) * Intermedio/Avanzado: 48 horas (2 días) - Grupos musculares pequeños (hombros/brazos): 24-48 horas * Principiantes: 48 horas (2 días) * Intermedio/Avanzado: 24-48 horas (1-2 días) - Justificación fisiológica: La síntesis de proteína muscular (SPM) puede durar hasta 48 horas (Fuente: Davies et al. 2024 Transl Sports Med) - Nivel específico: Principiantes Tienen una mayor duración de la SPM (más de 48 horas), mientras que los atletas avanzados la tienen más corta (menos de 24 horas) (Fuente: Damas et al., 2016 Sports Med). ## 6. Intensidad de entrenamiento recomendada - Mejora de la fuerza: La alta intensidad (>60 % de 1RM) es esencial. Significativamente mejor que las intensidades bajas. * Principiante: 65-75 % de 1RM x 8-12 repeticiones * Intermedio: 70-80 % de 1RM x 6-10 repeticiones * Avanzado: 75-85 % de 1RM x 4-8 repeticiones (Fuente: Schoenfeld et al., 2017 J Strength Cond Res; ACSM, 2009) - Objetivo específico (hipertrofia muscular): Esforzarse al máximo es importante. El entrenamiento de alta y baja intensidad produce una hipertrofia muscular similar si se realiza hasta el fallo muscular. (Fuente: Schoenfeld et al. 2017) - Necesidad de fallo: * Fuerza: No requerida (ES = -0,09, no significativo) * Hipertrofia (solo para usuarios experimentados): El rendimiento hasta el fallo es más efectivo (ES = 0,15, p < 0,05) (Fuente: Grgic et al. 2022 J Sport Health Sci) - RIR (Repeticiones Restantes): Los principiantes e intermedios deberían alcanzar un RIR de 2 a 3, mientras que los usuarios avanzados (que buscan hipertrofia) deberían alcanzar un RIR de 0 a 1. ## 7. Edad, sexo y factores genéticos - Edad: Incluso los mayores de 50 años pueden lograr ganancias de fuerza significativas con el entrenamiento de alta intensidad. * Prensa de piernas: +29% * Prensa de pecho: +24% * Extensión de rodilla: +33% (Fuente: Peterson et al. 2010 Med Sci Sports Exerc) - Género (Hipertrofia): Sin diferencias de género en las tasas de hipertrofia relativa (Evidencia: Metaanálisis de PeerJ 2024) - Género (Fuerza): * Tren inferior (relativo): Sin diferencias de género (p = 0,20) * **Tren superior (relativo): Las mujeres mostraron tasas de mejora significativamente mayores que los hombres (ES = -0,60, p = 0,002)** (Evidencia: Roberts et al. 2020 J Strength Cond Res) - Genética (Diferencias individuales): Es improbable que existan "personas que no responden globalmente" * El estancamiento se debe a una "falta de coincidencia del programa" más que a "limitaciones genéticas" * La IA debería sugerir cambios en el volumen, la intensidad y la frecuencia (Evidencia: Pickering y Kiely) Medicina Deportiva 2019)
ja: 【科学的根拠データベース】 ## 1. 筋力向上率の基準値 - 初心者 (0-6ヶ月): 月+15-25% （根拠: Effect of high intensity - 6週間で+31.2%のデータ） - 中級者 (6-24ヶ月): 月+5-10% （根拠: ACSM 2009 - 経験者データとモデルからの推定） - 上級者 (24ヶ月以上): 月+1-3% （根拠: ACSM 2009 - ピリオダイゼーションモデル） - 進捗ルール: 目標レップを1-2回超過達成で、負荷を +2-10% 増加 （根拠: ACSM 2009） ## 2. 最適トレーニング頻度 - 原則: 総ボリュームが最重要。ボリューム等価の場合、頻度による筋力向上の有意差なし (p = 0.421)（根拠: Grgic et al. 2018 Sports Medicine） - ボリューム非等価: 週2回 (ES 0.82), 週3回 (ES 0.93)。頻度増がボリューム増を可能にする（根拠: Grgic et al. 2018） - 筋肥大: 週2回は週1回より優位（根拠: Schoenfeld et al. 2016 Sports Medicine） - 部位別推奨: * 上半身・多関節種目: 週3回以上が有効 (p = 0.004) * 下半身: 週2-3回 * 胸: 週2回 * 背中: 週2回 * 脚: 週2-3回 * 肩: 週2回 * 腕: 週2-3回 ## 3. プラトー期の定義と対策 - 定義: 主要種目の進捗が 3-4週間 停滞した状態 - 打破方法1（新刺激）: 高度なテクニック導入 * ドロップセット: 限界後に負荷を下げて継続 * スーパーセット: 拮抗筋の組み合わせ * クラスターセット: セット内休憩で質向上 * AEL: ネガティブ動作の強調 （根拠: Krzysztofik et al. 2019 Int J Environ Res Public Health） - 打破方法2（疲労管理）: ディロードの実施 * ボリューム（セット数）を30-50%削減 * 強度（重量）は維持 * 期間: 1週間 （根拠: Bell et al. 2023 BMC Sports Sci Med Rehabil） ## 4. 推奨トレーニングボリューム（部位別・週あたり） - 原則: 筋力・筋肥大ともに「段階的用量反応関係」あり。ボリュームが多いほど効果大 - 筋肥大（セット追加効果）: 1セット追加ごとに筋肥大ゲイン +0.37% (p = 0.002) （根拠: Schoenfeld et al. 2017 J Sports Sci） - 初心者: 週 10-12 セット / 部位（根拠: Ralston et al. 2017 - 週5セット以下は非効果的） - 中級・上級者: 週 12-20 セット / 部位（根拠: Baz-Valle et al. 2022 J Hum Kinet） - 過剰トレーニング閾値: 週20セット以上は部位により効果が頭打ち * 上腕三頭筋: 週20セット以上で有効 (p=0.01) * 大腿四頭筋・上腕二頭筋: 週12-20セットで十分 (p=0.19, p=0.59) ## 5. 最適休息日数（同一筋群） - 大筋群 (脚・背中・胸): 48-72時間 * 初心者: 72時間 (3日) * 中級・上級者: 48時間 (2日) - 小筋群 (肩・腕): 24-48時間 * 初心者: 48時間 (2日) * 中級・上級者: 24-48時間 (1-2日) - 生理学的根拠: 筋タンパク質合成(MPS)が最大48時間持続（根拠: Davies et al. 2024 Transl Sports Med） - レベル別: 初心者はMPS持続時間が長く（48h+）、上級者は短い（<24h）（根拠: Damas et al. 2016 Sports Med） ## 6. 推奨トレーニング強度 - 目的別（筋力向上）: 高強度（>60% 1RM）が必須。低強度より有意に優れている * 初心者: 1RMの65-75% × 8-12回 * 中級者: 1RMの70-80% × 6-10回 * 上級者: 1RMの75-85% × 4-8回 （根拠: Schoenfeld et al. 2017 J Strength Cond Res; ACSM 2009） - 目的別（筋肥大）: 「限界までの努力」が重要。限界まで行えば、高強度でも低強度でも筋肥大は同等 （根拠: Schoenfeld et al. 2017） - 限界（Failure）の要否: * 筋力: 不要（ES = -0.09, 有意差なし） * 筋肥大（経験者のみ）: 限界まで行う方が有効 (ES = 0.15, p < 0.05) （根拠: Grgic et al. 2022 J Sport Health Sci） - RIR（残り反復回数）: 初心者・中級者はRIR 2-3、上級者（筋肥大目的）はRIR 0-1推奨 ## 7. 年齢・性別・遺伝要因 - 年齢: 50歳以上でも高強度トレーニングで大幅な筋力向上が可能 * レッグプレス: +29% * チェストプレス: +24% * 膝伸展: +33% （根拠: Peterson et al. 2010 Med Sci Sports Exerc） - 性別（筋肥大）: 相対的な筋肥大率に男女差なし（根拠: 2024 PeerJ メタアナリシス） - 性別（筋力）: * 下半身（相対）: 男女差なし (p = 0.20) * **上半身（相対）: 女性の方が男性より有意に向上率が高い (ES = -0.60, p = 0.002)** （根拠: Roberts et al. 2020 J Strength Cond Res） - 遺伝（個人差）: 「グローバル・ノンレスポンダー」は存在しない可能性が高い * 停滞は「遺伝的限界」ではなく「プログラムのミスマッチ」 * AIはボリューム・強度・頻度の変更を提案すべき （根拠: Pickering & Kiely 2019 Sports Med）

# general_5分以内に10回の連続呼び出し
source: 10 consecutive calls within 5 minutes
es: 10 llamadas consecutivas en 5 minutos
ja: 5分以内に10回の連続呼び出し

# workout_AIコーチの推奨メニューを読み込みました_selectedExerciseslength種目
source: AI Coach recommendations loaded (${selectedExercises.length} exercises)
es: Recomendaciones de AI Coach cargadas (ejercicios ${selectedExercises.length})
ja: AIコーチの推奨メニューを読み込みました (${selectedExercises.length}種目)

# general_お気に入り削除_gymId
source: ✅ Remove from favorites: $gymId
es: ✅ Eliminar de favoritos: $gymId
ja: ✅ お気に入り削除: $gymId

# general_4_手動リセットボタンで即座に回数をリセット可能
source: 4. The number of times can be reset instantly using the manual reset button
es: 4. El número de veces se puede restablecer instantáneamente utilizando el botón de reinicio manual.
ja: 4. 手動リセットボタンで即座に回数をリセット可能

# general_目標を削除しました_goalId
source: 🗑️ Goal deleted: $goalId
es: 🗑️ Objetivo eliminado: $goalId
ja: 🗑️ 目標を削除しました: $goalId

# subscription_混雑度アラート通知
source: 🔔 Congestion alert notification
es: 🔔 Notificación de alerta de congestión
ja: 🔔 混雑度アラート通知

# workout_Phase_7_体重データが無効またはゼロ_weightweight
source: ⚠️ [Phase 7] Weight data is invalid or zero: weight=$weight
es: ⚠️ [Fase 7] Los datos de peso no son válidos o son cero: peso=$peso
ja: ⚠️ [Phase 7] 体重データが無効またはゼロ: weight=$weight

# general_GYM_MATCH_を気に入っていますか
source: Love GYM MATCH?
es: ¿Te encanta GYM MATCH?
ja: GYM MATCH を気に入っていますか？

# general_自動化ツールの利用が疑われます
source: The use of automated tools is suspected.
es: Se sospecha del uso de herramientas automatizadas.
ja: 自動化ツールの利用が疑われます。

# general_続行することで利用規約とプライバシーポリシーに同意したものとみなされます
source: By continuing, you agree to our Terms of Use and Privacy Policy
es: Al continuar, acepta nuestros Términos de uso y Política de privacidad.
ja: 続行することで、利用規約とプライバシーポリシーに同意したものとみなされます

# general_Google_Places_API_timeout_フォールバックします
source: ⏱️ Google Places API timeout - fallback
es: ⏱️ Tiempo de espera de la API de Google Places: alternativa
ja: ⏱️ Google Places API timeout - フォールバックします

# workout_AI疲労度分析を試してみませんか
source: Would you like to try AI fatigue analysis?
es: ¿Quieres probar el análisis de fatiga mediante IA?
ja: AI疲労度分析を試してみませんか？

# general_今月のAI分析は残り0回です
source: There are 0 AI analyses left this month
es: Quedan 0 análisis de IA este mes
ja: 今月のAI分析は残り0回です

# general_Phase_2a実装完了_Foster_et_al_2001のSession_RPE理論を採用
source: Phase 2a implementation complete Adopting Foster et al.'s (2001) Session RPE theory
es: Implementación de la fase 2a completada Adopción de la teoría de RPE de sesión de Foster et al. (2001)
ja: Phase 2a実装完了 Foster et al. (2001)のSession RPE理論を採用

# error_キャッシュ無効化エラー_e
source: ❌ Cache invalidation error: $e
es: ❌ Error de invalidación de caché: $e
ja: ❌ キャッシュ無効化エラー: $e

# error_トレーニングシェアエラー_e
source: ❌ Training Share Error: $e
es: ❌ Error al compartir capacitación: $e
ja: ❌ トレーニングシェアエラー: $e

# error_メッセージ送信失敗_e
source: ❌ Message sending failed: $e
es: ❌ Error en el envío del mensaje: $e
ja: ❌ メッセージ送信失敗: $e

# subscription_RevenueCat_タイムアウト_キャッシュ使用
source: ⏱️ RevenueCat Timeout - Use Cache
es: ⏱️ Tiempo de espera de RevenueCat: usar caché
ja: ⏱️ RevenueCat タイムアウト - キャッシュ使用

# profile_本規約の解釈にあたっては日本法を準拠法とします
source: • The interpretation of these terms and conditions shall be governed by Japanese law.
es: • La interpretación de estos términos y condiciones se regirá por la legislación japonesa.
ja: • 本規約の解釈にあたっては、日本法を準拠法とします。

# workout_exerciseNameを削除しました
source: "$exerciseName" has been deleted
es: "$exerciseName" ha sido eliminado
ja: 「$exerciseName」を削除しました

# workout_Proプランなら月30回
source: 🏆 Pro plan offers 30 sessions per month!
es: ¡El plan Pro ofrece 30 sesiones por mes!
ja: 🏆 Proプランなら月30回！

# profile_Proプラン限定機能
source: Pro plan exclusive features
es: Funciones exclusivas del plan Pro
ja: Proプラン限定機能

# general_お得
source: Great deal!
es: ¡Gran oferta!
ja: お得！

# workout_カスタム種目の保存に失敗_e
source: ⚠️ Failed to save custom event: $e
es: ⚠️ Error al guardar el evento personalizado: $e
ja: ⚠️ カスタム種目の保存に失敗: $e

# general_お気に入りのジム_favoriteGymslength件
source: Favorite Gyms (${_favoriteGyms.length})
es: Gimnasios favoritos (${_favoriteGyms.length})
ja: お気に入りのジム (${_favoriteGyms.length}件)

# general_ℹ_レビュー拒否_cooldownDays日間はリクエストしません
source: ℹ️ Review Rejection: Not Requested for ${_cooldownDays} Days
es: ℹ️ Rechazo de revisión: No solicitado durante ${_cooldownDays} días
ja: ℹ️ レビュー拒否: ${_cooldownDays}日間はリクエストしません

# general_bodyPart_のトレーニング_週recommendedFreq
source: * Training for $bodyPart: Weekly ${recommendedFreq[
es: * Entrenamiento para $bodyPart: ${recommendedFreq[ semanal
ja: * $bodyPart のトレーニング: 週${recommendedFreq[

# workout_統計読み込み開始
source: 📊 Statistics loading...
es: 📊 Estadísticas cargando...
ja: 📊 統計読み込み開始...

# general_招待コードの特典
source: Invitation code benefits
es: Beneficios del código de invitación
ja: 招待コードの特典

# general_リワード広告ID_rewardAdUnitId
source: 🎬 Rewarded Ad ID: $_rewardAdUnitId
es: 🎬 ID de anuncio recompensado: $_rewardAdUnitId
ja: 🎬 リワード広告ID: $_rewardAdUnitId

# general_バッジがありません
source: No badges
es: Sin insignias
ja: バッジがありません

# general_アクセスコードは8文字以上です
source: The access code must be at least 8 characters long
es: El código de acceso debe tener al menos 8 caracteres.
ja: アクセスコードは8文字以上です

# general_実力が近い人のみ15_1RM
source: Only people of similar ability (±15% 1RM)
es: Sólo personas con capacidad similar (±15% 1RM)
ja: 実力が近い人のみ（±15% 1RM）

# personalFactor_範囲_07x_13x_最小30減最大30増
source: Range: 0.7x - 1.3x (minimum 30% decrease, maximum 30% increase)
es: Rango: 0,7x - 1,3x (disminución mínima del 30 %, aumento máximo del 30 %)
ja: 範囲: 0.7x - 1.3x (最小30%減〜最大30%増)

# general_PR達成王
source: PR achievement king
es: Rey de los logros en relaciones públicas
ja: PR達成王

# general_ℹ_初回ボーナス_既に付与済み
source: ℹ️ First Bonus: Already granted
es: ℹ️ Primer Bono: Ya otorgado
ja: ℹ️ 初回ボーナス: 既に付与済み

# workout_有酸素運動データ
source: 🏃 Cardio data
es: 🏃 Datos cardiovasculares
ja: 🏃 有酸素運動データ

# general_データ不足2週間以上の履歴が必要
source: Insufficient data: More than two weeks of history required
es: Datos insuficientes: se requieren más de dos semanas de historial
ja: データ不足：2週間以上の履歴が必要

# workout_エラーチェック_if_predictionResult
source: ), ), ); } // Error check if (_predictionResult![
es: ), ), ); } // Comprobación de errores if (_predictionResult![
ja: ), ), ); } // エラーチェック if (_predictionResult![

# workout_合計時間
source: Total time
es: Tiempo total
ja: 合計時間

# general_残り_remaining回
source: Remaining: $remaining times
es: Restante: $tiempos restantes
ja: 残り: $remaining回

# subscription_プラン変更手順
source: Plan change procedure
es: Procedimiento de cambio de plan
ja: プラン変更手順

# general_Premium_1ヶ月無料_1
source: 🎁 1 month free Premium
es: 🎁 1 mes Premium gratis
ja: 🎁 Premium 1ヶ月無料

# error_シェアイベント記録エラー_e
source: ❌ Share event recording error: $e
es: ❌ Error al grabar evento compartido: $e
ja: ❌ シェアイベント記録エラー: $e

# general_GPS位置情報取得成功_positionlatitude_positionlongitude
source: ✅ Successful acquisition of GPS location information: ${position.latitude}, ${position.longitude}
es: ✅ Adquisición exitosa de información de ubicación GPS: ${position.latitude}, ${position.longitude}
ja: ✅ GPS位置情報取得成功: ${position.latitude}, ${position.longitude}

# personalFactor_1ユニット毎に5_ビール350ml14ユニット
source: +5% for each unit (350ml of beer ≒ 1.4 units)
es: +5% por cada unidad (350ml de cerveza ≒ 1,4 unidades)
ja: 1ユニット毎に+5% (ビール350ml≒1.4ユニット)

# workout_exerciseName_に1セット追加前回_lastWeightkg_lastRepsreps_i
source: ✅ Added 1 set to $exerciseName (Last time: ${lastWeight}kg × ${lastReps}reps, isTimeMode: ${lastIsTimeMode ?? _getDefaultTimeMode(exerciseName)}, isCardio: ${lastIsCardio ?? _isCardioExercise(exerciseName)})
es: ✅ Se agregó 1 conjunto a $exerciseName (Última vez: ${lastWeight}kg × ${lastReps}reps, isTimeMode: ${lastIsTimeMode ?? _getDefaultTimeMode(exerciseName)}, isCardio: ${lastIsCardio ?? _isCardioExercise(exerciseName)})
ja: ✅ $exerciseName に1セット追加（前回: ${lastWeight}kg × ${lastReps}reps, isTimeMode: ${lastIsTimeMode ?? _getDefaultTimeMode(exerciseName)}, isCardio: ${lastIsCardio ?? _isCardioExercise(exerciseName)}）

# profile_サービス
source: service
es: servicio
ja: サービス

# workout_style_TextStyle_fontSize_16_fontWeight_FontWeightb_3
source: , style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, ), ), ], ), const SizedBox(height: 12), Row( children: [ Container( padding: const EdgeInsets.symmetric(horizontal: 12, vertical: 6), decoration: BoxDecoration( color: statusColor.withValues(alpha: 0.2), Radius: BorderRadius.circular(16), ), child: Text( statusLabel, style: TextStyle( color: statusColor, fontWeight: FontWeight.bold, ), ), ), ], ), const SizedBox(height: 12), Text( advice, style: const TextStyle(fontSize: 14, height: 1.6), ), ], ), ), ); } /// Frequency analysis Widget _buildFrequencyAnalysis(Map<String, dynamic> analysis) { final status = analysis[
es: , estilo: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, ), ), ], ), const SizedBox(altura: 12), Row( hijos: [ Container( padding: const EdgeInsets.symmetric(horizontal: 12, vertical: 6), decoration: BoxDecoration( color: statusColor.withValues(alpha: 0.2), Radius: BorderRadius.circular(16), ), hijo: Text( statusLabel, estilo: TextStyle( color: statusColor, fontWeight: FontWeight.bold, ), ), ), ], ), const SizedBox(altura: 12), Text( advertencia, estilo: const TextStyle(fontSize: 14, altura: 1.6), ), ], ), ), ); } /// Análisis de frecuencia Widget _buildFrequencyAnalysis(Map<String, dynamic> analysis) { estado final = análisis[
ja: , style: TextStyle( fontSize: 16, fontWeight: FontWeight.bold, ), ), ], ), const SizedBox(height: 12), Row( children: [ Container( padding: const EdgeInsets.symmetric(horizontal: 12, vertical: 6), decoration: BoxDecoration( color: statusColor.withValues(alpha: 0.2), borderRadius: BorderRadius.circular(16), ), child: Text( statusLabel, style: TextStyle( color: statusColor, fontWeight: FontWeight.bold, ), ), ), ], ), const SizedBox(height: 12), Text( advice, style: const TextStyle(fontSize: 14, height: 1.6), ), ], ), ), ); } /// 頻度分析 Widget _buildFrequencyAnalysis(Map<String, dynamic> analysis) { final status = analysis[
