Repository: aka209859-max/gym-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es, ja, ko, zh, zh_tw

source: Delete template
de: Vorlage löschen
es: Eliminar plantilla
ja: テンプレート削除
ko: 템플릿 삭제
zh: 删除模板
zh_tw: 删除模板

source: share
de: Teilen
es: compartir
ja: 共有
ko: 공유
zh: 分享
zh_tw: 分享

# shareWorkout
source: Share your training
de: Training teilen
es: Comparte tu entrenamiento
ja: トレーニングをシェア
ko: 트레이닝 공유
zh: 分享训练
zh_tw: 分享训练

# shareProgress
source: Share your progress
de: Fortschritt teilen
es: Comparte tu progreso
ja: 進捗をシェア
ko: 진행 공유
zh: 分享进度
zh_tw: 分享进度

# shareAchievement
source: Share your achievements
de: Erfolg teilen
es: Comparte tus logros
ja: 実績をシェア
ko: 성과 공유
zh: 分享成就
zh_tw: 分享成就

source: Copy link
de: Link kopieren
es: Copiar enlace
ja: リンクをコピー
ko: 링크 복사
zh: 复制链接
zh_tw: 复制链接

# shareToSocial
source: Share on social media
de: In sozialen Medien teilen
es: Compartir en redes sociales
ja: SNSでシェア
ko: SNS에 공유
zh: 分享到社交媒体
zh_tw: 分享到社交媒体

source: language
de: Sprache
es: idioma
ja: 言語
ko: 언어
zh: 语言
zh_tw: 语言

source: Language settings
de: Spracheinstellungen
es: Configuración de idioma
ja: 言語設定
ko: 언어 설정
zh: 语言设置
zh_tw: 语言设置

# notifications
source: notification
de: Benachrichtigungen
es: notificación
ja: 通知
ko: 알림
zh: 通知
zh_tw: 通知

source: Notification settings
de: Benachrichtigungseinstellungen
es: Configuración de notificaciones
ja: 通知設定
ko: 알림 설정
zh: 通知设置
zh_tw: 通知设置

source: privacy
de: Datenschutz
es: privacidad
ja: プライバシー
ko: 개인정보
zh: 隐私
zh_tw: 隐私

source: terms of service
de: Nutzungsbedingungen
es: Condiciones de servicio
ja: 利用規約
ko: 이용약관
zh: 服务条款
zh_tw: 服务条款

source: Privacy Policy
de: Datenschutzrichtlinie
es: política de privacidad
ja: プライバシーポリシー
ko: 개인정보 처리방침
zh: 隐私政策
zh_tw: 隐私政策

# about
source: About GYM MATCH
de: Über GYM MATCH
es: Acerca de GYM MATCH
ja: GYM MATCHについて
ko: GYM MATCH 정보
zh: 关于GYM MATCH
zh_tw: 关于GYM MATCH

source: Version
es: Versión
ja: バージョン
ko: 버전
zh: 版本
zh_tw: 版本

# deleteAccount
source: Account deletion
de: Konto löschen
es: Eliminación de cuenta
ja: アカウント削除
ko: 계정 삭제
zh: 删除账户
zh_tw: 删除账户

# languageJapanese
source: Japanese
de: 日本語 (Japanisch)
es: japonés
ja: 日本語
ko: 日本語 (일본어)
zh: 日本語 (日语)
zh_tw: 日本語 (日語)

# languageKorean
source: Home
de: 한국어 (Koreanisch)
es: Hogar
ja: 한국어
ko: 한국어
zh: 한국어 (韩语)
zh_tw: 한국어 (韓語)

# languageChinese
source: Chinese (simplified)
de: 中文 (Chinesisch vereinfacht)
es: Chino (simplificado)
ja: 中文（简体）
ko: 中文 (중국어 간체)
zh: 中文（简体）
zh_tw: 中文（简体）

# languageChineseTW
source: Chinese (Traditional)
de: 中文 (Chinesisch traditionell)
es: Chino (tradicional)
ja: 中文（繁體）
ko: 中文 (중국어 번체)
zh: 中文（繁體）
zh_tw: 中文（繁體）

# languageGerman
source: German
de: Deutsch
es: Alemán
ja: Deutsch
ko: Deutsch (독일어)
zh: Deutsch (德语)
zh_tw: Deutsch (德語)

# languageSpanish
source: Spanish
de: Español (Spanisch)
es: Español
ja: Español
ko: Español (스페인어)
zh: Español (西班牙语)
zh_tw: Español (西班牙語)

# workoutDetails
source: Training Details
de: トレーニングDetails
es: Detalles de la formación
ja: トレーニング詳細
ko: 상세 정보
zh: トレーニング详情
zh_tw: トレーニング詳情

# exerciseHistory
source: Event History
de: Übung履歴
es: Historial de eventos
ja: 種目履歴
ko: 운동 기록
zh: 运动履歴
zh_tw: 運動履歴

source: average weight
de: DurchschnittGewicht
es: peso promedio
ja: 平均重量
ko: 평균 무게
zh: [ZH] 平均重量
zh_tw: [ZH_TW] 平均重量

# selectDate
source: Select a date
de: Tag付をAuswählen
es: Seleccione una fecha
ja: 日付を選択
ko: 날짜 선택
zh: 日付を选择
zh_tw: 日付を選擇

# selectBodyPart
source: Select the part
de: 部位をAuswählen
es: Seleccione la pieza
ja: 部位を選択
ko: 부위 선택
zh: 部位を选择
zh_tw: 部位を選擇

# addCustomExercise
source: Add a custom event
de: Benutzerdefinierte Übung hinzufügen
es: Agregar un evento personalizado
ja: カスタム種目を追加
ko: 사용자 정의 운동 추가
zh: 添加自定义练习
zh_tw: カスタム運動を新增

# exerciseName
source: Event name
de: Übung名
es: Nombre del evento
ja: 種目名
ko: 운동 이름
zh: 运动名
zh_tw: 運動名

# exerciseNameHint
source: Example: bench press
de: [DE] 例: ベンチプレス
es: Ejemplo: press de banca
ja: 例: ベンチプレス
ko: 예: 벤치 프레스
zh: [ZH] 例: ベンチプレス
zh_tw: [ZH_TW] 例: ベンチプレス

# deleteExercise
source: Delete an event
de: ÜbungをLöschen
es: Eliminar un evento
ja: 種目を削除
ko: 운동 삭제
zh: 运动を删除
zh_tw: 運動を刪除

source: Delete Set
de: SatzをLöschen
es: Eliminar conjunto
ja: セットを削除
ko: 세트 삭제
zh: 组を删除
zh_tw: 組を刪除

source: Copy Set
de: Satzをコピー
es: Conjunto de copias
ja: セットをコピー
ko: 세트 복사
zh: 组をコピー
zh_tw: 組をコピー

source: Paste Set
de: Satzを貼り付け
es: Juego de pasta
ja: セットを貼り付け
ko: 세트 붙여넣기
zh: 组を貼り付け
zh_tw: 組を貼り付け

# deleteWorkout
source: Delete a workout
de: トレーニングをLöschen
es: Eliminar un entrenamiento
ja: トレーニングを削除
ko: 운동 삭제
zh: トレーニングを删除
zh_tw: トレーニングを刪除

# deleteWorkoutConfirm
source: Do you want to delete this training record?
de: このTrainingsprotokollをLöschenしますか？
es: ¿Quieres eliminar este registro de entrenamiento?
ja: このトレーニング記録を削除しますか？
ko: 이 운동 기록을 삭제하시겠습니까?
zh: この训练记录を删除しますか？
zh_tw: この訓練記錄を刪除しますか？

# deleteWorkoutSuccess
source: Training record deleted
de: TrainingsprotokollをLöschenしました
es: Registro de entrenamiento eliminado
ja: トレーニング記録を削除しました
ko: 운동 기록 삭제됨
zh: 训练记录を删除しました
zh_tw: 訓練記錄を刪除しました

# saveWorkout
source: keep
de: Speichern
es: mantener
ja: 保存
ko: 저장
zh: 保存
zh_tw: 儲存

# saveWorkoutSuccess
source: Training record saved
de: TrainingsprotokollをSpeichernしました
es: Registro de entrenamiento guardado
ja: トレーニング記録を保存しました
ko: 운동 기록 저장됨
zh: 训练记录を保存しました
zh_tw: 訓練記錄を儲存しました

# saveWorkoutError
source: Save failed
de: SpeichernにFehlgeschlagenしました
es: Error al guardar
ja: 保存に失敗しました
ko: 저장 실패
zh: 保存に失败しました
zh_tw: 儲存に失敗しました

# loadingWorkouts
source: Loading...
de: Lädt...
es: Cargando...
ja: 読み込み中...
ko: 로딩 중...
zh: 加载中...
zh_tw: 載入中...

# noWorkouts
source: No training records
de: Trainingsprotokollがありません
es: No hay registros de entrenamiento
ja: トレーニング記録がありません
ko: 운동 기록 없음
zh: 训练记录がありません
zh_tw: 訓練記錄がありません

# noExercises
source: There is no event
de: Übungがありません
es: No hay ningún evento
ja: 種目がありません
ko: 운동 없음
zh: 运动がありません
zh_tw: 運動がありません

# addFirstExercise
source: Add your first event
de: 最初のÜbungをHinzufügenしましょう
es: Añade tu primer evento
ja: 最初の種目を追加しましょう
ko: 첫 운동 추가
zh: 最初の运动を添加しましょう
zh_tw: 最初の運動を新增しましょう

source: Gym Search
de: ジムSuchen
es: Búsqueda de gimnasio
ja: ジム検索
ko: 체육관 검색
zh: 搜索健身房
zh_tw: ジム搜尋

source: Gym List
de: [DE] ジム一覧
es: Lista de gimnasios
ja: ジム一覧
ko: 헬스장 목록
zh: [ZH] ジム一覧
zh_tw: [ZH_TW] ジム一覧

source: Gym Name
de: Fitnessstudio-Name
es: Nombre del gimnasio
ja: ジム名
ko: 헬스장 이름
zh: 健身房名称
zh_tw: 健身房名稱

# gymAddress
source: address
de: [DE] 住所
es: DIRECCIÓN
ja: 住所
ko: 주소
zh: [ZH] 住所
zh_tw: [ZH_TW] 住所

# gymPhone
source: telephone number
de: [DE] 電話番号
es: número telefónico
ja: 電話番号
ko: 전화
zh: [ZH] 電話番号
zh_tw: [ZH_TW] 電話番号

# gymOpeningHours
source: Opening hours
de: 営業Zeit
es: Horario de apertura
ja: 営業時間
ko: 영업 시간
zh: 営業时间
zh_tw: [ZH_TW] 営業時間

# gymAccess
source: access
de: [DE] アクセス
es: acceso
ja: アクセス
ko: 교통편
zh: [ZH] アクセス
zh_tw: [ZH_TW] アクセス

# gymFacilities
source: equipment
de: [DE] 設備
es: equipo
ja: 設備
ko: 시설
zh: [ZH] 設備
zh_tw: [ZH_TW] 設備

# gymPrice
source: Fee
de: [DE] 料金
es: Tarifa
ja: 料金
ko: 가격
zh: [ZH] 料金
zh_tw: [ZH_TW] 料金

# gymReviews
source: review
de: [DE] レビュー
es: revisar
ja: レビュー
ko: 리뷰
zh: [ZH] レビュー
zh_tw: [ZH_TW] レビュー

# writeReview
source: Write a review
de: [DE] レビューを書く
es: Escribe una reseña
ja: レビューを書く
ko: 리뷰 작성
zh: [ZH] レビューを書く
zh_tw: [ZH_TW] レビューを書く

# rating
source: evaluation
de: [DE] 評価
es: evaluación
ja: 評価
ko: 평가
zh: [ZH] 評価
zh_tw: [ZH_TW] 評価

# ratingRequired
source: Choose your rating
de: 評価をAuswählenBitte
es: Elige tu calificación
ja: 評価を選択してください
ko: 평가 선택 필요
zh: 評価を选择请
zh_tw: 評価を選擇請

# reviewText
source: Review Content
de: [DE] レビュー内容
es: Revisar contenido
ja: レビュー内容
ko: 리뷰
zh: [ZH] レビュー内容
zh_tw: [ZH_TW] レビュー内容

# reviewTextHint
source: Please write your thoughts about the gym
de: [DE] ジムの感想を書いてください
es: Por favor escribe tus pensamientos sobre el gimnasio.
ja: ジムの感想を書いてください
ko: 의견 작성
zh: [ZH] ジムの感想を書いてください
zh_tw: [ZH_TW] ジムの感想を書いてください

# submitReview
source: Write a review
de: [DE] レビューを投稿
es: Escribe una reseña
ja: レビューを投稿
ko: 리뷰 제출
zh: [ZH] レビューを投稿
zh_tw: [ZH_TW] レビューを投稿

# searchNearby
source: Find a gym near you
de: 近くのジムをSuchen
es: Encuentra un gimnasio cerca de ti
ja: 近くのジムを検索
ko: 주변 검색
zh: 近くのジムを搜索
zh_tw: 近くのジムを搜尋

source: current location
de: [DE] 現在地
es: ubicación actual
ja: 現在地
ko: 현재 위치
zh: [ZH] 現在地
zh_tw: [ZH_TW] 現在地

# reportCrowd
source: Report congestion level
de: Auslastungを報告
es: Informar sobre el nivel de congestión
ja: 混雑度を報告
ko: 혼잡도 보고
zh: 拥挤度を報告
zh_tw: 擁擠度を報告

# empty
source: Available
de: [DE] 空いている
es: Disponible
ja: 空いている
ko: 비어있음
zh: [ZH] 空いている
zh_tw: [ZH_TW] 空いている

# moderate
source: usually
de: [DE] 普通
es: generalmente
ja: 普通
ko: 보통
zh: [ZH] 普通
zh_tw: [ZH_TW] 普通

# crowded
source: congestion
de: [DE] 混雑
es: congestión
ja: 混雑
ko: 혼잡
zh: [ZH] 混雑
zh_tw: [ZH_TW] 混雑

source: Very crowded
de: [DE] とても混雑
es: Muy concurrido
ja: とても混雑
ko: 매우 혼잡
zh: [ZH] とても混雑
zh_tw: [ZH_TW] とても混雑

source: Add to Favorites
de: お気に入りにHinzufügen
es: Añadir a favoritos
ja: お気に入りに追加
ko: 즐겨찾기 추가
zh: お気に入りに添加
zh_tw: お気に入りに新增

source: Remove from Favorites
de: お気に入りからLöschen
es: Eliminar de favoritos
ja: お気に入りから削除
ko: 즐겨찾기 제거
zh: お気に入りから删除
zh_tw: お気に入りから刪除

# favoriteAdded
source: Added to favorites
de: お気に入りにHinzufügenしました
es: Añadido a favoritos
ja: お気に入りに追加しました
ko: 즐겨찾기 추가됨
zh: お気に入りに添加しました
zh_tw: お気に入りに新增しました

# favoriteRemoved
source: Removed from favorites
de: お気に入りからLöschenしました
es: Eliminado de favoritos
ja: お気に入りから削除しました
ko: 즐겨찾기 제거됨
zh: お気に入りから删除しました
zh_tw: お気に入りから刪除しました

# noFavorites
source: There is no favorite gym
de: [DE] お気に入りのジムがありません
es: No hay gimnasio favorito
ja: お気に入りのジムがありません
ko: 즐겨찾기 없음
zh: [ZH] お気に入りのジムがありません
zh_tw: [ZH_TW] お気に入りのジムがありません

# auth
source: certification
de: [DE] 認証
es: proceso de dar un título
ja: 認証
ko: 인증
zh: [ZH] 認証
zh_tw: [ZH_TW] 認証

# confirmPassword
source: Password (confirm)
de: パスワード（Bestätigen）
es: Contraseña (confirmar)
ja: パスワード（確認）
ko: 비밀번호 확인
zh: パスワード（确认）
zh_tw: 密碼（確認）

source: Reset password
de: パスワードをリSatz
es: Restablecer contraseña
ja: パスワードをリセット
ko: 비밀번호 재설정
zh: パスワードをリ组
zh_tw: パスワードをリ組

# sendResetEmail
source: Send a reset email
de: リSatzメールをSenden
es: Enviar un correo electrónico de restablecimiento
ja: リセットメールを送信
ko: 재설정 이메일 전송
zh: リ组メールを发送
zh_tw: リ組メールを傳送

source: Email sent
de: メールをSendenしました
es: Correo electrónico enviado
ja: メールを送信しました
ko: 이메일 전송됨
zh: メールを发送しました
zh_tw: メールを傳送しました

# emailRequired
source: Enter your email address
de: メールアドレスを入力Bitte
es: Introduzca su dirección de correo electrónico
ja: メールアドレスを入力してください
ko: 이메일 필수
zh: メールアドレスを入力请
zh_tw: メールアドレスを入力請

# passwordRequired
source: Please enter your password
de: パスワードを入力Bitte
es: Por favor, introduzca su contraseña
ja: パスワードを入力してください
ko: 비밀번호 필수
zh: パスワードを入力请
zh_tw: パスワードを入力請

# passwordTooShort
source: Password is too short
de: Passwortが短すぎます
es: La contraseña es demasiado corta
ja: パスワードが短すぎます
ko: 비밀번호는 6자 이상
zh: 密码が短すぎます
zh_tw: 密碼が短すぎます

# passwordMismatch
source: Passwords do not match
de: Passwortが一致しません
es: Las contraseñas no coinciden
ja: パスワードが一致しません
ko: 비밀번호 불일치
zh: 密码が一致しません
zh_tw: 密碼が一致しません

# invalidEmail
source: Invalid email address
de: UngültigなE-Mail-Adresse
es: Dirección de correo electrónico no válida
ja: 無効なメールアドレス
ko: 유효하지 않은 이메일
zh: 无效な电子邮件
zh_tw: 無效な電子郵件

# loginError
source: login failed
de: ログインにFehlgeschlagenしました
es: error de inicio de sesion
ja: ログインに失敗しました
ko: 로그인 실패
zh: ログインに失败しました
zh_tw: 登入に失敗しました

# signUpError
source: Registration failed
de: RegistrierenにFehlgeschlagenしました
es: El registro falló
ja: 登録に失敗しました
ko: 회원가입 실패
zh: 注册に失败しました
zh_tw: 註冊に失敗しました

# alreadyHaveAccount
source: If you have an account
de: [DE] アカウントをお持ちの方
es: Si tienes una cuenta
ja: アカウントをお持ちの方
ko: 계정이 있으신가요?
zh: [ZH] アカウントをお持ちの方
zh_tw: [ZH_TW] アカウントをお持ちの方

# dontHaveAccount
source: Don't have an account?
de: [DE] アカウントをお持ちでない方
es: ¿No tienes una cuenta?
ja: アカウントをお持ちでない方
ko: 계정이 없으신가요?
zh: [ZH] アカウントをお持ちでない方
zh_tw: [ZH_TW] アカウントをお持ちでない方

source: or
de: [DE] または
es: o
ja: または
ko: 또는
zh: [ZH] または
zh_tw: [ZH_TW] または

source: Continue with Google
de: [DE] Googleで続ける
es: Continuar con Google
ja: Googleで続ける
ko: Google로 계속
zh: [ZH] Googleで続ける
zh_tw: [ZH_TW] Googleで続ける

source: Continue with Apple
de: [DE] Appleで続ける
es: Continuar con Apple
ja: Appleで続ける
ko: Apple로 계속
zh: [ZH] Appleで続ける
zh_tw: [ZH_TW] Appleで続ける

source: New Message
de: [DE] 新しいメッセージ
es: Nuevo mensaje
ja: 新しいメッセージ
ko: 새 메시지
zh: [ZH] 新しいメッセージ
zh_tw: [ZH_TW] 新しいメッセージ

# sendMessage
source: send
de: Senden
es: enviar
ja: 送信
ko: 전송
zh: 发送
zh_tw: 傳送

# messageHint
source: Enter your message
de: [DE] メッセージを入力
es: Ingrese su mensaje
ja: メッセージを入力
ko: 메시지 입력
zh: [ZH] メッセージを入力
zh_tw: [ZH_TW] メッセージを入力

source: No messages
de: [DE] メッセージがありません
es: No hay mensajes
ja: メッセージがありません
ko: 메시지 없음
zh: [ZH] メッセージがありません
zh_tw: [ZH_TW] メッセージがありません

# typingIndicator
source: Typing...
de: [DE] 入力中...
es: Mecanografía...
ja: 入力中...
ko: 입력 중...
zh: [ZH] 入力中...
zh_tw: [ZH_TW] 入力中...

source: online
de: [DE] オンライン
es: en línea
ja: オンライン
ko: 온라인
zh: [ZH] オンライン
zh_tw: [ZH_TW] オンライン

source: off-line
de: [DE] オフライン
es: desconectado
ja: オフライン
ko: 오프라인
zh: [ZH] オフライン
zh_tw: [ZH_TW] オフライン

# lastSeen
source: Last Login
de: 最終Anmelden
es: Último inicio de sesión
ja: 最終ログイン
ko: 마지막 접속
zh: 最終登录
zh_tw: 最終登入

# lastSeenAt
source: Log in at {time}
de: {time}にAnmelden
es: Iniciar sesión a las {time}
ja: {time}にログイン
ko: 마지막 접속 {time}
zh: {time}に登录
zh_tw: {time}に登入

source: AI Coaching
es: Coaching de IA
ja: AIコーチング
ko: AI 코칭
zh: AI教练
zh_tw: AI教練

# aiAnalyzing
source: AI analysis in progress...
de: AI analysiert...
es: Análisis de IA en progreso...
ja: AI分析中...
ko: AI 분석 중...
zh: AI分析中...
zh_tw: AI分析中...

# aiRecommendation
source: AI recommended menu
de: [DE] AI推奨メニュー
es: Menú recomendado por IA
ja: AI推奨メニュー
ko: AI 추천
zh: [ZH] AI推奨メニュー
zh_tw: [ZH_TW] AI推奨メニュー

# aiCredits
source: AI usage count
de: AI利用Wiederholungen
es: Recuento de uso de IA
ja: AI利用回数
ko: AI 크레딧
zh: AI利用次数
zh_tw: AI利用次數

# aiCreditsRemaining
source: {count} remaining
de: [DE] 残り{count}回
es: {count} restantes
ja: 残り{count}回
ko: {count}회 남음
zh: [ZH] 残り{count}回
zh_tw: [ZH_TW] 残り{count}回

# purchaseAICredits
source: Additional purchase of AI
de: AIHinzufügen購入
es: Compra adicional de IA
ja: AI追加購入
ko: AI 크레딧 구매
zh: AI添加購入
zh_tw: AI新增購入

# aiPurchaseSuccess
source: Added AI usage count
de: AI利用WiederholungenをHinzufügenしました
es: Se agregó el recuento de uso de IA
ja: AI利用回数を追加しました
ko: AI 크레딧 추가됨
zh: AI利用次数を添加しました
zh_tw: AI利用次數を新增しました

# aiPurchaseError
source: Purchase failed
de: 購入にFehlgeschlagenしました
es: Compra fallida
ja: 購入に失敗しました
ko: 구매 실패
zh: 購入に失败しました
zh_tw: [ZH_TW] 購入に失敗しました

# lastVisit
source: final visit
de: [DE] 最終訪問
es: visita final
ja: 最終訪問
ko: 마지막 방문
zh: [ZH] 最終訪問
zh_tw: [ZH_TW] 最終訪問

# visitCount
source: Number of visits
de: 訪問Wiederholungen
es: Número de visitas
ja: 訪問回数
ko: 방문 횟수
zh: 訪問次数
zh_tw: 訪問次數

# visitCountTimes
source: {count} times
de: [DE] {count}回
es: {count} veces
ja: {count}回
ko: {count}회
zh: [ZH] {count}回
zh_tw: [ZH_TW] {count}回

# noVisitHistory
source: There is no visit history
de: [DE] 訪問履歴がありません
es: No hay historial de visitas
ja: 訪問履歴がありません
ko: 방문 기록 없음
zh: [ZH] 訪問履歴がありません
zh_tw: [ZH_TW] 訪問履歴がありません

# errorOccurred
source: An error has occurred
de: Fehler: {e}
es: Se ha producido un error.
ja: エラーが発生しました
ko: 오류 발생
zh: 错误: {e}
zh_tw: 錯誤: $e

# networkError
source: Network Error: API connection failed
de: ネットワークFehler: API接続にFehlgeschlagenしました
es: Error de red: Falló la conexión a la API
ja: ネットワークエラー: API接続に失敗しました
ko: 네트워크 오류
zh: ネットワーク错误: API接続に失败しました
zh_tw: ネットワーク錯誤: API接続に失敗しました

source: Server Error
de: サーバーFehler
es: Error del servidor
ja: サーバーエラー
ko: 서버 오류
zh: サーバー错误
zh_tw: サーバー錯誤

source: Unknown Error
de: UnbekanntなFehler
es: Error desconocido
ja: 不明なエラー
ko: 알 수 없는 오류
zh: 未知な错误
zh_tw: 未知な錯誤

# tryAgain
source: retry
de: [DE] 再試行
es: rever
ja: 再試行
ko: 다시 시도
zh: [ZH] 再試行
zh_tw: [ZH_TW] 再試行

source: Load more
de: [DE] さらに読み込む
es: Cargar más
ja: さらに読み込む
ko: 더 보기
zh: [ZH] さらに読み込む
zh_tw: [ZH_TW] さらに読み込む

# refresh
source: update
de: Aktualisieren
es: actualizar
ja: 更新
ko: 새로고침
zh: 更新
zh_tw: 更新

source: Pull to refresh
de: 引っ張ってAktualisieren
es: Tirar para refrescar
ja: 引っ張って更新
ko: 당겨서 새로고침
zh: [ZH] 引っ張って更新
zh_tw: [ZH_TW] 引っ張って更新

source: No data
de: [DE] データがありません
es: No hay datos
ja: データがありません
ko: 데이터 없음
zh: [ZH] データがありません
zh_tw: [ZH_TW] データがありません

# noResults
source: No results found
de: [DE] 結果が見つかりません
es: No se encontraron resultados
ja: 結果が見つかりません
ko: 결과 없음
zh: [ZH] 結果が見つかりません
zh_tw: [ZH_TW] 結果が見つかりません

source: Search Results
de: Suchergebnisse
es: Resultados de la búsqueda
ja: 検索結果
ko: 검색 결과
zh: 搜索结果
zh_tw: 搜尋結果

# resultsCount
source: {count} items
de: [DE] {count}件
es: {count} artículos
ja: {count}件
ko: {count}개 결과
zh: [ZH] {count}件
zh_tw: [ZH_TW] {count}件

# confirmAction
source: Do you want to perform this operation?
de: [DE] この操作を実行しますか？
es: ¿Quieres realizar esta operación?
ja: この操作を実行しますか？
ko: 이 작업을 확인하시겠습니까?
zh: [ZH] この操作を実行しますか？
zh_tw: [ZH_TW] この操作を実行しますか？

# areYouSure
source: Is that okay?
de: Sind Sie sicher?
es: ¿Está bien eso?
ja: よろしいですか？
ko: 확실합니까?
zh: 确定吗？
zh_tw: 確定嗎？

# cannotUndo
source: This action cannot be undone
de: [DE] この操作は取り消せません
es: Esta acción no se puede deshacer
ja: この操作は取り消せません
ko: 이 작업은 취소할 수 없습니다
zh: [ZH] この操作は取り消せません
zh_tw: [ZH_TW] この操作は取り消せません

source: Previous
de: [DE] 前へ
es: Anterior
ja: 前へ
ko: 이전
zh: [ZH] 前へ
zh_tw: [ZH_TW] 前へ

source: skip
de: Überspringen
es: saltar
ja: スキップ
ko: 건너뛰기
zh: 跳过
zh_tw: 跳過

# add
source: addition
de: Hinzufügen
es: suma
ja: 追加
ko: 추가
zh: 添加
zh_tw: 新增

# remove
source: delete
de: Löschen
es: borrar
ja: 削除
ko: 제거
zh: 删除
zh_tw: 刪除

# select
source: choice
de: Auswählen
es: elección
ja: 選択
ko: 선택
zh: 选择
zh_tw: 選擇

source: Select All
de: すべてAuswählen
es: Seleccionar todo
ja: すべて選択
ko: 모두 선택
zh: すべて选择
zh_tw: すべて選擇

# deselectAll
source: Deselect
de: Auswählenを解除
es: Deseleccionar
ja: 選択を解除
ko: 선택 해제
zh: 选择を解除
zh_tw: 選擇を解除

source: Clear
de: Löschen
es: Claro
ja: クリア
ko: 지우기
zh: 清除
zh_tw: 清除

source: Reset
de: リSatz
es: Reiniciar
ja: リセット
ko: 초기화
zh: リ组
zh_tw: リ組

# apply
source: Applicable
de: [DE] 適用
es: Aplicable
ja: 適用
ko: 적용
zh: [ZH] 適用
zh_tw: [ZH_TW] 適用

source: Filter
es: Filtrar
ja: フィルター
ko: 필터
zh: 筛选
zh_tw: 篩選

source: Sort
de: Sortieren
es: Clasificar
ja: 並び替え
ko: 정렬
zh: 排序
zh_tw: 排序

# ascending
source: ascending order
de: [DE] 昇順
es: orden ascendente
ja: 昇順
ko: 오름차순
zh: [ZH] 昇順
zh_tw: [ZH_TW] 昇順

# descending
source: descending order
de: [DE] 降順
es: orden descendente
ja: 降順
ko: 내림차순
zh: [ZH] 降順
zh_tw: [ZH_TW] 降順

source: date
de: Tag付
es: fecha
ja: 日付
ko: 날짜
zh: [ZH] 日付
zh_tw: [ZH_TW] 日付

source: time
de: Zeit
es: tiempo
ja: 時間
ko: 시간
zh: 时间
zh_tw: 時間

source: today
de: Heute
es: hoy
ja: 今日
ko: 오늘
zh: 今天
zh_tw: 今天

source: yesterday
de: Gestern
es: ayer
ja: 昨日
ko: 어제
zh: 昨天
zh_tw: 昨天

source: tomorrow
de: Morgen
es: mañana
ja: 明日
ko: 내일
zh: 明天
zh_tw: 明天

source: last week
de: Letzte Woche
es: la semana pasada
ja: 先週
ko: 지난 주
zh: 上周
zh_tw: 上週

source: last month
de: Letzter Monat
es: mes pasado
ja: 先月
ko: 지난 달
zh: 上月
zh_tw: 上月

source: this year
de: 今Jahr
es: este año
ja: 今年
ko: 올해
zh: [ZH] 今年
zh_tw: [ZH_TW] 今年

source: last year
de: 昨Jahr
es: el año pasado
ja: 昨年
ko: 작년
zh: [ZH] 昨年
zh_tw: [ZH_TW] 昨年

# dateRange
source: period
de: [DE] 期間
es: período
ja: 期間
ko: 기간
zh: [ZH] 期間
zh_tw: [ZH_TW] 期間

source: start date
de: StartTag
es: fecha de inicio
ja: 開始日
ko: 시작일
zh: 开始日
zh_tw: [ZH_TW] 開始日

source: End Date
de: EndeTag
es: Fecha de finalización
ja: 終了日
ko: 종료일
zh: 结束日
zh_tw: 結束日

source: from
de: [DE] から
es: de
ja: から
ko: 부터
zh: [ZH] から
zh_tw: [ZH_TW] から

source: to
de: [DE] まで
es: a
ja: まで
ko: 까지
zh: [ZH] まで
zh_tw: [ZH_TW] まで

source: notification
de: Benachrichtigungen
es: notificación
ja: 通知
ko: 알림
zh: 通知
zh_tw: 通知

# notificationTitle
source: notification
de: Benachrichtigungen
es: notificación
ja: 通知
ko: 알림
zh: 通知
zh_tw: 通知

source: Enable notifications
de: BenachrichtigungenをGültigにする
es: Habilitar notificaciones
ja: 通知を有効にする
ko: 알림 활성화
zh: 通知を有效にする
zh_tw: 通知を有效にする

source: Disable notifications
de: BenachrichtigungenをUngültigにする
es: Desactivar notificaciones
ja: 通知を無効にする
ko: 알림 비활성화
zh: 通知を无效にする
zh_tw: 通知を無效にする

# notificationPermission
source: Notification permission required
de: Benachrichtigungenの許可が必要です
es: Se requiere permiso de notificación
ja: 通知の許可が必要です
ko: 알림 권한 필요
zh: [ZH] 通知の許可が必要です
zh_tw: [ZH_TW] 通知の許可が必要です

source: Push notifications
de: プッシュBenachrichtigungen
es: Notificaciones push
ja: プッシュ通知
ko: 푸시 알림
zh: [ZH] プッシュ通知
zh_tw: [ZH_TW] プッシュ通知

source: Email notifications
de: メールBenachrichtigungen
es: Notificaciones por correo electrónico
ja: メール通知
ko: 이메일 알림
zh: [ZH] メール通知
zh_tw: [ZH_TW] メール通知

# workoutReminders
source: Training Reminders
de: [DE] トレーニングリマインダー
es: Recordatorios de entrenamiento
ja: トレーニングリマインダー
ko: 운동 알림
zh: [ZH] トレーニングリマインダー
zh_tw: [ZH_TW] トレーニングリマインダー

# profileEdit
source: Edit profile
de: プロフィールBearbeiten
es: Editar perfil
ja: プロフィール編集
ko: 프로필 편집
zh: プロフィール编辑
zh_tw: プロフィール編輯

source: display name
de: Anzeigen名
es: nombre para mostrar
ja: 表示名
ko: 표시 이름
zh: 显示名
zh_tw: 顯示名

# displayNameHint
source: nickname
de: [DE] ニックネーム
es: apodo
ja: ニックネーム
ko: 닉네임
zh: [ZH] ニックネーム
zh_tw: [ZH_TW] ニックネーム

# bio
source: self-introduction
de: [DE] 自己紹介
es: autopresentación
ja: 自己紹介
ko: 소개
zh: [ZH] 自己紹介
zh_tw: [ZH_TW] 自己紹介

# bioHint
source: Enter your self-introduction
de: [DE] 自己紹介を入力
es: Introduce tu presentación
ja: 自己紹介を入力
ko: 자기소개 입력
zh: [ZH] 自己紹介を入力
zh_tw: [ZH_TW] 自己紹介を入力

# birthday
source: date of birth
de: 生JahrMonatTag
es: fecha de nacimiento
ja: 生年月日
ko: 생년월일
zh: [ZH] 生年月日
zh_tw: [ZH_TW] 生年月日

# gender
source: sex
de: Geschlecht
es: sexo
ja: 性別
ko: 성별
zh: 性别
zh_tw: 性別

source: male
de: Männlich
es: masculino
ja: 男性
ko: 남성
zh: 男
zh_tw: 男

# female
source: woman
de: Weiblich
es: mujer
ja: 女性
ko: 여성
zh: 女
zh_tw: 女

# other
source: others
de: [DE] その他
es: otros
ja: その他
ko: 기타
zh: [ZH] その他
zh_tw: [ZH_TW] その他

# preferNotToSay
source: Do not answer
de: [DE] 回答しない
es: No respondas
ja: 回答しない
ko: 응답 안 함
zh: [ZH] 回答しない
zh_tw: [ZH_TW] 回答しない

source: Profile photo
de: [DE] プロフィール写真
es: Foto de perfil
ja: プロフィール写真
ko: 프로필 사진
zh: [ZH] プロフィール写真
zh_tw: [ZH_TW] プロフィール写真

source: Change photo
de: 写真をÄndern
es: Cambiar foto
ja: 写真を変更
ko: 사진 변경
zh: 写真を更改
zh_tw: 写真を變更

# removePhoto
source: Delete Photo
de: 写真をLöschen
es: Eliminar foto
ja: 写真を削除
ko: 사진 제거
zh: 写真を删除
zh_tw: 写真を刪除

# takePhoto
source: Take a photo
de: [DE] 写真を撮る
es: Toma una foto
ja: 写真を撮る
ko: 사진 촬영
zh: [ZH] 写真を撮る
zh_tw: [ZH_TW] 写真を撮る

# chooseFromLibrary
source: Select from library
de: ライブラリからAuswählen
es: Seleccionar de la biblioteca
ja: ライブラリから選択
ko: 라이브러리에서 선택
zh: ライブラリから选择
zh_tw: ライブラリから選擇

source: general
de: [DE] 一般
ja: 一般
ko: 일반
zh: [ZH] 一般
zh_tw: [ZH_TW] 一般

source: account
de: [DE] アカウント
es: cuenta
ja: アカウント
ko: 계정
zh: [ZH] アカウント
zh_tw: [ZH_TW] アカウント

source: Security
de: [DE] セキュリティ
es: Seguridad
ja: セキュリティ
ko: 보안
zh: [ZH] セキュリティ
zh_tw: [ZH_TW] セキュリティ

source: Change Password
de: パスワードÄndern
es: Cambiar la contraseña
ja: パスワード変更
ko: 비밀번호 변경
zh: パスワード更改
zh_tw: パスワード變更

# changeEmail
source: Change email address
de: メールアドレスÄndern
es: Cambiar dirección de correo electrónico
ja: メールアドレス変更
ko: 이메일 변경
zh: メールアドレス更改
zh_tw: メールアドレス變更

source: Current Password
de: 現在のPasswort
es: Contraseña actual
ja: 現在のパスワード
ko: 현재 비밀번호
zh: 現在の密码
zh_tw: 現在の密碼

source: New Password
de: 新しいPasswort
es: Nueva contraseña
ja: 新しいパスワード
ko: 새 비밀번호
zh: 新しい密码
zh_tw: 新しい密碼

# confirmNewPassword
source: New password (confirm)
de: 新しいパスワード（Bestätigen）
es: Nueva contraseña (confirmar)
ja: 新しいパスワード（確認）
ko: 새 비밀번호 확인
zh: 新しいパスワード（确认）
zh_tw: 新しい密碼（確認）

source: Password changed
de: パスワードをÄndernしました
es: Contraseña cambiada
ja: パスワードを変更しました
ko: 비밀번호 변경됨
zh: パスワードを更改しました
zh_tw: パスワードを變更しました

# emailChanged
source: I changed my email address
de: メールアドレスをÄndernしました
es: Cambié mi dirección de correo electrónico
ja: メールアドレスを変更しました
ko: 이메일 변경됨
zh: メールアドレスを更改しました
zh_tw: メールアドレスを變更しました

source: help
de: Hilfe
es: ayuda
ja: ヘルプ
ko: 도움말
zh: 帮助
zh_tw: 幫助
